
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>常见问题 QA · A Programmer's Guide to English</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="WhyPTE.html" />
    
    
    <link rel="prev" href="../training/Thinking.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    关于本指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../essence/">
            
                <a href="../essence/">
            
                    
                    语言学习的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../make-a-program/">
            
                <a href="../make-a-program/">
            
                    
                    如何构建一个识别英语的程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../training/">
            
                <a href="../training/">
            
                    
                    我的训练方法
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../training/KnowledgeBase.html">
            
                <a href="../training/KnowledgeBase.html">
            
                    
                    扩充语料库的训练方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../training/ListeningandSpeaking.html">
            
                <a href="../training/ListeningandSpeaking.html">
            
                    
                    发音和听力训练方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../training/Thinking.html">
            
                <a href="../training/Thinking.html">
            
                    
                    英语思维训练
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="./">
            
                <a href="./">
            
                    
                    常见问题 QA
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="WhyPTE.html">
            
                <a href="WhyPTE.html">
            
                    
                    为什么我选择 PTE 考试
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../resources/">
            
                <a href="../resources/">
            
                    
                    资料、工具推荐和扩展阅读
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >常见问题 QA</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5E38;&#x89C1;&#x95EE;&#x9898;-qa">&#x5E38;&#x89C1;&#x95EE;&#x9898; QA</h1>
<h2 id="&#x4F60;&#x53EA;&#x6709;&#x96C5;&#x601D;-65-&#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x4E5F;&#x6562;&#x5199;&#x82F1;&#x8BED;&#x7ECF;&#x9A8C;&#xFF1F;">&#x4F60;&#x53EA;&#x6709;&#x96C5;&#x601D; 6.5 &#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x4E5F;&#x6562;&#x5199;&#x82F1;&#x8BED;&#x7ECF;&#x9A8C;&#xFF1F;</h2>
<p>&#x662F;&#x7684;&#xFF0C;&#x8FD9;&#x7B97;&#x662F;&#x6211;&#x7684;&#x9636;&#x6BB5;&#x6027;&#x603B;&#x7ED3;&#xFF0C;&#x603B;&#x7ED3;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5BF9;&#x5B66;&#x4E60;&#x7684;&#x611F;&#x609F;&#x5E76;&#x5206;&#x4EAB;&#x7528;&#x8FC7;&#x6709;&#x6548;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x3001;&#x8D44;&#x6E90;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x6216;&#x591A;&#x6216;&#x5C11;&#x7684;&#x5E2E;&#x52A9;&#x5230;&#x6709;&#x9700;&#x8981;&#x7684;&#x670B;&#x53CB;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x6211;&#x5728;&#x5199;&#x6307;&#x5357;&#x4E4B;&#x524D;&#xFF0C;&#x4E5F;&#x66FE;&#x7ECF;&#x60F3;&#x8FC7;&#x653E;&#x5F03;&#xFF0C;&#x56E0;&#x4E3A;&#x56DE;&#x5934;&#x6765;&#x770B;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4E1C;&#x897F;&#x597D;&#x50CF;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x56DE;&#x987E;&#x4E4B;&#x524D;&#x7B14;&#x8BB0;&#x53D1;&#x73B0;&#x5BF9;&#x4E8E;&#x5F53;&#x65F6;&#x6C34;&#x5E73;&#x8F83;&#x4F4E;&#x7684;&#x81EA;&#x5DF1;&#x662F;&#x4E00;&#x9053;&#x9053;&#x7684;&#x574E;&#x3002;&#x518D;&#x52A0;&#x4E0A;&#x4E4B;&#x524D;&#x5BF9;&#x670B;&#x53CB;&#x7684;&#x627F;&#x8BFA;&#x8FC7;&#x4F1A;&#x5199;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#x7ED9;&#x4ED6;&#x4EEC;&#x770B;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x5199;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6709;&#x9519;&#x8BEF;&#x3001;&#x5EFA;&#x8BAE;&#x6216;&#x8005;&#x7591;&#x95EE;&#xFF0C;&#x6B22;&#x8FCE; Issue &#x8865;&#x5145;&#x548C;&#x8BA8;&#x8BBA;&#x5B8C;&#x5584;&#x3002;&#x6211;&#x4E5F;&#x5728;&#x7EE7;&#x7EED;&#x5B66;&#x4E60;&#xFF0C;&#x968F;&#x7740;&#x6211;&#x8FDB;&#x4E00;&#x6B65;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4E5F;&#x4F1A;&#x7EE7;&#x7EED;&#x5B8C;&#x5584;&#x3001;&#x4FEE;&#x6539;&#x8FD9;&#x4EFD;&#x6307;&#x5357;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8FD9;&#x4EFD;&#x6307;&#x5357;&#xFF1F;">&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8FD9;&#x4EFD;&#x6307;&#x5357;&#xFF1F;</h2>
<ol>
<li>&#x5148;<strong>&#x4E86;&#x89E3;&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x7684;&#x672C;&#x8D28;</strong>&#xFF0C;&#x5373;&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x5230;&#x5E95;&#x662F;&#x8981;&#x5B66;&#x4E60;&#x4EC0;&#x4E48;&#xFF0C;&#x8BAD;&#x7EC3;&#x4EC0;&#x4E48;&#x3002;</li>
<li>&#x4E86;&#x89E3;&#x672C;&#x4EBA;&#x7684;&#x4E00;&#x4E9B;&#x6709;&#x6548;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;<strong>&#x67E5;&#x770B;&#x6211;&#x662F;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x672C;&#x8D28;&#x63A8;&#x65AD;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x6709;&#x6548;</strong>&#x3002;</li>
<li>&#x6309;&#x7167;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x5B9A;&#x5236;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x65E5;&#x540E;&#x770B;&#x5230;<strong>&#x67D0;&#x4E9B;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x65F6;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x63A8;&#x65AD;&#x8BE5;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x6709;&#x6548;</strong>&#x3002;</li>
</ol>
<p>&#x8FD9;&#x91CC;&#x4E3E;&#x4E00;&#x4E2A;&#x53CD;&#x4F8B;<a href="https://www.zhihu.com/question/48040579/answer/521694493" target="_blank">&#x6709;&#x4EC0;&#x4E48;&#x76F8;&#x89C1;&#x6068;&#x665A;&#x7684;&#x80CC;&#x5355;&#x8BCD;&#x65B9;&#x6CD5;&#xFF1F;</a>&#xFF0C;&#x5927;&#x6982;&#x601D;&#x8DEF;&#x5C31;&#x662F; 10 &#x4E2A;&#x968F;&#x673A;&#x5355;&#x8BCD;&#x4E00;&#x7EC4;&#xFF0C;&#x5148;&#x5927;&#x4F53;&#x4E00;&#x770B;&#xFF0C;&#x5F00;&#x59CB;&#x7F16;&#x6545;&#x4E8B;&#x4E32;&#x8054;&#x8D77;&#x6765;&#x5341;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x901A;&#x8FC7;&#x827E;&#x5BBE;&#x6D69;&#x65AF;&#x5468;&#x671F;&#x56DE;&#x987E;&#x8FD9;&#x7EC4;&#x5355;&#x8BCD;&#xFF0C;&#x56DE;&#x987E;&#x65F6;&#x906E;&#x4F4F;&#x6C49;&#x8BED;&#x610F;&#x601D;&#x5F00;&#x59CB;&#x56DE;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#x60F3;&#x60F3;&#x5C0F;&#x6545;&#x4E8B;&#xFF0C;&#x901A;&#x8FC7;&#x6545;&#x4E8B;&#x6765;&#x56DE;&#x5FC6;&#x8D77;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x610F;&#x601D;&#x3002;</p>
<p>&#x8FD9;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x8054;&#x60F3;&#x7684;&#x8BB0;&#x5FC6;&#x6280;&#x5DE7;&#xFF0C;&#x4F60;&#x8BD5;&#x4E00;&#x4E0B;&#x7EDD;&#x5BF9;&#x4E5F;&#x597D;&#x7528;&#x3002;&#x4F46;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li><strong>&#x8BCD;&#x4E49;&#x635F;&#x5931;&#x4E25;&#x91CD;&#x3002;</strong> &#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#x51E0;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E2D;&#x6587;&#x91CA;&#x4E49;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x57FA;&#x4E8E;&#x90E8;&#x5206;&#x4E2D;&#x6587;&#x91CA;&#x4E49;&#x6765;&#x7F16;&#x9020;&#x79BB;&#x5947;&#x5C0F;&#x6545;&#x4E8B;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x8BCD;&#x4E49;&#x7406;&#x89E3;&#x504F;&#x5DEE;&#x66F4;&#x4E25;&#x91CD;&#x3002;</li>
<li><strong>&#x8BED;&#x6599;&#x5E93;&#x5185;&#x5BB9;&#x4E0D;&#x6B63;&#x786E;&#x3002;</strong> &#x8BED;&#x6599;&#x5E93;&#x4F60;&#x9700;&#x8981;&#x8BB0;&#x5FC6;&#x7684;&#x662F; <code>&#x5355;&#x8BCD; -&gt; &#x8BF8;&#x591A;&#x91CA;&#x4E49;&#x3001;&#x4F8B;&#x53E5;&#x3001;&#x58F0;&#x97F3;&#x7B49;&#x7B49;</code>&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4F60;&#x8BB0;&#x4F4F;&#x7684;&#x662F; <code>&#x5355;&#x8BCD; -&gt; &#x51E0;&#x4E2A;&#x91CA;&#x4E49;&#xFF0C;&#x4E00;&#x4E2A;&#x6545;&#x4E8B;&#xFF0C;&#x6545;&#x4E8B;&#x5173;&#x8054;&#x7684;&#x5176;&#x4ED6;&#x5355;&#x8BCD;</code>&#x3002;</li>
<li><strong>&#x7F3A;&#x4E4F;&#x5F53;&#x524D;&#x5355;&#x8BCD;&#x542C;&#x529B;&#x548C;&#x53D1;&#x97F3;&#x7684;&#x8F93;&#x5165;&#x3001;&#x953B;&#x70BC;&#x3002;</strong></li>
</ol>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x6295;&#x5165;&#x7684;&#x6210;&#x672C;&#x548C;&#x6536;&#x83B7;&#x6BD4;&#x6BD4;&#x8F83;&#x4F4E;&#x3002;&#x8BD5;&#x60F3;&#xFF1A;&#x5F53;&#x4E00;&#x4E2A;&#x8001;&#x5916;&#x5BF9;&#x4F60;&#x8BF4;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x4F60;&#x4F1A;&#x7528;&#x6545;&#x4E8B;&#x53BB;&#x8054;&#x60F3;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x662F;&#x4EC0;&#x4E48;&#x4E2D;&#x6587;&#x610F;&#x601D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53BB;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#x5417;&#xFF1F;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x4E2D;&#x6587;&#x610F;&#x601D;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x662F;&#x8001;&#x5916;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5355;&#x8BCD;&#x4F60;&#x53EF;&#x80FD;&#x8BF4;&#x8D77;&#x6765;&#x78D5;&#x78D5;&#x78B0;&#x78B0;&#x751A;&#x81F3;&#x53D1;&#x97F3;&#x662F;&#x9519;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x80CC;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x51C6;&#x786E;&#x7684;&#x53D1;&#x97F3;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x8BAD;&#x7EC3;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5C3D;&#x91CF;&#x7528;&#x82F1;&#x6587;&#x5B66;&#x4E60;&#xFF0C;&#x800C;&#x4E0D;&#x501F;&#x52A9;&#x4E2D;&#x6587;&#x7FFB;&#x8BD1;&#x5B66;&#x4E60;&#xFF1F;">&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5C3D;&#x91CF;&#x7528;&#x82F1;&#x6587;&#x5B66;&#x4E60;&#xFF0C;&#x800C;&#x4E0D;&#x501F;&#x52A9;&#x4E2D;&#x6587;&#x7FFB;&#x8BD1;&#x5B66;&#x4E60;&#xFF1F;</h2>
<p><strong>&#x7B2C;&#x4E00;&#xFF0C;&#x7FFB;&#x8BD1;&#x662F;&#x6709;&#x635F;&#x7684;&#x3002;</strong> &#x5F53;&#x4F60;&#x5728;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x8BED;&#x6599;&#x65F6;&#xFF0C;&#x638C;&#x63E1;&#x6700;&#x51C6;&#x786E;&#x5B8C;&#x5584;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x6700;&#x5173;&#x952E;&#x7684;&#xFF0C;&#x4E2D;&#x6587;&#x8BCD;&#x5178;&#x5F80;&#x5F80;&#x4F1A;&#x7ED9;&#x4F60;&#x62BD;&#x8C61;&#x8868;&#x8FBE;&#xFF0C;&#x5BFC;&#x81F4;&#x4F60;&#x63A5;&#x6536;&#x5230;&#x4E86;&#x6709;&#x635F;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x968F;&#x4FBF;&#x7528;&#x5E38;&#x89C1;&#x5355;&#x8BCD; <code>cover</code> &#x4E3E;&#x4F8B;&#xFF1A;</p>
<p>&#x5728; Cambridge Dictionary &#x4E0A;&#x9762;&#xFF0C;&#x5BF9;&#x4E8E; <code>cover</code> &#x6709;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C; <code>report</code> &#x7684;&#x91CA;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="../assets/cover-report.jpg" alt=""></p>
<p>&#x4ECE;&#x4E2D;&#x4F60;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x4E09;&#x4E2A;&#x4FE1;&#x606F;&#xFF1A; <strong>1. <code>cover</code> &#x6709;&#x62A5;&#x9053;&#x7684;&#x610F;&#x601D;&#x3002; 2. &#x901A;&#x5E38;&#x62A5;&#x544A;&#x7684;&#x662F; <code>news</code> &#x800C;&#x4E0D;&#x662F;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#x3002; 3. &#x800C;&#x4E14;&#x8FD8;&#x662F;&#x7279;&#x5B9A;&#x7684;&#x3001;&#x91CD;&#x8981;&#x4E8B;&#x4EF6;&#x7684;&#x65B0;&#x95FB;&#x3002;</strong> &#x7136;&#x540E;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x4E86;&#x4F8B;&#x53E5;&#xFF1A;&#x5979;&#x6B63;&#x5728; BBC &#x7535;&#x89C6;&#x53F0;&#x62A5;&#x9053;&#x7F8E;&#x56FD;&#x5927;&#x9009;&#x3002;</p>
<p>&#x56DE;&#x5934;&#x770B;&#x6B27;&#x8DEF;&#x8BCD;&#x5178;&#x9ED8;&#x8BA4;&#x5185;&#x7F6E;&#x8BCD;&#x5178;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5BF9; <code>cover</code> &#x91CA;&#x4E49;&#x7ECF;&#x8FC7;&#x7FFB;&#x8BD1;&#x548C;&#x62BD;&#x8C61;&#x7C7B;&#x6BD4;&#xFF08;&#x8FD9;&#x4E5F;&#x662F;&#x56FD;&#x5185;&#x8BCD;&#x5178;&#x5355;&#x8BCD;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x91CA;&#x4E49;&#x65B9;&#x5F0F;&#xFF09;&#xFF1A;</p>
<p><img src="../assets/cover-oulu.jpg" alt=""></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6709;<code>&#x91C7;&#x8BBF;&#xFF0C;&#x62A5;&#x5BFC;</code>&#x4E4B;&#x610F;&#xFF0C;&#x4F46;&#x662F;&#x4F60;<strong>&#x65E0;&#x6CD5;&#x5F97;&#x77E5;&#x5176;&#x5B9E;&#x5B83;&#x505A;&#x62A5;&#x9053;&#x65F6;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x62A5;&#x9053;&#x91CD;&#x8981;&#x4E8B;&#x4EF6;&#x65B0;&#x95FB;</strong>&#x3002;&#x8FD9;&#x6837;&#x5C31;<strong>&#x5BFC;&#x81F4;&#x9006;&#x5411;&#x8F93;&#x51FA;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x95EE;&#x9898;</strong>&#xFF0C;&#x7531;&#x4E8E; <code>report</code> &#x4E5F;&#x6709;&#x62A5;&#x9053;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x5F53;&#x4F60;&#x8981;&#x8868;&#x8FBE;&#x65F6;&#xFF0C;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x7528; <code>cover</code> &#x8FD8;&#x662F; <code>report</code> &#x5462;&#xFF1F;</p>
<p><strong>&#x8FD9;&#x4E5F;&#x662F;&#x5BFC;&#x81F4; Chinglish &#x51FA;&#x73B0;&#x7684;&#x539F;&#x56E0;</strong>&#xFF0C;<code>add</code> &#x662F;&#x52A0;&#x7684;&#x610F;&#x601D;&#xFF0C;<code>oil</code> &#x662F;&#x6CB9;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x90A3;<code>&#x52A0;&#x6CB9;</code>&#x82F1;&#x6587;&#x5F53;&#x7136;&#x5C31;&#x662F; <code>add oil</code> &#x4E86;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5E76;&#x4E0D;&#x6070;&#x5F53;&#xFF0C;&#x7531;&#x4E8E;&#x592A;&#x591A;&#x4E2D;&#x56FD;&#x4EBA;&#x7528;&#xFF0C;&#x5DF2;&#x7ECF;&#x88AB;&#x6536;&#x5F55;&#x5230;&#x8BCD;&#x5178;&#x4E2D;&#x4E86;&#xFF0C;&#x4ECE;&#x6B64;&#x4E0D;&#x518D;&#x662F; Chinglish&#x3002;</p>
<p><strong>&#x7B2C;&#x4E8C;&#xFF0C;&#x82F1;&#x6587;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x3001;&#x51C6;&#x786E;&#x5EA6;&#x66F4;&#x9AD8;&#x4E00;&#x4E9B;&#x3002;</strong> &#x6BD4;&#x5982; <code>cover</code> &#x8FD8;&#x6709;&#x5F88;&#x591A;&#x610F;&#x601D;&#xFF0C;&#x6BD4;&#x5982; <a href="../assets/cover-travel.jpg"><code>travel</code> &#x548C; <code>be enough</code> &#x7684;&#x610F;&#x601D;</a>&#xFF0C;&#x4F46;&#x662F;&#x4E2D;&#x6587;&#x8BCD;&#x5178;&#x7F3A;&#x5F88;&#x96BE;&#x67E5;&#x5230;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x4F8B;&#x53E5;&#x3002;&#x56E0;&#x4E3A;&#x4E2D;&#x6587;&#x8BCD;&#x5178;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x7B2C;&#x4E00;&#x624B;&#x8D44;&#x6599;&#xFF0C;&#x5176;&#x6B21;&#x8FD8;&#x9700;&#x8981;&#x4EBA;&#x7FFB;&#x8BD1;&#xFF0C;&#x8D28;&#x91CF;&#x53C2;&#x5DEE;&#x4E0D;&#x9F50;&#x3002;&#x7F13;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;&#x6717;&#x6587;&#x8BCD;&#x5E93;&#xFF0C;&#x89E3;&#x91CA;&#x548C;&#x4F8B;&#x53E5;&#x4F1A;&#x591A;&#x4E00;&#x4E9B;&#xFF0C;&#x6BD4;&#x8F83;&#x6743;&#x5A01;&#x51C6;&#x786E;&#xFF0C;&#x65B9;&#x6CD5;&#x4E0B;&#x8BE6;&#x3002;</p>
<h2 id="&#x5982;&#x679C;&#x6211;&#x6682;&#x65F6;&#x65E0;&#x6CD5;&#x63A5;&#x53D7;&#x5168;&#x82F1;&#x6587;&#x5B66;&#x4E60;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x53EF;&#x4EE5;&#x7528;&#x4EC0;&#x4E48;&#x4EE3;&#x66FF;&#xFF1F;">&#x5982;&#x679C;&#x6211;&#x6682;&#x65F6;&#x65E0;&#x6CD5;&#x63A5;&#x53D7;&#x5168;&#x82F1;&#x6587;&#x5B66;&#x4E60;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x53EF;&#x4EE5;&#x7528;&#x4EC0;&#x4E48;&#x4EE3;&#x66FF;&#xFF1F;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x65E0;&#x6CD5;&#x9002;&#x5E94;&#x82F1;&#x82F1;&#x8BCD;&#x5178;&#xFF0C;&#x90A3;&#x4E48;<strong>&#x6B27;&#x8DEF;&#x8BCD;&#x5178;</strong>&#x53EF;&#x80FD;&#x662F;&#x4F60;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5B83;&#x9644;&#x5E26;&#x4E86; Forvo &#x7684;&#x591A;&#x53E3;&#x97F3;&#x8BED;&#x97F3;&#x5E76;&#x4E14;&#x9488;&#x5BF9;&#x56FD;&#x5185;&#x7F51;&#x7EDC;&#x52A0;&#x901F;&#xFF0C;&#x90E8;&#x5206;&#x5355;&#x8BCD;&#x8FD8;&#x4F1A;&#x6709;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x652F;&#x6301;&#x5F88;&#x591A;&#x5B9E;&#x7528;&#x529F;&#x80FD;&#xFF0C;&#x5173;&#x8054;&#x7D20;&#x6750;&#x4FE1;&#x606F;&#x91CF;&#x4E5F;&#x5F88;&#x5927;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x5E38;&#x89C1;&#x8BCD;&#x5BF9;&#x6BD4;&#x3002;&#x662F;&#x6211;&#x7528;&#x8FC7;&#x7684;&#x6700;&#x597D;&#x7684;&#x672C;&#x5730;&#x8BCD;&#x5178;&#xFF0C;&#x5BF9;&#x6BD4;&#x6709;&#x9053;&#x7B49;&#x5176;&#x4ED6;&#x7ADE;&#x54C1;&#x5F3A;&#x5927;&#x592A;&#x591A;&#x3002;</p>
<p>&#x6B64;&#x5916;&#x6717;&#x6587;&#x8BCD;&#x5E93;&#x662F;&#x975E;&#x5E38;&#x597D;&#x7684;&#x8BCD;&#x5E93;&#xFF0C;&#x76F8;&#x6BD4;&#x6B27;&#x8DEF;&#x5185;&#x7F6E;&#x8BCD;&#x5E93;&#x6743;&#x5A01;&#x8BE6;&#x7EC6;&#x7684;&#x591A;&#xFF0C;<a href="http://www.mrfan.org/dicts" target="_blank">&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4E0B;&#x8F7D;&#x5E76;&#x5B89;&#x88C5;</a>&#xFF08;<a href="https://github.com/yujiangshui/A-Programmers-Guide-to-English/blob/master/assets/%E6%9C%97%E6%96%87%E5%BD%93%E4%BB%A3%E8%8B%B1%E8%AF%AD%E8%AF%8D%E5%85%B8%E8%8B%B1%E6%B1%89%E5%8F%8C%E8%A7%A3%E8%AF%8D%E5%85%B8.mdx" target="_blank">&#x53EF;&#x4EE5;&#x70B9;&#x51FB;&#x8FD9;&#x91CC;&#x76F4;&#x63A5;&#x4E0B;&#x8F7D;</a>&#xFF09;&#x3002;&#x6B27;&#x8DEF;&#x5185;&#x7F6E;&#x8BCD;&#x5E93;&#x9519;&#x8BEF;&#x8FD8;&#x662F;&#x633A;&#x591A;&#x7684;&#xFF0C;&#x4E3B;&#x8981;&#x96C6;&#x4E2D;&#x5728;&#x97F3;&#x6807;&#x548C;&#x53D1;&#x97F3;&#x4E0D;&#x5BF9;&#xFF08;&#x97F3;&#x6807;&#x65F6;&#x800C;&#x7F8E;&#x5F0F;&#x6807;&#x8BB0;&#xFF0C;&#x65F6;&#x800C;&#x82F1;&#x5F0F;&#xFF0C;&#x53D1;&#x97F3;&#x4F30;&#x8BA1;&#x662F;&#x6293;&#x53D6;&#x7684;&#xFF0C;&#x8D28;&#x91CF;&#x4E00;&#x822C;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x7FFB;&#x8BD1;&#x51FA;&#x6765;&#x7684;&#x4FE1;&#x606F;&#x4E0D;&#x591F;&#x51C6;&#x786E;&#x3002;&#x6211;&#x5DF2;&#x7ECF;&#x53CD;&#x9988;&#x8FC7; 5+ &#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x5F97;&#x5230;&#x4EC0;&#x4E48;&#x53CD;&#x5E94;&#xFF0C;&#x540E;&#x6765;&#x5C31;&#x61D2;&#x5F97;&#x53CD;&#x9988;&#x4E86;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#x9047;&#x5230;&#x4EFB;&#x4F55;&#x7591;&#x95EE;&#x8FD8;&#x662F;&#x4EE5; Cambridge Dictionary &#x4E3A;&#x51C6;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528;-anki&#xFF1F;">&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528; Anki&#xFF1F;</h2>
<p><strong>&#x53EA;&#x6709;&#x5927;&#x91CF;&#x91CD;&#x590D;&#x624D;&#x662F;&#x82F1;&#x8BED;&#x5B66;&#x4E60;&#x552F;&#x4E00;&#x7684;&#x94F6;&#x5F39;&#x3002;</strong> &#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x91CD;&#x590D;&#x5E76;&#x4E0D;&#x662F;&#x77ED;&#x65F6;&#x95F4;&#x6781;&#x5927;&#x91CF;&#x7684;&#x91CD;&#x590D;&#xFF0C;&#x800C;&#x662F;&#x95F4;&#x65AD;&#x6027;&#x7ECF;&#x5E38;&#x6027;&#x7684;&#x91CD;&#x590D;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x53CD;&#x590D;&#x523A;&#x6FC0;&#x5927;&#x8111;&#x5F62;&#x6210;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x3002;&#x6700;&#x8457;&#x540D;&#x7684;&#x5C31;&#x662F;<a href="https://www.wikiwand.com/zh/%E9%81%97%E5%BF%98%E6%9B%B2%E7%BA%BF" target="_blank">&#x827E;&#x5BBE;&#x6D69;&#x65AF;&#x9057;&#x5FD8;&#x66F2;&#x7EBF;</a>&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x5468;&#x671F;&#x7684;&#x590D;&#x4E60;&#x548C;&#x523A;&#x6FC0;&#xFF0C;&#x4F1A;&#x6301;&#x7EED;&#x5DE9;&#x56FA;&#x8BB0;&#x5FC6;&#x3002;</p>
<p><a href="https://apps.ankiweb.net/" target="_blank">Anki</a> &#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8BB0;&#x5FC6;&#x8F85;&#x52A9;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x66F4;&#x5408;&#x7406;&#x7684;&#x590D;&#x4E60;&#x5468;&#x671F;&#x5E2E;&#x52A9;&#x4F60;&#x8BB0;&#x5FC6;&#x4E00;&#x4EFD;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x5361;&#x7247;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x81EA;&#x6211;&#x8BB0;&#x5FC6;&#x68C0;&#x6D4B;&#xFF0C;&#x6839;&#x636E;&#x4F60;&#x81EA;&#x5DF1;&#x8BC4;&#x4F30;&#x7684;&#x8BB0;&#x5FC6;&#x6548;&#x679C;&#xFF0C;Anki &#x4F1A;&#x81EA;&#x52A8;&#x5B89;&#x6392;&#x4E0B;&#x4E00;&#x6B21;&#x590D;&#x4E60;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x6837;&#x5BF9;&#x4E8E;&#x4F60;&#x65E0;&#x9700;&#x5173;&#x5FC3;&#x4EC0;&#x4E48;&#x65F6;&#x95F4;&#x8981;&#x590D;&#x4E60;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x628A;&#x5F53;&#x524D; Anki &#x7684;&#x590D;&#x4E60;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x5373;&#x53EF;&#x3002;</p>
<h2 id="&#x5927;&#x91CF;&#x7684;&#x542C;&#x82F1;&#x8BED;&#x6750;&#x6599;&#x548C;&#x770B;&#x7F8E;&#x5267;&#x80FD;&#x953B;&#x70BC;&#x82F1;&#x8BED;&#x542C;&#x529B;&#x5417;&#xFF1F;">&#x5927;&#x91CF;&#x7684;&#x542C;&#x82F1;&#x8BED;&#x6750;&#x6599;&#x548C;&#x770B;&#x7F8E;&#x5267;&#x80FD;&#x953B;&#x70BC;&#x82F1;&#x8BED;&#x542C;&#x529B;&#x5417;&#xFF1F;</h2>
<p>&#x662F;&#x5426;&#x6709;&#x6548;&#x5173;&#x952E;&#x770B;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x4EFD;&#x542C;&#x529B;&#x6750;&#x6599;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x505A;&#x7CBE;&#x542C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x505A;&#x6CDB;&#x542C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x770B;&#x7F8E;&#x5267;&#x53EA;&#x662F;&#x770B;&#x770B;&#x70ED;&#x95F9;&#xFF0C;&#x770B;&#x770B;&#x5B57;&#x5E55;&#x5C31;&#x8FC7;&#x4E86;&#xFF0C;&#x663E;&#x7136;&#x63D0;&#x5347;&#x975E;&#x5E38;&#x6709;&#x9650;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x770B;&#x5B57;&#x5E55;&#x8BD5;&#x56FE;&#x5F3A;&#x884C;&#x901A;&#x8FC7;&#x542C;&#x6765;&#x7406;&#x89E3;&#x5267;&#x60C5;&#x770B;&#x61C2;&#x7F8E;&#x5267;&#xFF0C;&#x542C;&#x529B;&#x63D0;&#x5347;&#x4E5F;&#x662F;&#x5341;&#x5206;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x751F;&#x8BCD;&#x4F60;&#x5149;&#x9760;&#x542C;&#x662F;&#x8BA4;&#x8BC6;&#x4E0D;&#x4E86;&#x7684;&#x3001;&#x5199;&#x4E0D;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4F1A;&#x5728;&#x5403;&#x996D;&#x7684;&#x65F6;&#x5019;&#x770B;&#x7F8E;&#x5267;&#x6216;&#x8005;&#x7535;&#x5F71;&#xFF0C;&#x540C;&#x65F6;&#x4F1A;&#x7559;&#x610F;&#x5267;&#x4E2D;&#x8BF4;&#x7684;&#x82F1;&#x8BED;&#xFF0C;&#x9047;&#x5230;&#x65B0;&#x9896;&#x7684;&#x6216;&#x8005;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x8868;&#x8FBE;&#x4F1A;&#x8FD4;&#x56DE;&#x53BB;&#x6765;&#x56DE;&#x770B;&#x5B57;&#x5E55;&#x542C;&#x53D1;&#x97F3;&#x3002;&#x8FD9;&#x6216;&#x8BB8;&#x4F1A;&#x6BD4;&#x6CDB;&#x542C;&#x6548;&#x679C;&#x66F4;&#x597D;&#x4E00;&#x70B9;&#xFF0C;&#x4F46;&#x8FDC;&#x4E0D;&#x5982;&#x7CBE;&#x542C;&#x3002;</p>
<h2 id="&#x82F1;&#x8BED;&#x80FD;&#x5426;&#x901F;&#x6210;&#xFF1F;&#x7F51;&#x4E0A;&#x90A3;&#x4E9B;&#x5FEB;&#x901F;&#x80CC;&#x5355;&#x8BCD;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x6709;&#x6548;&#x679C;&#xFF1F;">&#x82F1;&#x8BED;&#x80FD;&#x5426;&#x901F;&#x6210;&#xFF1F;&#x7F51;&#x4E0A;&#x90A3;&#x4E9B;&#x5FEB;&#x901F;&#x80CC;&#x5355;&#x8BCD;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x6709;&#x6548;&#x679C;&#xFF1F;</h2>
<p><strong>&#x4F60;&#x8D8A;&#x65E9;&#x660E;&#x767D;&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x6CA1;&#x6709;&#x6280;&#x5DE7;&#xFF0C;&#x5C31;&#x4F1A;&#x8D70;&#x8D8A;&#x5C11;&#x7684;&#x5F2F;&#x8DEF;&#x3001;&#x82B1;&#x8D8A;&#x5C11;&#x7684;&#x51A4;&#x6789;&#x94B1;&#x3002;</strong></p>
<p>&#x5F53;&#x7136;&#x53EF;&#x80FD;&#x4E5F;&#x6709;&#x597D;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5206;&#x6790;&#x4E0B;&#x662F;&#x5426;&#x80FD;&#x771F;&#x6B63;&#x5B66;&#x5230;&#x3001;&#x7EC3;&#x5230;&#xFF0C;&#x518D;&#x51B3;&#x5B9A;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4E0D;&#x8FC7;&#x9664;&#x975E;&#x5929;&#x624D;&#xFF0C;&#x901F;&#x6210;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0A;&#x9762;&#x4ECB;&#x7ECD;&#xFF0C;&#x82F1;&#x8BED;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x592A;&#x5927;&#xFF0C;&#x800C;&#x4E14;&#x91CD;&#x70B9;&#x662F;&#x8BAD;&#x7EC3;&#x6210;&#x65E0;&#x610F;&#x8BC6;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F9D;&#x8D56;&#x4E00;&#x4E9B;&#x601D;&#x8003;&#x548C;&#x6280;&#x5DE7;&#xFF0C;&#x90A3;&#x4E48;&#x80AF;&#x5B9A;&#x4F1A;&#x5361;&#x987F;&#xFF0C;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x4EA4;&#x6D41;&#x3002;</p>
<h3 id="&#x591A;&#x5C11;&#x8BCD;&#x6C47;&#x91CF;&#x624D;&#x7B97;&#x662F;&#x638C;&#x63E1;&#x82F1;&#x8BED;&#xFF1F;">&#x591A;&#x5C11;&#x8BCD;&#x6C47;&#x91CF;&#x624D;&#x7B97;&#x662F;&#x638C;&#x63E1;&#x82F1;&#x8BED;&#xFF1F;</h3>
<p>&#x89E3;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5173;&#x952E;&#x8FD8;&#x662F;&#x770B;&#x4F60;&#x5BF9;&#x82F1;&#x8BED;&#x7684;&#x9700;&#x6C42;&#x3002;&#x5047;&#x8BBE;&#xFF1A;</p>
<ul>
<li>&#x4F60;&#x7684;&#x9700;&#x6C42;&#x662F;&#x505A;&#x4E00;&#x540D;&#x4F63;&#x4EBA;&#x3001;&#x4FDD;&#x59C6;&#xFF0C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x4F1A;&#x62FC;&#x5199;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4F1A;&#x8BF4;&#x5E38;&#x89C1;&#x656C;&#x8BED;&#x5C31;&#x53EF;&#x4EE5;&#x3002;</li>
<li>&#x4F60;&#x7684;&#x9700;&#x6C42;&#x662F;&#x505A;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x65E5;&#x5E38;&#x8BCD;&#x6C47;&#x9700;&#x8981;&#x5B66;&#x4F1A;&#xFF0C;&#x540C;&#x65F6;&#x5DE5;&#x4F5C;&#x8303;&#x56F4;&#x4E13;&#x4E1A;&#x8BCD;&#x6C47;&#x4E5F;&#x8981;&#x660E;&#x767D;&#x3002;</li>
<li>&#x4F60;&#x7684;&#x9700;&#x6C42;&#x662F;&#x505A;&#x8BED;&#x8A00;&#x5B66;&#x8005;&#xFF0C;&#x90A3;&#x4E48;&#x57FA;&#x672C;&#x5C11;&#x4E0D;&#x4E86;&#x51E0;&#x4E07;&#x7684;&#x8BCD;&#x6C47;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x91CC;&#x63A8;&#x8350;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;<a href="https://zhuanlan.zhihu.com/p/26175433" target="_blank">&#x806A;&#x660E;&#x4EBA;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x80CC;&#x5355;&#x8BCD;&#xFF1F;</a>&#xFF0C;&#x4F5C;&#x8005;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x7EDF;&#x8BA1;&#x53D1;&#x73B0;&#x80CC;&#x719F; 7000 &#x4E2A;&#x5355;&#x8BCD;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x8868;&#x8FBE; 90% &#x7684;&#x573A;&#x666F;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5E73;&#x65E5;&#x7528;&#x7684;&#x4E2D;&#x6587;&#x4E00;&#x6837;&#x3002;&#x800C;&#x5269;&#x4F59;&#x7684; 10% &#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0A;&#x4E0B;&#x6587;&#x8BED;&#x5883;&#x7B49;&#x63A8;&#x65AD;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x540C;&#x65F6;&#x8BE5;&#x6587;&#x4F5C;&#x8005;&#x6574;&#x7406;&#x51FA;&#x6765;&#x4E86;&#x9EA6;&#x514B;&#x7C73;&#x4F26; 7000 &#x9AD8;&#x9891;&#x8BCD;&#x8BB0;&#x5FC6;&#x5361;&#xFF08;Anki&#xFF09;&#x5E76;&#x5F00;&#x653E;&#x4E0B;&#x8F7D;&#xFF0C;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x6211;&#x653E;&#x5728;&#x4E86; GitHub &#x4E00;&#x4EFD;&#xFF0C;&#x53EF;&#x4EE5;<a href="https://github.com/yujiangshui/A-Programmers-Guide-to-English/blob/master/assets/%E9%BA%A6%E5%85%8B%E7%B1%B3%E4%BC%A67000%E9%AB%98%E9%A2%91%E8%AF%8D.apkg.zip" target="_blank">&#x70B9;&#x51FB;&#x8FD9;&#x91CC;&#x4E0B;&#x8F7D;</a>&#x3002;&#x9700;&#x8981;&#x5B89;&#x88C5; Anki&#xFF0C;&#x89E3;&#x538B;&#x540E;&#x53CC;&#x51FB;&#x5373;&#x53EF;&#x81EA;&#x52A8;&#x5BFC;&#x5165;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x5E76;&#x4E0D;&#x8BA4;&#x540C;&#x4F5C;&#x8005;&#x7684;&#x6B7B;&#x8BB0;&#x786C;&#x80CC;&#x4E2D;&#x6587;&#x8BCD;&#x4E49;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x539F;&#x56E0;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#xFF0C;&#x5EFA;&#x8BAE;&#x4EC5;&#x4F5C;&#x4E3A;&#x5217;&#x8868;&#xFF0C;&#x901A;&#x8FC7;&#x524D;&#x9762;&#x6269;&#x5C55;&#x8BED;&#x6599;&#x5E93;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x80CC;&#x8BF5;&#x3002;</p>
<h3 id="&#x4F60;&#x80CC;&#x8BF5;&#x5355;&#x8BCD;&#x7684;&#x65B9;&#x6CD5;&#x6B65;&#x9AA4;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x592A;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x5417;&#xFF1F;">&#x4F60;&#x80CC;&#x8BF5;&#x5355;&#x8BCD;&#x7684;&#x65B9;&#x6CD5;&#x6B65;&#x9AA4;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x592A;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x5417;&#xFF1F;</h3>
<p>&#x5728;&#x524D;&#x9762;&#x6269;&#x5C55;&#x8BED;&#x6599;&#x5E93;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x7684;&#x65B9;&#x5F0F;&#x4F1A;&#x6253;&#x5F00;&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#x6709;&#x5F88;&#x591A;&#x64CD;&#x4F5C;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x8F93;&#x5165;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x53CD;&#x9988;&#x8FD9;&#x6837;&#x662F;&#x5426;&#x6709;&#x5FC5;&#x8981;&#x3002;</p>
<p>&#x5728;&#x6211;&#x770B;&#x6765;&#x5F53;&#x7136;&#x662F;&#x6709;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x73B0;&#x5728;&#x662F;&#x4E00;&#x4E2A;&#x5916;&#x56FD;&#x4EBA;&#xFF0C;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x5BF9;&#x5E94;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x4F60;&#x719F;&#x7EC3;&#x638C;&#x63E1;&#x4E86;&#x7684;&#x3002;&#x5982;&#x679C;&#x662F;&#x4E00;&#x4E9B;&#x4F60;&#x5FC5;&#x987B;&#x719F;&#x7EC3;&#x638C;&#x63E1;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x4E00;&#x6B21;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x638C;&#x63E1;&#x3001;&#x7EC3;&#x597D;&#xFF0C;&#x53CD;&#x800C;&#x8981;&#x5B66;&#x4E2A;&#x534A;&#x540A;&#x5B50;&#x5728;&#x540E;&#x7EED;&#x7684;&#x9605;&#x8BFB;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x4E0D;&#x65AD;&#x8BEF;&#x89E3;&#x3001;&#x8BD5;&#x9519;&#x518D;&#x56DE;&#x5934;&#x67E5;&#x8BE2;&#xFF1F;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../training/Thinking.html" class="navigation navigation-prev " aria-label="Previous page: 英语思维训练">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="WhyPTE.html" class="navigation navigation-next " aria-label="Next page: 为什么我选择 PTE 考试">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"常见问题 QA","level":"1.5","depth":1,"next":{"title":"为什么我选择 PTE 考试","level":"1.5.1","depth":2,"path":"qa/WhyPTE.md","ref":"./qa/WhyPTE.md","articles":[]},"previous":{"title":"英语思维训练","level":"1.4.3","depth":2,"path":"training/Thinking.md","ref":"./training/Thinking.md","articles":[]},"dir":"ltr"},"config":{"plugins":["editlink","ga","book-summary-scroll-position-saver","disqus","github","splitter"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"a-programmers-guide-to-english"},"github":{"url":"https://github.com/yujiangshui/A-Programmers-Guide-to-English"},"editlink":{"label":"Edit This Page","multilingual":false,"base":"https://github.com/yujiangshui/A-Programmers-Guide-to-English/edit/master"},"book-summary-scroll-position-saver":{},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"ga":{"configuration":"auto","token":"UA-57557739-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"A Programmer's Guide to English","gitbook":"*"},"file":{"path":"qa/README.md","mtime":"2019-03-26T14:02:11.579Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-02-21T22:16:25.683Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-book-summary-scroll-position-saver/book-summary-scroll-position-saver.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

