
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>为什么我选择 PTE 考试 · A Programmer's Guide to English</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../resources/" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    关于本指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../essence/">
            
                <a href="../essence/">
            
                    
                    语言学习的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../make-a-program/">
            
                <a href="../make-a-program/">
            
                    
                    如何构建一个识别英语的程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../training/">
            
                <a href="../training/">
            
                    
                    我的训练方法
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../training/KnowledgeBase.html">
            
                <a href="../training/KnowledgeBase.html">
            
                    
                    扩充语料库的训练方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../training/ListeningandSpeaking.html">
            
                <a href="../training/ListeningandSpeaking.html">
            
                    
                    发音和听力训练方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../training/Thinking.html">
            
                <a href="../training/Thinking.html">
            
                    
                    英语思维训练
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="./">
            
                <a href="./">
            
                    
                    常见问题 QA
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.5.1" data-path="WhyPTE.html">
            
                <a href="WhyPTE.html">
            
                    
                    为什么我选择 PTE 考试
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../resources/">
            
                <a href="../resources/">
            
                    
                    资料、工具推荐和扩展阅读
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >为什么我选择 PTE 考试</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x9009;&#x62E9;-pte-&#x8003;&#x8BD5;">&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x9009;&#x62E9; PTE &#x8003;&#x8BD5;</h1>
<p><a href="https://pearsonpte.com/" target="_blank">PTE</a> &#x5B66;&#x672F;&#x8003;&#x8BD5;&#x662F;&#x4E8E; 2009 &#x5E74; 10 &#x6708; 26 &#x65E5;&#x63A8;&#x51FA;&#x7684;&#x65B0;&#x4E00;&#x4EE3;&#x7684;&#x56FD;&#x9645;&#x6027;&#x82F1;&#x8BED;&#x6C34;&#x5E73;&#x6D4B;&#x8BD5;&#xFF0C;&#x7531;&#x91D1;&#x878D;&#x65F6;&#x62A5;&#x7684;&#x6BCD;&#x516C;&#x53F8;&#x82F1;&#x56FD;&#x57F9;&#x751F;&#x96C6;&#x56E2;&#x4EE5;&#x53CA; GMAT &#x7684;&#x5F00;&#x53D1;&#x673A;&#x6784;&#x7BA1;&#x7406;&#x4E13;&#x4E1A;&#x7814;&#x7A76;&#x751F;&#x5165;&#x5B66;&#x8003;&#x8BD5;&#x59D4;&#x5458;&#xFF08;GMAC&#xFF09;&#x5171;&#x540C;&#x7814;&#x7A76;&#x4E3B;&#x529E;&#x3002;</p>
<p>&#x5B83;&#x542C;&#x8BF4;&#x8BFB;&#x5199;&#x5B8C;&#x5168;&#x673A;&#x8003;&#xFF0C;&#x6253;&#x5206;&#x4E5F;&#x7531;&#x8BA1;&#x7B97;&#x673A;&#x5B8C;&#x6210;&#x3002;&#x9898;&#x578B;&#x975E;&#x5E38;&#x591A;&#x5E76;&#x4E14;&#x4EA4;&#x53C9;&#x6253;&#x5206;&#xFF0C;<strong>&#x5B83;&#x7684;&#x9898;&#x578B;&#x5BF9;&#x5E94;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x5F0F;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x82F1;&#x8BED;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x5F0F;&#x3002;</strong></p>
<h2 id="&#x5E38;&#x89C1;&#x9898;&#x578B;&#x8BBE;&#x7F6E;">&#x5E38;&#x89C1;&#x9898;&#x578B;&#x8BBE;&#x7F6E;</h2>
<p>&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B; PTE &#x8003;&#x8BD5;&#x4E3B;&#x8981;&#x7684;&#x9898;&#x578B;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;&#x5B83;&#x662F;&#x5F88;&#x5408;&#x7406;&#x7684;&#x3002;&#x7531;&#x4E8E;&#x7BC7;&#x5E45;&#x9650;&#x5236;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x4E00;&#x4E00;&#x4ECB;&#x7ECD;&#x5B8C;&#x6240;&#x6709;&#x9898;&#x578B;&#xFF0C;&#x56E0;&#x4E3A; PTE &#x6709; 20 &#x79CD;&#x9898;&#x578B;&#xFF0C;&#x6211;&#x53EA;&#x4ECB;&#x7ECD;&#x4E0E;&#x5176;&#x4ED6;&#x8003;&#x8BD5;&#x4E0D;&#x540C;&#x4E14;&#x975E;&#x5E38;&#x5408;&#x7406;&#x7684;&#x9898;&#x578B;&#x3002;</p>
<h3 id="speaking">Speaking</h3>
<p>&#x4E0B;&#x9762;&#x662F;&#x53E3;&#x8BED;&#x90E8;&#x5206;&#x7684;&#x9898;&#x578B;&#xFF0C;PTE &#x8BC4;&#x5206;&#x4F1A;&#x901A;&#x8FC7;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x4EE5;&#x53CA;&#x58F0;&#x6CE2;&#x3001;&#x8282;&#x594F;&#x5BF9;&#x6BD4;&#x8001;&#x5916;&#x53D1;&#x97F3;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5224;&#x5B9A;&#x4F60;&#x7684;&#x53E3;&#x8BED;&#x80FD;&#x529B;&#x548C;&#x5F97;&#x5206;&#x3002;</p>
<h4 id="read-aloud"><a href="https://pearsonpte.com/the-test/format/english-speaking-writing/read-aloud/" target="_blank">Read aloud</a></h4>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x578B;&#x662F;&#x7ED9;&#x4F60;&#x4E00;&#x6BB5;&#x82F1;&#x6587;&#x6587;&#x672C;&#xFF0C;&#x6309;&#x7167;&#x6587;&#x672C;&#x957F;&#x5EA6;&#x4F1A;&#x5148;&#x6709; 25s - 40s &#x65F6;&#x95F4;&#x51C6;&#x5907;&#xFF0C;&#x518D;&#x7ED9;&#x4F60; 30s - 40s &#x7684;&#x65F6;&#x95F4;&#x6717;&#x8BFB;&#x5E76;&#x5F55;&#x97F3;&#x3002;</p>
<p>&#x770B;&#x4F3C;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4E0D;&#x5C31;&#x662F;&#x7167;&#x7740;&#x8BFB;&#x561B;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x5F88;&#x80FD;&#x770B;&#x51FA;&#x4E00;&#x4E2A;&#x4EBA;&#x5B9E;&#x529B;&#xFF1A;</p>
<ul>
<li><strong>&#x4F60;&#x9700;&#x8981;&#x6E05;&#x695A;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x53D1;&#x97F3;&#xFF0C;</strong> &#x5426;&#x5219;&#x4F60;&#x80AF;&#x5B9A;&#x4F1A;&#x5361;&#x987F;&#xFF0C;&#x8BFB;&#x9519;&#x5355;&#x8BCD;&#x80AF;&#x5B9A;&#x662F;&#x6263;&#x5206;&#x7684;&#xFF0C;&#x5361;&#x987F;&#x591A;&#x4E86;&#x4F1A;&#x6389;&#x6D41;&#x5229;&#x5EA6;&#x7684;&#x5206;&#x3002;</li>
<li><strong>&#x4F60;&#x8981;&#x6709;&#x548C;&#x8001;&#x5916;&#x4E00;&#x6837;&#x7684;&#x97F5;&#x5F8B;&#x548C;&#x58F0;&#x8C03;&#x53D8;&#x5316;&#x3001;&#x91CD;&#x97F3;&#x4EE5;&#x53CA;&#x610F;&#x7FA4;&#x505C;&#x987F;&#x3002;</strong> &#x8FD9;&#x91CC;&#x5B8C;&#x5168;&#x6A21;&#x62DF;&#x65E5;&#x5E38;&#x4EA4;&#x6D41;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x53E3;&#x6C14;&#x5FEB;&#x901F;&#x8BFB;&#x5B8C;&#x5C31;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x65E5;&#x5E38;&#x4EA4;&#x6D41;&#x4F1A;&#x7528;&#x58F0;&#x8C03;&#x3001;&#x91CD;&#x97F3;&#x4EE5;&#x53CA;&#x505C;&#x987F;&#x6765;&#x7A81;&#x51FA;&#x91CD;&#x70B9;&#xFF0C;&#x65B9;&#x4FBF;&#x7406;&#x89E3;&#x3002;</li>
<li>&#x8981;&#x5B9E;&#x73B0;&#x6B63;&#x786E;&#x7684;&#x610F;&#x7FA4;&#x505C;&#x987F;&#x548C;&#x91CD;&#x97F3;&#xFF0C;&#x8FD9; <strong>&#x8981;&#x6C42;&#x4F60;&#x5728;&#x51C6;&#x5907;&#x671F;&#x95F4;&#x8FC5;&#x901F;&#x7406;&#x89E3;&#x6574;&#x6BB5;&#x6587;&#x672C;&#x60F3;&#x8981;&#x8868;&#x8FBE;&#x7684;&#x610F;&#x601D;</strong> &#xFF0C;&#x5426;&#x5219;&#x4F60;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x505C;&#x987F;&#xFF0C;&#x53EA;&#x80FD;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#x8E66;&#x51FA;&#x6765;&#x3002;</li>
</ul>
<p>&#x5173;&#x4E8E;&#x610F;&#x7FA4;&#x53EF;&#x4EE5;&#x4E3E;&#x4E00;&#x4E2A;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5C31;&#x662F;&#x5E26; <code>and</code> &#x7684;&#x53E5;&#x5B50;&#x505C;&#x987F;&#x3002;&#x6BD4;&#x5982;&#x8FD9;&#x4E00;&#x53E5;&#xFF1A;<code>I have an apple and he has an orange.</code>&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x8BFB;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x5728; <code>and</code> &#x524D;&#x9762;&#x505C;&#x987F;&#x5206;&#x6210; <code>I have an apple</code> &#x548C; <code>he has an orange</code>&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x672C;&#x8EAB;&#x8868;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x662F;&#x6211;&#x62E5;&#x6709;&#x7684;&#x6C34;&#x679C;&#x548C;&#x4ED6;&#x62E5;&#x6709;&#x6C34;&#x679C;&#x7684;&#x5BF9;&#x6BD4;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E00;&#x53E5;&#xFF1A;<code>She is a beautiful and smart girl.</code> &#x5219;&#x5E94;&#x8BE5;&#x5728; <code>is</code> &#x90E8;&#x5206;&#x7A0D;&#x5FAE;&#x505C;&#x987F;&#xFF0C;&#x5E76;&#x5728;&#x540E;&#x9762;&#x52A0;&#x91CD; <code>a beautiful and smart girl</code> &#x56E0;&#x4E3A;&#x8FD9;&#x53E5;&#x8BDD;&#x8981;&#x5F3A;&#x8C03;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x5979;&#x662F;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5973;&#x5B69;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BFB;&#x6210;&#x4E86; <code>She is a beautiful</code> &#x548C; <code>and smart girl</code>&#xFF0C;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x4EBA;&#x5BF9;&#x4F60;&#x8BF4;&#xFF1A;<code>&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x7F8E;...&#x4E3D;&#x7684;&#x5973;&#x5B69;</code> &#x4E00;&#x6837;&#x602A;&#x5F02;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5728;&#x8003;&#x8BD5;&#x7684;&#x6750;&#x6599;&#x4E2D;&#xFF0C;&#x4E0D;&#x4F1A;&#x6709;&#x4E0A;&#x9762;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x7684;&#x53E5;&#x5B50;&#x3002;&#x6240;&#x4EE5;&#x8BAD;&#x7EC3; RA &#x5C31;&#x9700;&#x8981;&#xFF1A;</p>
<ul>
<li>&#x8865;&#x5145;&#x4F60;&#x7684;&#x8BED;&#x6599;&#x5E93;&#xFF0C;&#x5927;&#x91CF;&#x7EA0;&#x97F3;&#x8BAD;&#x7EC3;</li>
<li>&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;&#x548C;&#x5347;&#x964D;&#x8C03;&#x3001;&#x97F5;&#x5F8B;&#x3001;&#x610F;&#x7FA4;&#x5207;&#x5272;&#x8BAD;&#x7EC3;</li>
</ul>
<p>&#x7531;&#x4E8E;&#x5B83;&#x8FD8;&#x8003;&#x5BDF;&#x4E86;&#x4F60;&#x7684;&#x9605;&#x8BFB;&#x7406;&#x89E3;&#x80FD;&#x529B;&#xFF0C;&#x6240;&#x4EE5;<strong>&#x8FD9;&#x9053;&#x9898;&#x505A;&#x5BF9;&#x4E86;&#x4E0D;&#x4EC5;&#x4EC5;&#x7ED9; Speaking &#x52A0;&#x5206;&#xFF0C;&#x8FD8;&#x4F1A;&#x7ED9; Reading &#x52A0;&#x5206;&#x3002;</strong></p>
<h4 id="repeat-sentence"><a href="https://pearsonpte.com/the-test/format/english-speaking-writing/repeat-sentence/" target="_blank">Repeat sentence</a></h4>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x578B;&#x662F;&#x7ED9;&#x4F60;&#x64AD;&#x653E;&#x4E00;&#x6BB5; 3s - 9s &#x7684;&#x771F;&#x4EBA;&#x3001;&#x771F;&#x573A;&#x666F;&#x5F55;&#x5236;&#x7684;&#x53E5;&#x5B50;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x5370;&#x5EA6;&#x4EBA;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x6237;&#x5916;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x5927;&#x53EB;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x4F4E;&#x58F0;&#x7EC6;&#x8BED;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x7ACB;&#x523B;&#x8BA9;&#x4F60;&#x590D;&#x8FF0;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x3002; <strong>&#x8FD9;&#x4E2A;&#x9898;&#x578B;&#x6A21;&#x62DF;&#x65E5;&#x5E38;&#x5BF9;&#x8BDD;&#xFF0C;&#x68C0;&#x6D4B;&#x4F60;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x8FC5;&#x901F;&#x7406;&#x89E3;&#x5BF9;&#x65B9;&#x8BF4;&#x7684;&#x5185;&#x5BB9;&#x3002;</strong></p>
<p>&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x76F8;&#x5F53;&#x96BE;&#x4E86;&#x3002;&#x901A;&#x5E38; 4s &#x4EE5;&#x5185;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x4F60;&#x901A;&#x8FC7;&#x5927;&#x8111;&#x77AC;&#x95F4;&#x8BB0;&#x5FC6;&#x5C31;&#x53EF;&#x4EE5;&#x590D;&#x8FF0;&#x53D1;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x662F; <strong>&#x8D85;&#x8FC7; 4s &#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x7406;&#x89E3;&#x53BB;&#x8BB0;&#x5FC6;</strong> &#x3002;&#x8FD9;&#x9053;&#x9898;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x4E00;&#x4E2A;&#x4EBA;&#x771F;&#x5B9E;&#x529B;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x53E5;&#x8BDD;&#x6709;&#x4E00;&#x4E2A;&#x751F;&#x8BCD;&#x3001;&#x4E00;&#x4E2A;&#x7701;&#x7565;&#x53D1;&#x97F3;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x53E3;&#x97F3;&#x8BA9;&#x4F60;&#x65E0;&#x6CD5;&#x542C;&#x51FA;&#x6765;&#xFF0C;&#x4F60;&#x5C31;&#x5F88;&#x96BE;&#x5F88;&#x6D41;&#x7545;&#x7684;&#x590D;&#x8FF0;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#xFF0C;&#x56E0;&#x4E3A; <strong>&#x4F60;&#x9700;&#x8981;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x7684;&#x5185;&#x5BB9;&#x5E76;&#x8BB0;&#x4F4F;</strong> &#x3002;&#x5355;&#x7EAF;&#x8BB0;&#x4F4F;&#x8FD8;&#x4E0D;&#x884C;&#xFF0C;&#x8FD8;&#x8981;&#x8BF4;&#x51FA;&#x6765;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x7ECF;&#x5E38;&#x53D1;&#x73B0;&#x80FD;&#x542C;&#x61C2;&#x8BF4;&#x7684;&#x65F6;&#x5019;&#x8BF4;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x7740;&#x8BF4;&#x7740;&#x5FD8;&#x4E86;&#xFF0C;&#x8FD9;&#x90FD;&#x8BF4;&#x660E;&#x4F60;&#x8FD8;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#x6089;&#x8FD9;&#x79CD;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#x6216;&#x8005;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x5982;&#x679C;&#x662F;&#x4E2D;&#x6587;&#xFF0C;&#x518D;&#x957F;&#x7684;&#x53E5;&#x5B50;&#x4F60;&#x90FD;&#x80FD;&#x5F88;&#x8F7B;&#x677E;&#x7684;&#x590D;&#x8FF0;&#x51FA;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x975E;&#x5E38;&#x7406;&#x89E3;&#x5B83;&#x8BF4;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x54EA;&#x6015;&#x8BCD;&#x8BED;&#x6709;&#x6240;&#x66FF;&#x6362;&#x4E5F;&#x80FD;&#x91CD;&#x65B0;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x8FD9;&#x9898;&#x76EE;&#x8BAD;&#x7EC3;&#x4E86;&#x4F60;&#x7684; &#x542C;&#x529B;&#x8BC6;&#x522B;&#x5668;&#x3001;&#x7406;&#x89E3;&#x5668; &#x548C; &#x53E3;&#x8BED;&#x8868;&#x8FBE;&#x5668;&#xFF0C;&#x7B80;&#x5355;&#x53C8;&#x6709;&#x6548;&#x3002;&#x6240;&#x4EE5; <strong>&#x8FD9;&#x9053;&#x9898;&#x505A;&#x5BF9;&#x4E86;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x4F1A;&#x7ED9; Speaking &#x52A0;&#x5206;&#xFF0C;&#x8FD8;&#x4F1A;&#x7ED9; Listening &#x52A0;&#x5206;&#x3002;</strong></p>
<h4 id="re-tell-lecture"><a href="https://pearsonpte.com/the-test/format/english-speaking-writing/re-tell-lecture/" target="_blank">Re-tell lecture</a></h4>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x578B;&#x662F;&#x7ED9;&#x4F60;&#x64AD;&#x653E;&#x4E00;&#x6BB5; 90s &#x4EE5;&#x5185;&#x7684;&#x8BB2;&#x5EA7;&#x8BED;&#x97F3;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x7B14;&#x8BB0;&#xFF0C;&#x4E4B;&#x540E;&#x8BA9;&#x4F60;&#x5728; 40s &#x7684;&#x65F6;&#x95F4;&#x5185;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x8BED;&#x8A00;&#x53E3;&#x8FF0;&#x603B;&#x7ED3;&#x521A;&#x624D;&#x542C;&#x5230;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x7531;&#x4E8E; PTE &#x662F;&#x5B66;&#x672F;&#x8003;&#x8BD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x9898;&#x578B;&#x901A;&#x5E38;&#x662F;&#x91C7;&#x96C6;&#x8001;&#x5E08;&#x4E0A;&#x8BFE;&#x56F4;&#x7ED5;&#x67D0;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x7684;&#x4ECB;&#x7ECD;&#x8BED;&#x97F3;&#x6216;&#x8005;&#x662F;&#x79D1;&#x666E;&#x7C7B;&#x77E5;&#x8BC6;&#xFF0C;&#x6574;&#x4E2A;&#x5F55;&#x97F3;&#x53EF;&#x80FD;&#x4F1A;&#x505C;&#x987F;&#x3001;&#x7ED3;&#x5DF4;&#x6216;&#x8005;&#x6709;&#x5608;&#x6742;&#x7684;&#x80CC;&#x666F;&#x97F3;&#xFF0C;&#x5B8C;&#x5168;&#x50CF;&#x662F;&#x5728;&#x4E0A;&#x8BFE;&#x4E00;&#x6837;&#x3002;&#x4F60;&#x9700;&#x8981;&#x6293;&#x4F4F;&#x5173;&#x952E;&#x8BCD;&#x548C;&#x903B;&#x8F91;&#x5E76;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x8FB9;&#x542C;&#x8FB9;&#x8BB0;&#x7B14;&#x8BB0;&#x901A;&#x5E38;&#x4F1A;&#x5206;&#x5FC3;&#x9519;&#x5931;&#x4E00;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x3002;&#x8BED;&#x97F3;&#x64AD;&#x653E;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x7ED9;&#x4F60; 10s &#x65F6;&#x95F4;&#x51C6;&#x5907;&#xFF0C;&#x8BA9;&#x4F60;&#x53E3;&#x8FF0;&#x590D;&#x8FF0;&#x521A;&#x521A;&#x542C;&#x5230;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x6211;&#x8BA4;&#x4E3A;&#x662F;&#x6700;&#x96BE;&#x7684;&#x9898;&#x578B;&#x4E4B;&#x4E00;&#xFF0C; <strong>&#x9996;&#x5148;&#x4F60;&#x9700;&#x8981;&#x542C;&#x51FA;&#x8868;&#x8FBE;&#x7684;&#x5173;&#x952E;&#x610F;&#x601D;&#x548C;&#x903B;&#x8F91;&#xFF0C;&#x5E76;&#x4E14;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x4E4B;&#x540E;&#x8FD8;&#x8981;&#x81EA;&#x5DF1;&#x7EC4;&#x7EC7;&#x8BED;&#x53E5;&#x53E3;&#x8FF0;&#x51FA;&#x6765;&#x3002;</strong> PTE &#x4F1A;&#x901A;&#x8FC7;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x4F60;&#x53E3;&#x8FF0;&#x7684;&#x53E5;&#x5B50;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x8BCD;&#x548C;&#x903B;&#x8F91;&#x8BCD;&#xFF0C;&#x6765;&#x5224;&#x65AD;&#x4F60;&#x662F;&#x5426;&#x542C;&#x61C2;&#x4E86;&#x521A;&#x521A;&#x7684;&#x6587;&#x7AE0;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x82F1;&#x8BED;&#x5DEE;&#x7684;&#x4EBA;&#xFF0C;&#x590D;&#x8FF0;&#x51FA;&#x6765;&#x7684;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x4E00;&#x4E9B;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x8BCD;&#x8BED;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4E3E;&#x4F8B;&#x6216;&#x8005;&#x5957;&#x8BDD;&#x4E2D;&#x7684;&#xFF0C;&#x590D;&#x8FF0;&#x4E0D;&#x51FA;&#x5B9E;&#x9645;&#x5185;&#x5BB9;&#x3002;&#x7A0D;&#x5FAE;&#x597D;&#x4E00;&#x70B9;&#x7684;&#x53EF;&#x80FD;&#x6293;&#x4F4F;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x8BCD;&#x3001;&#x540D;&#x8BCD;&#xFF0C;&#x590D;&#x8FF0;&#x65F6;&#x590D;&#x8FF0;&#x51FA;&#x90E8;&#x5206;&#x5173;&#x952E;&#x8BCD;&#x3002;&#x82F1;&#x8BED;&#x597D;&#x7684;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x7B5B;&#x9664;&#x4E3E;&#x4F8B;&#x6216;&#x8005;&#x5957;&#x8BDD;&#xFF0C;&#x53EA;&#x6293;&#x4F4F;&#x5173;&#x952E;&#x7ED3;&#x8BBA;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x903B;&#x8F91;&#x5316;&#x3001;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x603B;&#x7ED3;&#x590D;&#x8FF0;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x9898;&#x578B;&#x8BAD;&#x7EC3;&#x4E86; &#x542C;&#x529B;&#x8BC6;&#x522B;&#x5668;&#x3001;&#x82F1;&#x8BED;&#x601D;&#x7EF4; &#x548C; &#x53E3;&#x8BED;&#x8868;&#x8FBE;&#x5668;&#xFF0C;&#x5BF9;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x3001;&#x8F6C;&#x8FF0;&#x80FD;&#x529B;&#x8981;&#x6C42;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x4E5F;&#x662F; <strong>&#x540C;&#x65F6;&#x7ED9; Speaking &#x548C; Listening &#x52A0;&#x5206;</strong> &#x3002;</p>
<h4 id="answer-short-question"><a href="https://pearsonpte.com/the-test/format/english-speaking-writing/answer-short-question/" target="_blank">Answer short question</a></h4>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x4F1A;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A; 3s - 9s &#x5F88;&#x7B80;&#x77ED;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x4F60;&#x5FEB;&#x901F;&#x56DE;&#x7B54;&#x3002;&#x6BD4;&#x5982;&#x95EE;&#x4F60;&#xFF1A;<code>&#x516D;&#x89D2;&#x5F62;&#x7684;&#x87BA;&#x4E1D;&#x9489;&#x6709;&#x51E0;&#x4E2A;&#x8FB9;&#xFF1F;&#x54EA;&#x4E2A;&#x5355;&#x8BCD;&#x66F4;&#x4E66;&#x9762;&#x4E00;&#x70B9;&#xFF0C;&#x662F; &#x611F;&#x8C22; &#x8FD8;&#x662F; &#x8C22;&#x5566;&#xFF1F;</code></p>
<p>&#x4E3B;&#x8981;&#x8003;&#x5BDF;&#x4F60;&#x7684;&#x8BCD;&#x6C47;&#x91CF;&#xFF0C;&#x5176;&#x6B21;&#x5C31;&#x662F;&#x903B;&#x8F91;&#x80FD;&#x529B;&#x548C;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x3002;</p>
<h3 id="writing">Writing</h3>
<h4 id="summarize-written-text"><a href="https://pearsonpte.com/the-test/format/english-speaking-writing/summarize-written-text/" target="_blank">Summarize written text</a></h4>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x4F1A;&#x7ED9;&#x4F60;&#x4E00;&#x6BB5;&#x4E0D;&#x8D85;&#x8FC7; 300 &#x8BCD;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x8981;&#x6C42;&#x4F60;&#x5728; 10mins &#x5185;&#x5C06;&#x5176; <strong>&#x6D53;&#x7F29;&#x5199;&#x4E00;&#x4E2A;&#x603B;&#x7ED3;&#xFF0C;&#x5FC5;&#x987B;&#x53EA;&#x80FD;&#x7528;&#x4E00;&#x53E5;&#x8BDD;&#x800C;&#x4E14;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7; 75 &#x4E2A;&#x8BCD;&#x3002;</strong></p>
<p><strong>&#x8003;&#x5BDF;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5148;&#x770B;&#x4F60;&#x5BF9;&#x6587;&#x7AE0;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5176;&#x6B21;&#x5C31;&#x662F;&#x8F6C;&#x8FF0;&#x3001;&#x603B;&#x7ED3;&#x7684;&#x601D;&#x7EF4;&#x80FD;&#x529B;&#xFF0C;&#x7136;&#x540E;&#x8FD8;&#x6709;&#x8BED;&#x6CD5;&#x3002;</strong> &#x5982;&#x679C;&#x4F60;&#x65E0;&#x6CD5;&#x770B;&#x61C2;&#x6587;&#x7AE0;&#x8868;&#x8FBE;&#x7684;&#x5927;&#x610F;&#xFF0C;&#x57FA;&#x672C;&#x6CA1;&#x6CD5;&#x8F6C;&#x8FF0;&#x603B;&#x7ED3;&#x3002;&#x5982;&#x679C;&#x5927;&#x4F53;&#x770B;&#x61C2;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x5199;&#x51FA;&#x6765;&#x7684;&#x4F1A;&#x6F0F;&#x6389;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x70B9;&#x3002;&#x5982;&#x679C;&#x975E;&#x5E38;&#x61C2;&#xFF0C;&#x53EF;&#x80FD;&#x5199;&#x51FA;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#x53C8;&#x51C6;&#x786E;&#x7684;&#x6982;&#x8FF0;&#x3002;</p>
<p>&#x8BAD;&#x7EC3;&#x65F6;&#xFF0C;&#x6709;&#x9053;&#x673A;&#x7ECF;&#x9898;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<p><img src="../assets/swt.jpg" alt=""></p>
<p>&#x5927;&#x610F;&#x5C31;&#x662F; IBM &#x5BF9;&#x672A;&#x6765;&#x7684;&#x4E00;&#x4E9B;&#x9884;&#x6D4B;&#x3001;&#x9884;&#x6D4B;&#x7684;&#x7ED3;&#x679C;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x5BF9;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x8FC7;&#x53BB;&#x627E;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#x7167;&#x642C;&#x8FC7;&#x6765;&#x4F46;&#x662F;&#x4E0D;&#x4E00;&#x5B9A;&#x5BF9;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x7ED9;&#x51FA;&#x7684;&#x7B54;&#x6848;&#xFF1A;</p>
<p><code>Although we can try to extrapolate from the experience of previous technologies, we all seem to be peculiarly inept at predicting the likely development of our technologies.</code></p>
<p>&#x4E4B;&#x540E;&#x7FFB;&#x770B;&#x8BA8;&#x8BBA;&#x533A;&#xFF0C;Writing 88 &#x5206;&#xFF08;&#x6EE1;&#x5206; 90&#xFF09;&#x5927;&#x795E;&#x7684;&#x7B54;&#x6848;&#x8BA9;&#x6211;&#x864E;&#x8EAF;&#x4E00;&#x9707;&#xFF1A;</p>
<p><code>The trend of technology is unpredictable.</code></p>
<p>&#x6574;&#x7BC7;&#x6587;&#x7AE0;&#x4E0D;&#x5C31;&#x662F;&#x8981;&#x8868;&#x8FBE;&#x8FD9;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x5173;&#x952E;&#x601D;&#x60F3;&#x4E48;&#xFF0C;&#x7B80;&#x5355;&#x660E;&#x4E86;&#x51C6;&#x786E;&#xFF0C;&#x6CA1;&#x5E9F;&#x8BDD;&#x3002;&#x3002;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x6C34;&#x5E73;&#x5DEE;&#x8DDD;&#x9AD8;&#x4E0B;&#x7ACB;&#x89C1;&#x3002;</p>
<h3 id="reading">Reading</h3>
<h4 id="re-order-paragraphs"><a href="https://pearsonpte.com/the-test/format/english-reading/re-order-paragraphs/" target="_blank">Re-order paragraphs</a></h4>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x4F1A;&#x7ED9;&#x4F60; 150 &#x4E2A;&#x8BCD;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x5C06;&#x5176;&#x53E5;&#x5B50;&#x6253;&#x4E71;&#x8BA9;&#x4F60;&#x91CD;&#x65B0;&#x6392;&#x5E8F;&#x6062;&#x590D;&#x539F;&#x6837;&#x3002;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x610F;&#x601D;&#x7684;&#x9898;&#x76EE;&#x3002;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x673A;&#x7ECF;&#x9898;&#xFF1A;</p>
<p><img src="../assets/ro.jpg" alt=""></p>
<p>&#x505A;&#x8FD9;&#x4E2A;&#x9898;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x96BE;&#x7684;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8BFB;&#x61C2;&#x6BCF;&#x53E5;&#x8BDD;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x518D;&#x601D;&#x8003;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x603B;&#x7ED3;&#x53E5;&#x8FD8;&#x662F;&#x6982;&#x89C8;&#x53E5;&#xFF0C;&#x7528;&#x4E8E;&#x5F15;&#x5BFC;&#x8FD8;&#x662F;&#x4E3E;&#x4F8B;&#x63CF;&#x8FF0;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x4EE3;&#x6307;&#x5173;&#x7CFB;&#x548C;&#x4F9D;&#x8D56;&#x3002;&#x975E;&#x5E38;&#x8003;&#x9A8C;&#x9605;&#x8BFB;&#x7406;&#x89E3;&#x548C;&#x82F1;&#x8BED;&#x601D;&#x7EF4;&#x3002;&#x6709;&#x79CD;&#x4FA6;&#x63A2;&#x7684;&#x611F;&#x89C9;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x6253;&#x5206;&#x662F;&#x6309;&#x7167;&#x4E0A;&#x4E0B;&#x8BED;&#x53E5;&#x914D;&#x5BF9;&#xFF0C;&#x6BD4;&#x5982;&#x6B63;&#x786E;&#x7B54;&#x6848;&#x662F; 53214 &#x5982;&#x679C;&#x4F60;&#x7684;&#x7B54;&#x6848;&#x662F; 21435 &#x90A3;&#x4E48;&#x5176;&#x4E2D; 214 &#x6709;&#x4E24;&#x4E2A;&#x914D;&#x5BF9;&#x5F97; 2 &#x4E24;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x5168;&#x5BF9;&#x5219;&#x662F; 4 + 1&#xFF08;&#x5168;&#x5BF9;&#x5206;&#xFF09;= 5 &#x5206;&#x3002;&#x8FD9;&#x4E2A;&#x9898;&#x76EE; <strong>&#x4E3B;&#x8981;&#x8BAD;&#x7EC3;&#x4F60;&#x7684;&#x9605;&#x8BFB;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x548C;&#x82F1;&#x6587;&#x601D;&#x7EF4;&#x903B;&#x8F91;&#x3002;</strong></p>
<h3 id="listening">Listening</h3>
<h4 id="summarize-spoken-text"><a href="https://pearsonpte.com/the-test/format/english-listening/summarize-spoken-text/" target="_blank">Summarize spoken text</a></h4>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x4F1A;&#x7ED9;&#x4F60;&#x64AD;&#x653E;&#x4E00;&#x6BB5; 60s - 90s &#x7684;&#x542C;&#x529B;&#xFF0C;&#x7ED9;&#x4F60; 10mins &#x65F6;&#x95F4;&#x8BA9;&#x4F60;&#x5199;&#x4E00;&#x6BB5; 50 - 70 &#x4E2A;&#x8BCD;&#x7684;&#x603B;&#x7ED3;&#x3002;</p>
<p>&#x4E5F;&#x662F;&#x6A21;&#x62DF;&#x65E5;&#x5E38;&#x4E0A;&#x8BFE;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E0A;&#x9762; Re-tell lecture &#x9898;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x8003;&#x5BDF;&#x70B9;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x540C;&#x6837;&#x662F;&#x8FB9;&#x542C;&#x8FB9;&#x8BB0;&#x7B14;&#x8BB0;&#xFF0C;&#x8FD9;&#x9053;&#x9898;&#x76EE;&#x8981;&#x6C42;&#x4E86;&#x4F60;&#x8981;&#x5199; 50 &#x8BCD;&#x4EE5;&#x4E0A;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8981;&#x6C42;&#x4F60;&#x8981;&#x8BB0;&#x5F55;&#x4E00;&#x5B9A;&#x91CF;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5426;&#x5219;&#x6839;&#x672C;&#x5199;&#x4E0D;&#x51FA;&#x8FD9;&#x4E48;&#x591A;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x8981;&#x6C42;&#x4F60;&#x6709;&#x4E00;&#x5B9A;&#x5355;&#x8BCD;&#x91CF;&#x3001;&#x8BED;&#x6CD5;&#x77E5;&#x8BC6;&#x3001;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x548C;&#x7B14;&#x8BB0;&#x80FD;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x89C9;&#x5F97;&#x4E5F;&#x662F;&#x6700;&#x96BE;&#x7684;&#x9898;&#x578B;&#x4E4B;&#x4E00;&#x3002;</p>
<p><strong>&#x8FD9;&#x9053;&#x9898;&#x4F1A;&#x540C;&#x65F6;&#x7ED9; Listening &#x548C; Writing &#x52A0;&#x5206;&#x3002;</strong></p>
<h4 id="highlight-incorrect-words"><a href="https://pearsonpte.com/the-test/format/english-listening/highlight-incorrect-words/" target="_blank">Highlight incorrect words</a></h4>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x7B97;&#x662F; PTE &#x6700;&#x8F7B;&#x677E;&#x7684;&#x9898;&#x76EE;&#xFF0C;&#x4F1A;&#x7ED9;&#x4F60;&#x4E00;&#x6BB5;&#x6587;&#x672C;&#x540C;&#x65F6;&#x64AD;&#x653E;&#x8BED;&#x97F3;&#xFF0C;&#x8BA9;&#x4F60;&#x8DDF;&#x7740;&#x8BED;&#x97F3;&#x770B;&#x6587;&#x672C;&#xFF0C;&#x53D1;&#x73B0;&#x8BED;&#x97F3;&#x8DDF;&#x6587;&#x672C;&#x5B9E;&#x9645;&#x5355;&#x8BCD;&#x4E0D;&#x5BF9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6807;&#x8BB0;&#x4E0B;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x8BFB;&#x9519;&#x4E86;&#x3002;</p>
<p><img src="../assets/hiw.jpg" alt=""></p>
<p>&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x633A;&#x8003;&#x9A8C;&#x5BF9;&#x5355;&#x8BCD;&#x672C;&#x8EAB;&#x7684;&#x638C;&#x63E1;&#xFF0C;&#x9996;&#x5148;&#x8BED;&#x97F3;&#x662F;&#x65E5;&#x5E38;&#x8BED;&#x901F;&#xFF0C;&#x53EF;&#x80FD;&#x5FFD;&#x5FEB;&#x5FFD;&#x6162;&#x3001;&#x91CD;&#x590D;&#x505C;&#x987F;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x540C;&#x53E3;&#x97F3;&#x6216;&#x8005;&#x80CC;&#x666F;&#x6709;&#x566A;&#x97F3;&#x3002;&#x8FD9;&#x8981;&#x6C42;&#x4F60;&#x6CE8;&#x610F;&#x529B;&#x96C6;&#x4E2D;&#x8981;&#x8DDF;&#x4E0A;&#x8282;&#x594F;&#xFF0C;&#x5176;&#x6B21;&#x773C;&#x775B;&#x770B;&#x5355;&#x8BCD;&#x5C31;&#x8981;&#x9A6C;&#x4E0A;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x53D1;&#x97F3;&#x3002;&#x6BD4;&#x5982;&#x4E0A;&#x9762; <code>excessively</code> &#x548C; <code>exclusively</code> &#x5F62;&#x72B6;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8FD9;&#x4E24;&#x4E2A;&#x5355;&#x8BCD;&#x638C;&#x63E1;&#x4E0D;&#x597D;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x53EA;&#x770B;&#x5230;&#x4E86; <code>ex</code> &#x548C; <code>sively</code> &#x5E76;&#x542C;&#x5230;&#x7C7B;&#x4F3C;&#x53D1;&#x97F3;&#x5C31;&#x8BA4;&#x4E3A;&#x662F;&#x5BF9;&#x7684;&#x8DF3;&#x8FC7;&#x4E86;&#x3002;</p>
<p><strong>&#x8FD9;&#x4E2A;&#x953B;&#x70BC;&#x4F60;&#x7684; &#x89C6;&#x529B;&#x8BC6;&#x522B;&#x5668; &#x548C; &#x8BED;&#x6599;&#x5E93;&#x3002;</strong></p>
<h4 id="write-from-dictation"><a href="https://pearsonpte.com/the-test/format/english-listening/write-from-dictation/" target="_blank">Write from dictation</a></h4>
<p>&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x7C7B;&#x4F3C; Repeat Sentence &#x4F1A;&#x64AD;&#x653E;&#x4E00;&#x6BB5; 3s - 5s &#x7684;&#x97F3;&#x9891;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x4F60;&#x5199;&#x4E0B;&#x6765;&#x3002;&#x5199;&#x5BF9;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#xFF08;&#x54EA;&#x6015;&#x662F; a&#x3001;the&#xFF09;&#x90FD;&#x4F1A;&#x5F97;&#x4E00;&#x5206;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x5C31;&#x662F; <strong>&#x7C7B;&#x4F3C;&#x7CBE;&#x542C;&#xFF0C;&#x8003;&#x9A8C;&#x4F60;&#x7684;&#x542C;&#x529B;&#x8BC6;&#x522B;&#x548C;&#x8BED;&#x6599;&#x5E93;&#x5BB9;&#x91CF;&#x3002;</strong></p>
<h2 id="&#x6253;&#x5206;&#x89C4;&#x5219;">&#x6253;&#x5206;&#x89C4;&#x5219;</h2>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4E0D;&#x540C;&#x4E8E;&#x96C5;&#x601D;&#x4E2D;&#x542C;&#x529B;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x542C;&#x529B;&#x5206;&#x6570;&#x3001;&#x5199;&#x4F5C;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x5199;&#x4F5C;&#x5206;&#x6570;&#xFF0C;PTE &#x662F;&#x8DE8;&#x9898;&#x578B;&#x52A0;&#x5206;&#x3002;&#x6BD4;&#x5982; Read aloud &#x9898;&#x76EE;&#xFF0C;&#x60F3;&#x8981;&#x8BFB;&#x7684;&#x597D;&#xFF0C;&#x7684;&#x786E;&#x5148;&#x8981;&#x770B;&#x61C2;&#x6587;&#x7AE0;&#xFF0C;&#x770B;&#x61C2;&#x6587;&#x7AE0;&#x4EE3;&#x8868;&#x4F60;&#x7684; Reading &#x80FD;&#x529B;&#x4E5F;&#x5F88;&#x9AD8;&#xFF0C;&#x6240;&#x4EE5;&#x4F1A;&#x540C;&#x65F6;&#x7ED9; Speaking &#x548C; Reading &#x52A0;&#x5206;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x548C;&#x9898;&#x76EE;&#x8BBE;&#x8BA1;&#x663E;&#x7136;&#x662F;&#x66F4;&#x52A0;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<h2 id="&#x5907;&#x8003;&#x4F18;&#x52BF;">&#x5907;&#x8003;&#x4F18;&#x52BF;</h2>
<p>&#x770B;&#x5B8C;&#x662F;&#x4E0D;&#x662F;&#x4F1A;&#x89C9;&#x5F97; PTE &#x8003;&#x8BD5;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x96BE;&#x4E86;&#xFF1F;&#x4F46;&#x662F;&#x4ECE;&#x5907;&#x8003;&#x800C;&#x8A00;&#xFF0C;PTE &#x76EE;&#x524D;&#x6709;&#x5F88;&#x591A;&#x5907;&#x8003;&#x6280;&#x5DE7;&#xFF1A;</p>
<ol>
<li>&#x9996;&#x5148;&#x5B83;&#x662F;&#x673A;&#x8003;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x7684;&#x80CC;&#x540E;&#x662F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x3001;&#x662F;&#x7A0B;&#x5E8F;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x6A21;&#x7248;&#x6765;&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x7B54;&#x66F4;&#x987A;&#x7545;&#x3002;&#x800C;&#x96C5;&#x601D;&#x5982;&#x679C;&#x662F;&#x8003;&#x5B98;&#x9605;&#x5377;&#xFF0C;&#x4F1A;&#x5F88;&#x5BB9;&#x6613;&#x53D1;&#x73B0;&#x4F60;&#x5957;&#x7528;&#x4E86;&#x6A21;&#x7248;&#x3002;</li>
<li>&#x5176;&#x6B21;&#x6BCF;&#x4E2A;&#x8003;&#x751F;&#x6BCF;&#x6B21;&#x8003;&#x8BD5;&#x8BD5;&#x9898;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x90FD;&#x662F;&#x4ECE;&#x9898;&#x5E93;&#x4E2D;&#x62BD;&#x53D6;&#x7EC4;&#x5408;&#x800C;&#x6210;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x673A;&#x7ECF;&#x5E93;&#x3002;&#x8003;&#x751F;&#x53EF;&#x4EE5;&#x5728;&#x8003;&#x8FC7;&#x4E4B;&#x540E;&#x56DE;&#x5FC6;&#x8003;&#x9898;&#x65B9;&#x4FBF;&#x5176;&#x4ED6;&#x540C;&#x5B66;&#x5907;&#x8003;&#x3002;&#x4E0D;&#x540C;&#x4E8E;&#x96C5;&#x601D;&#x6BCF;&#x6B21;&#x7EDF;&#x4E00;&#x51FA;&#x65B0;&#x9898;&#xFF0C;PTE &#x7684;&#x673A;&#x7ECF;&#x547D;&#x4E2D;&#x7387;&#x4F1A;&#x7A0D;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x6269;&#x5145;&#x3001;&#x66F4;&#x65B0;&#x4F7F;&#x5176;&#x51E0;&#x7387;&#x964D;&#x4F4E;&#x3002;<strong>&#x5F53;&#x7136;&#x5907;&#x8003;&#x7B56;&#x7565;&#x4E0D;&#x80FD;&#x662F;&#x80CC;&#x673A;&#x7ECF;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x662F;&#x7528;&#x673A;&#x7ECF;&#x6765;&#x5F53;&#x4F5C;&#x771F;&#x9898;&#x8BAD;&#x7EC3;</strong>&#xFF0C;&#x8FD9;&#x6837;&#x66F4;&#x63A5;&#x8FD1;&#x771F;&#x5B9E;&#x8003;&#x8BD5;&#x4E00;&#x4E9B;&#x3002;</li>
<li>&#x7EA6;&#x8003;&#x7B80;&#x5355;&#xFF0C;&#x51FA;&#x5206;&#x901F;&#x5EA6;&#x5FEB;&#x3002;&#x5728;&#x56FD;&#x5185;&#x57FA;&#x672C;&#x968F;&#x65F6;&#x53EF;&#x4EE5;&#x9884;&#x5B9A;&#x8003;&#x8BD5;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x673A;&#x5668;&#x9605;&#x5377;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x65E9;&#x4E0A;&#x5C31;&#x51FA;&#x6210;&#x7EE9;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x884C;&#x53EF;&#x4EE5;&#x9A6C;&#x4E0A;&#x7EA6;&#x4E0B;&#x4E00;&#x6B21;&#x8003;&#x8BD5;&#x3002;&#x76F8;&#x6BD4;&#x96C5;&#x601D;&#xFF0C;&#x9700;&#x8981;&#x7B49;&#x5341;&#x5929;&#x4EE5;&#x4E0A;&#x624D;&#x53EF;&#x4EE5;&#x67E5;&#x8BE2;&#x6210;&#x7EE9;&#x3002;&#x8FD9;&#x5341;&#x5929;&#x4F1A;&#x7B49;&#x7684;&#x975E;&#x5E38;&#x7126;&#x8651;&#x3002;</li>
</ol>
<p>&#x6240;&#x4EE5;&#x6211;&#x6700;&#x7EC8;&#x51B3;&#x5B9A;&#x4ECE;&#x5907;&#x8003;&#x96C5;&#x601D;&#x6362;&#x6210;&#x4E86; PTE&#x3002;&#x4E0D;&#x8FC7;&#x8FD8;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x7559;&#x5B66;&#x7684;&#x5B66;&#x6821;&#x548C;&#x56FD;&#x5BB6;&#x5BF9;&#x82F1;&#x8BED;&#x6210;&#x7EE9;&#x7684;&#x8BA4;&#x5B9A;&#x6709;&#x8981;&#x6C42;&#xFF0C;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x5B66;&#x6821;&#x90FD;&#x8BA4;&#x53EF; PTE &#x6210;&#x7EE9;&#x4F5C;&#x4E3A;&#x4F60;&#x7684;&#x82F1;&#x8BED;&#x6C34;&#x5E73;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x8981;&#x63D0;&#x524D;&#x67E5;&#x597D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 常见问题 QA">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../resources/" class="navigation navigation-next " aria-label="Next page: 资料、工具推荐和扩展阅读">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"为什么我选择 PTE 考试","level":"1.5.1","depth":2,"next":{"title":"资料、工具推荐和扩展阅读","level":"1.6","depth":1,"path":"resources/README.md","ref":"./resources/README.md","articles":[]},"previous":{"title":"常见问题 QA","level":"1.5","depth":1,"path":"qa/README.md","ref":"./qa/README.md","articles":[{"title":"为什么我选择 PTE 考试","level":"1.5.1","depth":2,"path":"qa/WhyPTE.md","ref":"./qa/WhyPTE.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["editlink","ga","book-summary-scroll-position-saver","disqus","github","splitter"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"a-programmers-guide-to-english"},"github":{"url":"https://github.com/yujiangshui/A-Programmers-Guide-to-English"},"editlink":{"label":"Edit This Page","multilingual":false,"base":"https://github.com/yujiangshui/A-Programmers-Guide-to-English/edit/master"},"book-summary-scroll-position-saver":{},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"ga":{"configuration":"auto","token":"UA-57557739-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"A Programmer's Guide to English","gitbook":"*"},"file":{"path":"qa/WhyPTE.md","mtime":"2019-03-26T14:02:11.579Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-02-21T22:23:09.858Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-book-summary-scroll-position-saver/book-summary-scroll-position-saver.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

