
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>扩充语料库的训练方法 · A Programmer's Guide to English</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ListeningandSpeaking.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    关于本指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../essence/">
            
                <a href="../essence/">
            
                    
                    语言学习的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../make-a-program/">
            
                <a href="../make-a-program/">
            
                    
                    如何构建一个识别英语的程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="./">
            
                <a href="./">
            
                    
                    我的训练方法
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="KnowledgeBase.html">
            
                <a href="KnowledgeBase.html">
            
                    
                    扩充语料库的训练方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ListeningandSpeaking.html">
            
                <a href="ListeningandSpeaking.html">
            
                    
                    发音和听力训练方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="Thinking.html">
            
                <a href="Thinking.html">
            
                    
                    英语思维训练
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../qa/">
            
                <a href="../qa/">
            
                    
                    常见问题 QA
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../qa/WhyPTE.html">
            
                <a href="../qa/WhyPTE.html">
            
                    
                    为什么我选择 PTE 考试
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../resources/">
            
                <a href="../resources/">
            
                    
                    资料、工具推荐和扩展阅读
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >扩充语料库的训练方法</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6269;&#x5145;&#x8BED;&#x6599;&#x5E93;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;">&#x6269;&#x5145;&#x8BED;&#x6599;&#x5E93;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;</h1>
<p>&#x7ECF;&#x8FC7;&#x4E0A;&#x9762;&#x5206;&#x6790;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x82F1;&#x8BED;&#x5B66;&#x4E60;&#x6700;&#x5173;&#x952E;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x662F;<strong>&#x8BED;&#x6599;&#x5E93;</strong>&#xFF0C;&#x5176;&#x6B21;&#x5C31;&#x662F;&#x8BED;&#x6CD5;&#xFF08;&#x8BC6;&#x522B;&#x5F15;&#x64CE;&#xFF09;&#x3002;</p>
<p><strong>&#x8BED;&#x6599;&#x5E93;&#x5E76;&#x4E0D;&#x53EA;&#x662F;&#x8BCD;&#x6C47;&#xFF0C;&#x8BAD;&#x7EC3;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x4E5F;&#x5E76;&#x975E;&#x7B80;&#x5355;&#x7684;&#x80CC;&#x5355;&#x8BCD;&#x3002;</strong></p>
<p>&#x5982;&#x679C;&#x901A;&#x8FC7;&#x542C;&#x529B;&#x8BC6;&#x522B;&#x5668;&#x8F93;&#x5165;&#x8BED;&#x6599;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x80FD;<strong>&#x533A;&#x5206;&#x53E3;&#x97F3;</strong>&#xFF0C;&#x6BD4;&#x5982;&#x5F53;&#x524D;&#x8BED;&#x6599;&#x7684;&#x82F1;&#x5F0F;&#x53D1;&#x97F3;&#x3001;&#x7F8E;&#x5F0F;&#x53D1;&#x97F3;&#x3001;&#x6FB3;&#x6D32;&#x53D1;&#x97F3;&#x3001;&#x5370;&#x5EA6;&#x53D1;&#x97F3;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x3002;&#x4E4B;&#x540E;&#x5C31;&#x662F;&#x4E00;&#x4E9B;<strong>&#x8FDE;&#x8BFB;&#x3001;&#x5F31;&#x8BFB;&#x548C;&#x91CD;&#x97F3;&#x53D8;&#x5316;&#x89C4;&#x5219;</strong>&#x3002;&#x901A;&#x8FC7;&#x53E3;&#x97F3;&#x3001;&#x8FDE;&#x8BFB;&#x548C;&#x91CD;&#x97F3;&#x7B49;&#x89C4;&#x5219;&#x6B63;&#x786E;&#x89E3;&#x6790;&#x5F97;&#x5230;&#x8BCD;&#x53E5;&#x77ED;&#x8BED;&#x4E4B;&#x540E;&#xFF0C;&#x5F00;&#x59CB;<strong>&#x8FDB;&#x5165;&#x89E3;&#x6790;&#x5668;&#x6D41;&#x7A0B;</strong>&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5176;&#x4E2D;<strong>&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x591A;&#x91CD;&#x542B;&#x4E49;</strong>&#xFF0C;&#x5C06;&#x5176;&#x542B;&#x4E49;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x5339;&#x914D;&#x653E;&#x5165;&#x4E0A;&#x4E0B;&#x6587;&#x8BED;&#x5883;&#x7ED3;&#x5408;&#x91CD;&#x97F3;&#x7B49;&#x5F97;&#x5230;&#x6700;&#x51C6;&#x786E;&#x7684;&#x542B;&#x4E49;&#x3002;&#x8FD9;&#x65F6;&#x8FD8;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x8BCD;&#x5178;&#x91CC;&#x6CA1;&#x6709;&#x7684;<strong>&#x65B0;&#x8BCD;&#x6216;&#x8005;&#x8001;&#x8BCD;&#x65B0;&#x610F;</strong>&#xFF0C;&#x6BD4;&#x5982; &#x201C;&#x7ED9;&#x529B;&#x201D;&#x3001;&#x201C;&#x5475;&#x5475;&#x201D; &#x6216;&#x8005;&#x5404;&#x79CD;&#x6B6A;&#x66F2;&#x89E3;&#x91CA;&#x7684; &#x201C;&#x4E0D;&#x53EF;&#x63CF;&#x8FF0;&#x201D; &#x7684;&#x6210;&#x8BED;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4EBA;&#x4EEC;&#x65B0;&#x9020;&#x6216;&#x8005;&#x8D4B;&#x4E88;&#x4E86;&#x65B0;&#x610F;&#x601D;&#x7684;&#x8BCD;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BCD;&#x610F;&#x8BCD;&#x5178;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x4F1A;&#x6536;&#x5F55;&#x4F46;&#x5E7F;&#x6CDB;&#x5728;&#x4E00;&#x4E2A;&#x5708;&#x5B50;&#x91CC;&#x4F7F;&#x7528;&#x548C;&#x4EA4;&#x6D41;&#xFF0C;&#x8FD9;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x6587;&#x5316;&#x3001;&#x4FDA;&#x8BED;&#x3001;&#x6D41;&#x884C;&#x8BED;&#x7B49;&#x3002;&#x6B64;&#x5916;<strong>&#x8FD8;&#x9700;&#x8981;&#x7528;&#x8BED;&#x6CD5;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x6B65;&#x89E3;&#x6790;</strong>&#xFF0C;&#x6BD4;&#x5982;&#x65F6;&#x6001;&#x3001;&#x6807;&#x70B9;&#x3001;&#x8BED;&#x6C14;&#x3001;&#x53E5;&#x578B;&#x53E5;&#x5F0F;&#x7B49;&#x3002;</p>
<p>&#x7ECF;&#x8FC7;&#x4E0A;&#x9762;&#x6D41;&#x7A0B;&#x624D;&#x53EF;&#x4EE5;&#x89E3;&#x6790;&#x51FA;&#x6BD4;&#x8F83;&#x51C6;&#x786E;&#x7684;&#x610F;&#x601D;&#xFF0C;<strong>&#x505A;&#x51FA;&#x56DE;&#x5E94;&#x8FD8;&#x8981;&#x9006;&#x5411;&#x518D;&#x6765;&#x4E00;&#x904D;</strong>&#x3002;</p>
<p>&#x9996;&#x5148;&#x4F60;&#x8981;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x903B;&#x8F91;&#x548C;&#x7ED3;&#x6784;<strong>&#x68B3;&#x7406;&#x597D;&#x4F60;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x610F;&#x56FE;</strong>&#x3002;&#x8FD9;&#x4E00;&#x6B65;&#x5176;&#x5B9E;&#x8DDF;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#xFF0C;&#x4E2D;&#x6587;&#x9605;&#x8BFB;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x597D;&#x7684;&#x4EBA;&#xFF0C;&#x82F1;&#x6587;&#x53EA;&#x8981;&#x770B;&#x61C2;&#x4E86;&#x9605;&#x8BFB;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x4E5F;&#x4F1A;&#x5F88;&#x5F3A;&#xFF0C;&#x6709;&#x6761;&#x7406;&#x7684;&#x4EBA;&#x4E0D;&#x53EA;&#x662F;&#x8BF4;&#x8BDD;&#x6709;&#x6761;&#x7406;&#xFF0C;&#x505A;&#x4E8B;&#x60C5;&#x4E5F;&#x4F1A;&#x5F88;&#x6709;&#x6761;&#x7406;&#x548C;&#x903B;&#x8F91;&#x6027;&#x3002;&#x60F3;&#x597D;&#x8868;&#x8FBE;&#x4E4B;&#x540E;&#x4F60;&#x5C31;&#x8981;&#x5F00;&#x59CB;<strong>&#x4ECE;&#x8BED;&#x6599;&#x5E93;&#x62BD;&#x53D6;&#x6700;&#x7B26;&#x5408;&#x4F60;&#x610F;&#x56FE;&#x7684;&#x8BCD;&#x53E5;&#xFF0C;&#x5E76;&#x6309;&#x7167;&#x5408;&#x9002;&#x7684;&#x8BED;&#x6CD5;&#x8FDB;&#x884C;&#x7EC4;&#x88C5;</strong>&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x4E00;&#x4E2A;&#x4EBA;&#x8BED;&#x6599;&#x5E93;&#x5927;&#x5C0F;&#x548C;&#x6C34;&#x5E73;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x8868;&#x8FBE;&#x6211;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x68B3;&#x5986;&#x53F0;&#xFF0C;&#x53EA;&#x6709;&#x6700;&#x57FA;&#x7840;&#x8BED;&#x6599;&#x5E93;&#x7684;&#x6211;&#x53EA;&#x80FD;&#x8BF4;&#x51FA;&#xFF1A;&#x6211;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x684C;&#x5B50;&#x4E0A;&#x6709;&#x955C;&#x5B50;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x53E5;&#x8BDD;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x4F60;&#x60F3;&#x8868;&#x8FBE;&#x559C;&#x7231;&#x4E00;&#x5F20;&#x684C;&#x5B50;&#x548C;&#x955C;&#x5B50;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x4E0D;&#x77E5;&#x9053;&#x5177;&#x4F53;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x5982;&#x679C;&#x8BED;&#x6599;&#x5E93;&#x91CC;&#x6709;&#x66F4;&#x5E9E;&#x5927;&#x7684;&#x540D;&#x8BCD;&#x5E93;&#x548C;&#x7A0B;&#x5EA6;&#x5F62;&#x5BB9;&#x8BCD;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BF4;&#x51FA;&#xFF1A;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x68A6;&#x5BD0;&#x4EE5;&#x6C42;&#x7684;&#x5E26;&#x6709;&#x5730;&#x4E2D;&#x6D77;&#x98CE;&#x683C;&#x96D5;&#x523B;&#x3001;&#x692D;&#x5706;&#x68B3;&#x5986;&#x955C;&#x7684;&#x68B3;&#x5986;&#x53F0;&#x3002;&#x770B;&#x5230;&#x8FD9;&#x53E5;&#x8BDD;&#x4F60;&#x8111;&#x5B50;&#x91CC;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x8FD9;&#x4E2A;&#x68B3;&#x5986;&#x53F0;&#x5927;&#x4F53;&#x7684;&#x6837;&#x5B50;&#x5427;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;<strong>&#x8FD8;&#x9700;&#x8981;&#x53D1;&#x97F3;&#x8BF4;&#x51FA;&#x6765;</strong>&#xFF0C;&#x5148;&#x4ECE;&#x8BED;&#x6599;&#x5E93;&#x91CC;&#x62BD;&#x53D6;&#x5BF9;&#x5E94;&#x7684;&#x8BCD;&#x53E5;&#x58F0;&#x97F3;&#xFF0C;&#x518D;&#x7ED3;&#x5408;&#x7565;&#x8BFB;&#x3001;&#x5F31;&#x8BFB;&#x3001;&#x91CD;&#x8BFB;&#x7B49;&#x89C4;&#x5219;&#x63A7;&#x5236;&#x820C;&#x5934;&#x3001;&#x5589;&#x5499;&#x808C;&#x8089;&#x53D1;&#x51FA;&#x6765;&#x5BF9;&#x5E94;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x81F3;&#x6B64;&#x7B97;&#x662F;&#x5B8C;&#x6210;&#x4E00;&#x6B21;&#x5BF9;&#x8BDD;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x53EA;&#x662F;&#x542C;&#x529B;&#x8BC6;&#x522B;&#x5668;&#xFF0C;&#x89C6;&#x529B;&#x8BC6;&#x522B;&#x5668;&#x5927;&#x540C;&#x5C0F;&#x5F02;&#xFF0C;&#x65E0;&#x975E;&#x662F;&#x8BC6;&#x522B;&#x5404;&#x79CD;&#x5B57;&#x4F53;&#x3001;&#x5927;&#x5C0F;&#x5199;&#x3001;&#x6807;&#x70B9;&#x7B26;&#x53F7;&#x7B49;&#xFF0C;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;</p>
<hr>
<p><strong>&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x5206;&#x6790;&#x53EF;&#x4EE5;&#x5F97;&#x77E5;&#xFF0C;&#x8BED;&#x6599;&#x5E93;&#x91CC;&#x7684;&#x6BCF;&#x4E2A;&#x8BED;&#x6599;&#x901A;&#x5E38;&#x9700;&#x8981;&#x4EE5;&#x4E0B;&#x4FE1;&#x606F;&#xFF1A;</strong></p>
<ul>
<li><strong>&#x591A;&#x79CD;&#x53E3;&#x97F3;&#x7684;&#x58F0;&#x97F3;</strong>&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x82F1;&#x7F8E;&#x6FB3;&#x5370;&#x7B49;&#x3002;</li>
<li><strong>&#x4E0D;&#x540C;&#x8BCD;&#x6027;&#x548C;&#x65F6;&#x6001;&#x4E0B;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x53D1;&#x97F3;&#x548C;&#x91CD;&#x97F3;&#x4F4D;&#x7F6E;&#x53D8;&#x5316;</strong>&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;<code>resume</code> &#x5728;&#x540D;&#x8BCD;&#x4E0B;&#x8868;&#x7B80;&#x5386;&#xFF0C;&#x53D1;&#x97F3; <a href="https://dictionary.cambridge.org/media/english/us_pron/e/eus/eus73/eus73812.mp3" target="_blank">/&#x2C8;rez.&#x259;.me&#x26A;/</a>&#xFF0C;&#x800C;&#x52A8;&#x8BCD;&#x8868;&#x7EE7;&#x7EED;&#x4E4B;&#x524D;&#x6682;&#x505C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53D1;&#x97F3; <a href="https://dictionary.cambridge.org/media/english/us_pron/e/eus/eus73/eus73965.mp3" target="_blank">/r&#x26A;&#x2C8;zu&#x2D0;m/</a>&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53D1;&#x9519;&#x4E86;&#x58F0;&#x97F3;&#xFF0C;&#x5219;&#x4F1A;&#x5BFC;&#x81F4;&#x5BF9;&#x65B9;&#x89E3;&#x8BFB;&#x9519;&#x8BEF;&#x3002;</li>
<li><strong>&#x5355;&#x8BCD;&#x7684;&#x591A;&#x91CD;&#x542B;&#x4E49;</strong>&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;<code>current</code> &#x5E38;&#x89C1;&#x610F;&#x601D;&#x662F;&#x5F62;&#x5BB9;&#x8BCD;&#x5F53;&#x4E0B;&#x7684;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x8FD8;&#x6709;&#x540D;&#x8BCD;&#x7684; <code>&#x6C34;&#x6D41;&#x3001;&#x6F6E;&#x6D41;</code> &#x7B49;&#x610F;&#x601D;&#x3002;&#x66FE;&#x7ECF;&#x505A;&#x9605;&#x8BFB;&#x7406;&#x89E3;&#x770B;&#x5230;&#x5E26;&#x6709;&#x6C34;&#x6D41;&#x610F;&#x601D;&#x7684;&#x53E5;&#x5B50;&#x4E00;&#x8138;&#x61F5;&#x903C;&#xFF0C;&#x6CA1;&#x6CD5;&#x7528; <code>&#x5F53;&#x4E0B;</code> &#x7684;&#x610F;&#x601D;&#x6765;&#x89E3;&#x91CA;&#x548C;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x3002;&#x540C;&#x6837; <code>spring</code> &#x9664;&#x4E86; <code>&#x6625;&#x5929;</code> &#x8FD8;&#x6709; <code>&#x5F39;&#x529B;&#x3001;&#x6CC9;&#x6C34;</code> &#x7B49;&#x5B8C;&#x5168;&#x8054;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x610F;&#x601D;&#x3002;</li>
<li><strong>&#x540C;&#x4E49;&#x8BCD;&#x53CA;&#x5176;&#x5BF9;&#x6BD4;&#x3001;&#x53CD;&#x4E49;&#x8BCD;&#x7B49;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x56DE;&#x590D;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5426;&#x51B3;&#x6216;&#x8005;&#x52A0;&#x5F3A;&#x89C2;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BCD;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x66F4;&#x597D;&#x66F4;&#x7CBE;&#x51C6;&#x7684;&#x8868;&#x8FBE;&#x3002;&#x6BD4;&#x5982;&#xFF1A; <code>raise</code> &#x548C; <code>rise</code> &#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x4EC0;&#x4E48;&#x573A;&#x666F;&#x4E0B;&#x9002;&#x7528;&#xFF1F;&#x8FD8;&#x6709; <code>under</code>&#x3001;<code>beneath</code>&#x3001;<code>underneath</code> &#x548C; <code>below</code> &#x7B49;&#xFF0C;&#x8981;&#x600E;&#x4E48;&#x7528;&#x3002;</li>
<li><strong>&#x8BED;&#x6599;&#x76F8;&#x5173;&#x7684;&#x4FDA;&#x8BED;&#x3001;&#x6587;&#x5316;&#x3001;&#x884D;&#x751F;&#x8BCD;&#x7B49;</strong>&#x3002;&#x6BD4;&#x5982;&#xFF1A;<code>clump</code> &#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x672C;&#x610F;&#x662F;&#x8349;&#x4E1B;&#x4E4B;&#x7C7B;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x641C;&#x4E0B; Google &#x56FE;&#x7247;&#xFF0C;<a href="../assets/clumped.jpg" target="_blank">&#x5F62;&#x5BB9;&#x8BCD; clumped &#x8FD8;&#x7B97;&#x6B63;&#x5E38;</a>&#xFF0C;&#x4F46;&#x540D;&#x8BCD;&#x641C;&#x51FA;&#x6765;<a href="../assets/clump.jpg" target="_blank">&#x5B8C;&#x5168;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x79CD;&#x5947;&#x602A;&#x7684;&#x751F;&#x7269;</a>&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x6B63;&#x597D;&#x662F;&#x4E24;&#x4E2A;&#x70ED;&#x95E8;&#x7F8E;&#x56FD;&#x4EBA;&#x7269;&#x540D;&#x5B57;&#x5408;&#x8D77;&#x6765;&#x7684;&#x53D1;&#x97F3;&#xFF0C;&#x6240;&#x4EE5;&#x8001;&#x7F8E;&#x865A;&#x6784;&#x4E86;&#x4E00;&#x4E2A;&#x4EBA;&#x51FA;&#x6765;&#x8C03;&#x4F83;&#x3002;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x770B;&#x5230; twitter &#x4E0A;&#x6709;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x8981;&#x591A;&#x8003;&#x8651;&#x4E0B;&#x662F;&#x4E0D;&#x662F;&#x5728;&#x8C03;&#x4F83;&#x653F;&#x6CBB;&#x4EBA;&#x7269;&#x3002;</li>
<li><strong>&#x76F8;&#x5173;&#x7684;&#x5E38;&#x89C1;&#x56FA;&#x5B9A;&#x642D;&#x914D;&#x548C;&#x7528;&#x6CD5;</strong>&#x3002;&#x6BD4;&#x5982;&#xFF1A;<code>focus on</code> &#x548C; <code>pay attention to</code> &#x533A;&#x522B;&#x4EE5;&#x53CA;&#x4ECB;&#x8BCD;&#x7684;&#x4E0D;&#x540C;&#x3002;</li>
<li><strong>&#x540D;&#x8BCD;&#x7684;&#x5355;&#x590D;&#x6570;&#x5F62;&#x6001;&#x548C;&#x52A8;&#x8BCD;&#x7684;&#x5404;&#x79CD;&#x65F6;&#x6001;&#x53D8;&#x5F62;&#x53CA;&#x5176;&#x53D1;&#x97F3;&#x89C4;&#x5219;</strong>&#x3002;&#x6BD4;&#x5982;&#xFF1A;<code>hair</code> &#x5728;&#x4E0D;&#x540C;&#x8BCD;&#x6027;&#x4E0B;&#x65E2;&#x53EF;&#x6570;&#x53C8;&#x4E0D;&#x53EF;&#x6570;&#xFF0C;&#x53CD;&#x8FC7;&#x6765;&#x8BF4;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x5224;&#x65AD;&#x51FA;&#x6B64;&#x5904; <code>hair</code> &#x8981;&#x8868;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x3002;<code>s</code> &#x7ED3;&#x5C3E;&#x901A;&#x5E38;&#x6709; <code>z</code>&#x3001;<code>s</code> &#x548C; <code>&#x259;z</code> &#x4E09;&#x4E2A;&#x53D1;&#x97F3;&#xFF0C;<code>ed</code> &#x7ED3;&#x5C3E;&#x4E5F;&#x6709; <code>d</code>&#x3001;<code>t</code> &#x4EE5;&#x53CA; <code>id</code> &#x7B49;&#x60C5;&#x51B5;&#x3002;<code>read</code> &#x66F4;&#x5947;&#x8469;&#xFF0C;&#x8FC7;&#x53BB;&#x5F0F;&#x548C;&#x8FC7;&#x53BB;&#x5206;&#x8BCD;&#x90FD;&#x662F; <code>read</code>&#xFF0C;&#x4F46;&#x662F;&#x8FC7;&#x53BB;&#x5F0F;&#x53D1;&#x97F3;&#x53D8;&#x4E86;&#xFF0C;&#x8BFB;&#x4F5C; <code>/red/</code>&#xFF0C;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x53D1;&#x97F3;&#x6765;&#x8BC6;&#x522B;&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x662F;&#x8FC7;&#x53BB;&#x53D1;&#x751F;&#x7684;&#x8FD8;&#x662F;&#x73B0;&#x5728;&#x3002;</li>
</ul>
<hr>
<p>&#x9664;&#x4E86;&#x8BED;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x5C31;&#x9760;&#x5355;&#x70B9;&#x4E13;&#x9879;&#x7A81;&#x7834;&#xFF0C;&#x6BD4;&#x5982;&#x65F6;&#x6001;&#x79CD;&#x7C7B;&#x548C;&#x89C4;&#x5219;&#x3001;&#x8BCD;&#x6027;&#x548C;&#x53E5;&#x5B50;&#x7EC4;&#x6210;&#x7ED3;&#x6784;&#x4EE5;&#x53CA;&#x65F6;&#x95F4;&#x548C;&#x6570;&#x5B57;&#x7684;&#x7EC4;&#x5408;&#x89C4;&#x5219;&#x548C;&#x53D1;&#x97F3;&#x65B9;&#x6CD5;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;</p>
<h2 id="&#x6269;&#x5145;&#x8BED;&#x6599;&#x5E93;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#x5B9E;&#x6218;">&#x6269;&#x5145;&#x8BED;&#x6599;&#x5E93;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#x5B9E;&#x6218;</h2>
<p>&#x4F8B;&#x5982;&#x770B;&#x5230;&#x4E00;&#x4E2A; <code>clump</code> &#x5355;&#x8BCD;&#x60F3;&#x8981;&#x5B66;&#x4E60;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#xFF1A;</p>
<ol>
<li><strong>&#x7B2C;&#x4E00;&#x904D;&#x5F00;&#x59CB;&#x8BA4;&#x8BC6;&#x5355;&#x8BCD;&#xFF1A;</strong><ul>
<li>&#x901A;&#x8FC7; <a href="https://dictionary.cambridge.org/dictionary/english/clump" target="_blank">Cambridge Dictionary</a> &#x67E5;&#x8BE2;&#x5355;&#x8BCD;&#x610F;&#x601D;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x662F;&#x5426;&#x53EF;&#x6570;&#x3001;&#x5404;&#x79CD;<strong>&#x91CA;&#x4E49;&#x548C;&#x5BF9;&#x5E94;&#x7684;&#x4F8B;&#x53E5;</strong>&#x3001;&#x5173;&#x8054;&#x8BCD;&#x548C;&#x5BF9;&#x6BD4;&#x7B49;&#x7B49;&#x3002;<a href="https://www.merriam-webster.com/dictionary/clump" target="_blank">Merriam Webster</a> &#x662F;&#x7F8E;&#x5F0F;&#x5728;&#x7EBF;&#x5B57;&#x5178;&#xFF0C;&#x5982;&#x6709;&#x7CBE;&#x529B;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x77E5;&#x8BC6;&#x8865;&#x5145;&#xFF0C;&#x4F46;&#x662F;&#x4F8B;&#x53E5;&#x548C;&#x754C;&#x9762;&#x4E0D;&#x5982; Cambridge Dictionary &#x597D;&#x7528;&#x3002;</li>
<li>&#x67E5;&#x770B;&#x97F3;&#x6807;&#xFF0C;&#x5C1D;&#x8BD5;&#x53D1;&#x97F3;&#xFF08;&#x9700;&#x8981;&#x5148;&#x628A;&#x97F3;&#x6807;&#x7EC3;&#x719F;&#xFF0C;&#x53C2;&#x7167;&#x4E0B;&#x9762;&#x6559;&#x7A0B;&#xFF09;&#xFF0C;&#x6536;&#x542C;&#x8BCD;&#x5178;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;&#x82F1;&#x5F0F;&#x548C;&#x7F8E;&#x5F0F;&#x7684;&#x771F;&#x4EBA;&#x53D1;&#x97F3;&#xFF0C;&#x770B;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x53D1;&#x97F3;&#x662F;&#x5426;&#x51C6;&#x786E;&#xFF1F;&#x54EA;&#x91CC;&#x4E0D;&#x5BF9;&#xFF1F;&#x662F;&#x97F3;&#x6807;&#x8FD8;&#x662F;&#x91CD;&#x97F3;&#xFF1F;&#x7EC3;&#x5BF9;&#x4E3A;&#x6B62;&#x3002;</li>
<li>&#x6253;&#x5F00; <a href="https://forvo.com/word/clump/#en" target="_blank">Forvo</a> &#x6536;&#x542C;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x4E0D;&#x540C;&#x4EBA;&#x7684;&#x53D1;&#x97F3;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x8DDF;&#x8BFB;&#x4EE5;&#x4FBF;&#x5F55;&#x5165;&#x81EA;&#x5DF1;&#x7684;&#x97F3;&#x9891;&#x8BED;&#x6599;&#x5E93;&#x3002;<strong>&#x4E5F;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x4F7F;&#x7528; <a href="https://youglish.com/search/clump/us?" target="_blank">YouGlish</a></strong> &#xFF0C;&#x5B83;&#x4F1A;&#x641C;&#x7D22; Youtube &#x4E0A;&#x9762;&#x5305;&#x542B;&#x5F53;&#x524D;&#x5355;&#x8BCD;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x8FD9;&#x6837;&#x53D1;&#x97F3;&#x66F4;&#x8D34;&#x5408;&#x65E5;&#x5E38;&#x5BF9;&#x8BDD;&#x3002;</li>
<li>&#x6253;&#x5F00; <a href="https://translate.google.as/" target="_blank">Google Translate</a> &#x8BED;&#x97F3;&#x8F93;&#x5165;&#xFF0C;&#x5C3D;&#x91CF;&#x5E26;&#x4E0A;&#x8033;&#x673A;&#x6216;&#x8005;&#x7528;&#x8033;&#x9EA6;&#x5C1D;&#x8BD5;&#x53D1;&#x97F3;&#xFF0C;&#x67E5;&#x770B;&#x662F;&#x5426;&#x80FD;&#x7A33;&#x5B9A;&#x8BC6;&#x522B;&#x51FA;&#x5F53;&#x524D;&#x5355;&#x8BCD;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9; Google Translate &#x64AD;&#x653E;&#x6BCD;&#x8BED;&#x771F;&#x4EBA;&#x53D1;&#x97F3;&#x97F3;&#x9891;&#x67E5;&#x770B;&#x80FD;&#x5426;&#x8BC6;&#x522B;&#xFF0C;&#x5982;&#x679C;&#x6BCD;&#x8BED;&#x97F3;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#xFF0C;&#x8BF4;&#x660E; Google &#x8BC6;&#x522B;&#x5F15;&#x64CE;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x800C;&#x4F60;&#x7684;&#x53D1;&#x97F3;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x91CD;&#x590D;&#x4E0A;&#x9762;&#x6B65;&#x9AA4;&#x8C03;&#x6574;&#x53D1;&#x97F3;&#x5230;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x4E3A;&#x6B62;&#x3002;</li>
<li>&#x6253;&#x5F00; Google &#x641C;&#x7D22;&#xFF0C;<a href="../assets/clump-google.jpg" target="_blank">&#x8F93;&#x5165;&#x5F53;&#x524D;&#x5355;&#x8BCD; + vs &#x5373;&#x53EF;&#x770B;&#x5230;&#x8FD1;&#x4E49;&#x8BCD;&#x548C;&#x6613;&#x6DF7;&#x6DC6;&#x8BCD;&#x6C47;</a>&#xFF0C;&#x641C;&#x7D22;&#x67E5;&#x770B;&#x76F8;&#x5173;&#x5BF9;&#x6BD4;&#x3002;</li>
<li>&#x4E0D;&#x662F;&#x7279;&#x522B;&#x62BD;&#x8C61;&#x7684;&#x5355;&#x8BCD;&#xFF0C;&#x53EF;&#x4EE5;&#x6253;&#x5F00; Google &#x56FE;&#x7247;&#x641C;&#x7D22;&#x8FDB;&#x884C;&#x641C;&#x7D22;&#xFF0C;&#x901A;&#x8FC7;&#x56FE;&#x50CF;&#x52A0;&#x6DF1;&#x8BB0;&#x5FC6;&#x3002;&#x6211;&#x7528;&#x56FE;&#x7247;&#x641C;&#x7D22; <code>clump</code> &#x65F6;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x4E86;<a href="../assets/clump.jpg" target="_blank">&#x4E24;&#x4F4D;&#x5019;&#x9009;&#x4EBA;&#x7684;&#x5408;&#x4F53;</a>&#x7684;&#x610F;&#x601D;&#x3002;&#x518D;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;<code>bay</code> &#x548C; <code>gulf</code> &#x5728;&#x8BCD;&#x5178;&#x91CC;&#x90FD;&#x6709;&#x6D77;&#x6E7E;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x90A3;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5417;&#xFF1F;&#x7528; Google &#x56FE;&#x7247;&#x641C;&#x7D22;&#x4E00;&#x4E0B;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;<a href="../assets/gulf-bay.jpg" target="_blank"><code>gulf</code> &#x8981;&#x6BD4; <code>bay</code> &#x5927;&#x7684;&#x591A;</a>&#x3002;</li>
<li>&#x5C06;&#x5355;&#x8BCD;&#x4EE5;&#x53CA;&#x6709;&#x8DA3;&#x7684;&#x53D1;&#x73B0;&#x8BB0;&#x5F55;&#x5728; <a href="https://apps.ankiweb.net/" target="_blank">Anki</a> &#x91CC;&#x9762;&#xFF0C;<a href="../assets/add-to-anki.jpg" target="_blank">&#x53EA;&#x9700;&#x8981;&#x70B9;&#x51FB; Add &#x5E76;&#x6DFB;&#x52A0;&#x5355;&#x8BCD;&#x5373;&#x53EF;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x4E0B;&#x65B9;&#x591A;&#x52A0;&#x4E00;&#x4E9B;&#x6CE8;&#x91CA;</a>&#xFF0C;&#x53EF;&#x7E41;&#x53EF;&#x7B80;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x592A;&#x591A;&#x65F6;&#x95F4;&#x3002;&#x5C06;&#x5728;&#x540E;&#x9762;&#x7684; QA &#x90E8;&#x5206;&#x89E3;&#x91CA;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528; Anki&#x3002;</li>
</ul>
</li>
<li><strong>&#x7B2C;&#x4E8C;&#x904D;&#x5728; Anki &#x91CC;&#x9762;&#x590D;&#x4E60;&#xFF0C;&#x770B;&#x5230;&#x5355;&#x8BCD;&#x5C1D;&#x8BD5;&#x53D1;&#x97F3;&#x8BC6;&#x522B;&#xFF0C;&#x5C1D;&#x8BD5;&#x56DE;&#x5FC6;&#x76F8;&#x5173;&#x7684;&#x610F;&#x601D;&#x3001;&#x7528;&#x6CD5;&#x4EE5;&#x53CA;&#x56FE;&#x50CF;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x56DE;&#x5FC6;&#x3002;&#x5982;&#x679C;&#x611F;&#x89C9;&#x6CA1;&#x95EE;&#x9898;&#x90A3;&#x4E48;&#x5C31;&#x70B9;&#x51FB; Good &#x6216;&#x8005; Easy&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x9009;&#x62E9; Again &#x6216;&#x8005; Hard&#x3002;&#x5982;&#x679C;&#x638C;&#x63E1;&#x4E0D;&#x597D;&#xFF0C;&#x8BF7;&#x91CD;&#x590D;&#x7B2C;&#x4E00;&#x904D;&#x6B65;&#x9AA4;&#x52A0;&#x6DF1;&#x8BB0;&#x5FC6;&#x3002;</strong></li>
<li>&#x7B2C;&#x4E09;&#x904D;&#x91CD;&#x590D;&#x7B2C;&#x4E8C;&#x6B65;&#x3002;</li>
<li>&#x7B2C; N &#x904D;&#xFF0C;&#x5DF2;&#x7ECF;&#x57FA;&#x672C;&#x638C;&#x63E1;&#x3002;</li>
</ol>
<p>&#x6BCF;&#x9694;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5E94;&#x8BE5;&#x5BFC;&#x51FA;&#x4E00;&#x4EFD;&#x5355;&#x8BCD;&#x5217;&#x8868;&#xFF0C;&#x653E;&#x5728; <a href="http://www.danci88.com" target="_blank">Danci88</a> &#x4E0A;&#x9762;&#x8FDB;&#x884C;&#x542C;&#x5199;&#x3002;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x867D;&#x7136;&#x6BD4;&#x8F83;&#x7B80;&#x964B;&#xFF0C;&#x4F46;&#x662F;&#x975E;&#x5E38;&#x5B9E;&#x7528;&#x3002;&#x901A;&#x8FC7;&#x542C;&#x5199;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x5BF9;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x638C;&#x63E1;&#x7A0B;&#x5EA6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8111;&#x5B50;&#x77AC;&#x95F4;&#x51FA;&#x73B0;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x5219;&#x8868;&#x793A;&#x638C;&#x63E1;&#x4E86;&#x3002;</p>
<p><strong>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4E0A;&#x9762;&#x6B65;&#x9AA4;&#x662F;&#x76F8;&#x5BF9;&#x5B8C;&#x6574;&#x7684;&#x5B66;&#x4E60;&#x6B65;&#x9AA4;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x4E2D;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7C7B;&#x522B;&#x7684;&#x5355;&#x8BCD;&#x5E94;&#x8BE5;&#x53EF;&#x7E41;&#x53EF;&#x7B80;</strong>&#x3002;&#x6BD4;&#x5982;&#x6211;&#x5728; Anki &#x5EFA;&#x7ACB;&#x4E86; 7 &#x4E2A;&#x8BED;&#x6599;&#x5E93;&#xFF0C;&#x5206;&#x522B;&#x662F;&#xFF1A;</p>
<ul>
<li><strong>&#x53D1;&#x97F3;&#x9519;&#x9898;&#x672C;</strong>&#xFF1A;&#x7B2C;&#x4E00;&#x773C;&#x770B;&#x5230;&#x5355;&#x8BCD;&#x53D1;&#x51FA;&#x7684;&#x58F0;&#x97F3;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x6216;&#x8005;&#x4E0E;&#x5B9E;&#x9645;&#x53D1;&#x97F3;&#x4E0D;&#x7B26;&#x3002;<strong>&#x8FD9;&#x7C7B;&#x5355;&#x8BCD;&#x8981;&#x6CE8;&#x91CD;&#x97F3;&#x6807;&#x3001;&#x53D1;&#x97F3;&#x8BC6;&#x522B;&#x3001;&#x591A;&#x8BED;&#x97F3;&#x8FA8;&#x97F3;</strong>&#x7B49;&#xFF0C;&#x8981;&#x7528; Google &#x7FFB;&#x8BD1;&#x6765;&#x8BC6;&#x522B;&#x6D4B;&#x8BD5;&#x3002;</li>
<li><strong>&#x542C;&#x529B;&#x5355;&#x8BCD;&#x672C;</strong>&#xFF1A;&#x5728;&#x542C;&#x5199;&#x6216;&#x8005;&#x542C;&#x529B;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x542C;&#x51FA;&#x5E76;&#x5199;&#x51FA;&#x7684;&#x8BCD;&#x53E5;&#x3002;<strong>&#x8FD9;&#x7C7B;&#x5355;&#x8BCD;&#x8981;&#x6CE8;&#x91CD;&#x53D1;&#x97F3;&#x548C;&#x542C;&#x5199;&#x8BAD;&#x7EC3;&#x3002;</strong></li>
<li><strong>&#x5E38;&#x89C1;&#x540D;&#x8BCD;&#x672C;</strong>&#xFF1A;&#x4F8B;&#x5982;&#x56FD;&#x5BB6;&#x3001;&#x5730;&#x533A;&#x7B49;&#x3002;<strong>&#x8FD9;&#x7C7B;&#x5355;&#x8BCD;&#x53EA;&#x9700;&#x6CE8;&#x91CD;&#x53D1;&#x97F3;&#x548C;&#x542C;&#x529B;&#x8BC6;&#x522B;&#x5373;&#x53EF;</strong>&#xFF0C;&#x5E38;&#x89C1;&#x5355;&#x8BCD;&#x6CE8;&#x91CD;&#x62FC;&#x5199;&#x4EE5;&#x53CA;&#x4E86;&#x89E3;&#x76F8;&#x5173;&#x6587;&#x5316;&#x5386;&#x53F2;&#xFF0C;&#x4E0D;&#x5E38;&#x89C1;&#x751A;&#x81F3;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x5B66;&#x600E;&#x4E48;&#x62FC;&#x5199;&#xFF0C;&#x6BD5;&#x7ADF;&#x5199;&#x7684;&#x673A;&#x4F1A;&#x4E0D;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x641C;&#x5230;&#x3002;</li>
<li><strong>&#x62FC;&#x5199;&#x9519;&#x9898;&#x672C;</strong>&#xFF1A;&#x8FD9;&#x7C7B;&#x5355;&#x8BCD;&#x8BA4;&#x8BC6;&#x610F;&#x601D;&#x3001;&#x4F1A;&#x8BFB;&#xFF0C;&#x4F46;&#x662F;&#x62FC;&#x5199;&#x9519;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x5E38;&#x89C1;&#x7684;&#x5355;&#x8BCD;&#xFF0C;&#x90FD;&#x89C9;&#x5F97;&#x4E60;&#x4EE5;&#x4E3A;&#x5E38;&#xFF0C;&#x4F46;&#x771F;&#x6B63;&#x8BA9;&#x4F60;&#x62FC;&#x5199;&#x7684;&#x65F6;&#x5019;&#x5374;&#x62FF;&#x634F;&#x4E0D;&#x51C6;&#x3002;<strong>&#x8FD9;&#x7C7B;&#x5355;&#x8BCD;&#x5C31;&#x8981;&#x6CE8;&#x91CD;&#x62FC;&#x5199;&#x548C;&#x542C;&#x5199;</strong>&#xFF0C;&#x4EE5;&#x53CA;&#x591A;&#x5728;&#x952E;&#x76D8;&#x4E0A;&#x6572;&#x6253;&#x5EFA;&#x7ACB;&#x808C;&#x8089;&#x8BB0;&#x5FC6;&#x3002;</li>
<li><strong>&#x65B0;&#x5355;&#x8BCD;&#x672C;</strong>&#xFF1A;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x9047;&#x5230;&#x7684;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x65B0;&#x5355;&#x8BCD;&#xFF0C;&#x9700;&#x8981;&#x6309;&#x7167;&#x4E0A;&#x9762;&#x6D41;&#x7A0B;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x3002;&#x8FD9;&#x7C7B;&#x5355;&#x8BCD;&#x5C31;&#x662F;&#x91CD;&#x590D;&#x5237;&#x8BB0;&#x5FC6;&#x3002;</li>
<li><strong>&#x719F;&#x8BCD;&#x751F;&#x50FB;&#x610F;&#x601D;&#x5355;&#x8BCD;&#x672C;</strong>&#xFF1A;&#x8FD9;&#x4E2A;&#x4E3B;&#x8981;&#x8BB0;&#x5F55;&#x4E00;&#x4E9B;&#x5F88;&#x719F;&#x6089;&#x7684;&#x8BCD;&#x7684;&#x751F;&#x50FB;&#x610F;&#x601D;&#x3002;&#x6BD4;&#x5982; <code>champion</code> &#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x662F;&#x540D;&#x8BCD;&#x51A0;&#x519B;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x4E5F;&#x6709;&#x52A8;&#x8BCD;&#x634D;&#x536B;&#x7684;&#x751F;&#x50FB;&#x610F;&#x601D;&#x3002;</li>
<li><strong>&#x8FDE;&#x8BFB;&#x8BAD;&#x7EC3;&#x672C;</strong>&#xFF1A;&#x8FD9;&#x4E2A;&#x662F;&#x5728;&#x7EC3;&#x4E60;&#x53E3;&#x8BED;&#x9605;&#x8BFB;&#x6216;&#x8005;&#x590D;&#x8FF0;&#x53E5;&#x5B50;&#x65F6;&#xFF0C;&#x89C9;&#x5F97;&#x5F88;&#x7ED5;&#x53E3;&#x7684;&#x8BCD;&#x53E5;&#x3002;&#x6BD4;&#x5982; <code>the very idea of a police force was seen as foreign as that is</code> &#x8FD9;&#x53E5;&#x8BDD;&#x3002;<strong>&#x8FD9;&#x7C7B;&#x8BED;&#x6599;&#x8981;&#x6CE8;&#x91CD;&#x65AD;&#x53E5;&#x3001;&#x91CD;&#x8BFB;&#x3001;&#x58F0;&#x8C03;&#x53D8;&#x5316;&#x548C;&#x6C14;&#x606F;&#x63A7;&#x5236;&#xFF0C;&#x91CD;&#x590D;&#x8BFB;&#x5230;&#x6D41;&#x7545;&#x5373;&#x53EF;&#x3002;</strong></li>
</ul>
<p>&#x4E0A;&#x9762;&#x6B65;&#x9AA4;&#x597D;&#x50CF;&#x5F88;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x9700;&#x8981;&#x8BB0;&#x5FC6;&#x7684;&#x5185;&#x5BB9;&#x91CF;&#x597D;&#x5927;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x6280;&#x5DE7;&#x6765;&#x5FEB;&#x901F;&#x7A33;&#x5B9A;&#x7684;&#x8BB0;&#x5FC6;&#x5417;&#xFF1F;</p>
<h2 id="&#x8BB0;&#x5FC6;&#x5355;&#x8BCD;&#x3001;&#x8BED;&#x6599;&#x5E93;&#x552F;&#x4E00;&#x7684;&#x94F6;&#x5F39;&#xFF1A;&#x91CD;&#x590D;&#x8BAD;&#x7EC3;">&#x8BB0;&#x5FC6;&#x5355;&#x8BCD;&#x3001;&#x8BED;&#x6599;&#x5E93;&#x552F;&#x4E00;&#x7684;&#x94F6;&#x5F39;&#xFF1A;&#x91CD;&#x590D;&#x8BAD;&#x7EC3;</h2>
<p>&#x65F6;&#x95F4;&#x56DE;&#x5230;&#x521D;&#x4E2D;&#xFF0C;&#x6211;&#x82F1;&#x8BED;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#xFF0C;&#x8DEF;&#x4E0A;&#x9047;&#x5230;&#x540C;&#x884C;&#x82F1;&#x8BED;&#x8001;&#x5E08;&#x4FBF;&#x95EE;&#x9053;&#x5B66;&#x4E60;&#x82F1;&#x8BED;&#x6709;&#x4EC0;&#x4E48;&#x6280;&#x5DE7;&#x5417;&#xFF1F;&#x8001;&#x5E08;&#x5FAE;&#x7B11;&#x8BF4;&#xFF1A;<strong>Practice&#x3001;Practice and Practice</strong>&#xFF0C;&#x6211;&#x5374;&#x4E0D;&#x4EE5;&#x4E3A;&#x7136;&#xFF0C;&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x6211;&#x8D70;&#x8FC7;&#x7684;&#x6700;&#x5927;&#x7684;&#x5F2F;&#x8DEF;&#x3002;</p>
<p>&#x9AD8;&#x4E2D;&#x4E4B;&#x540E;&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x5347;&#x8BB0;&#x5FC6;&#x529B;&#xFF0C;&#x6211;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x5C1D;&#x8BD5;&#x548C;&#x8BAD;&#x7EC3;&#x3002;&#x6BD4;&#x5982;&#x4E03;&#x7530;&#x771F;&#x7684;&#x300A;&#x8D85;&#x53F3;&#x8111;&#x7167;&#x76F8;&#x8BB0;&#x5FC6;&#x6CD5;&#x300B;&#x4EE5;&#x53CA;&#x300A;&#x9B54;&#x672F;&#x8BB0;&#x5FC6;&#x300B;&#x7B49;&#xFF0C;&#x7ECF;&#x5E38;&#x5BF9;&#x7740;&#x66FC;&#x9640;&#x7F57;&#x56FE;&#x7247;&#x770B;&#x3001;&#x4E0A;&#x5B66;&#x653E;&#x5B66;&#x8DEF;&#x4E0A;&#x7728;&#x773C;&#x8BB0;&#x8F66;&#x724C;&#x3001;&#x77AC;&#x95F4;&#x8BB0;&#x4F4F;&#x4E00;&#x4E32;&#x624B;&#x673A;&#x53F7;&#x4EE5;&#x53CA;&#x6309;&#x7167;&#x300A;&#x9B54;&#x672F;&#x8BB0;&#x5FC6;&#x300B;&#x7684;&#x8054;&#x60F3;&#x6280;&#x5DE7;&#x8BB0;&#x5FC6;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x7EC3;&#x5230;&#x8FC7;&#x76EE;&#x4E0D;&#x5FD8;&#x3002;&#x770B;&#x8D77;&#x6765;&#x662F;&#x633A;&#x795E;&#x5947;&#x633A;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x300A;&#x9B54;&#x672F;&#x8BB0;&#x5FC6;&#x300B;&#x91CC;&#x9762;&#x7684;&#x201C;&#x8054;&#x60F3;&#x8BB0;&#x5FC6;&#x6CD5;&#x201D;&#x3001;&#x201C;&#x5B9A;&#x6869;&#x8BB0;&#x5FC6;&#x6CD5;&#x201D;&#x3001;&#x201C;&#x8BB0;&#x5FC6;&#x5BAB;&#x6BBF;&#x8BB0;&#x5FC6;&#x6CD5;&#x201D;&#x7B49;&#xFF0C;&#x968F;&#x4FBF;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x8BB0;&#x5FC6;&#x4E00;&#x4E32;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x5173;&#x952E;&#x8BCD;&#x3002;</p>
<p>&#x6B63;&#x662F;&#x5982;&#x6B64;&#xFF0C;<strong>&#x8FD9;&#x7C7B;&#x82F1;&#x8BED;&#x5B66;&#x4E60;&#x901F;&#x8BB0;&#x6280;&#x5DE7;&#x4E5F;&#x6210;&#x4E86;&#x5404;&#x79CD;&#x7F51;&#x4E0A;&#x5B66;&#x4E60;&#x5E73;&#x53F0;&#x5272;&#x97ED;&#x83DC;&#x7684;&#x89C6;&#x9891;&#x6559;&#x7A0B;</strong>&#xFF0C;&#x8FD8;&#x5356;&#x4EF7;&#x4E0D;&#x83F2;&#x3002;&#x901A;&#x8FC7;&#x51E0;&#x4E2A;&#x5355;&#x8BCD;&#x8054;&#x60F3;&#x8BA9;&#x8BD5;&#x770B;&#x7684;&#x89C2;&#x4F17;&#x89C9;&#x5F97;&#x795E;&#x5947;&#xFF0C;&#x4ECE;&#x800C;&#x8111;&#x70ED;&#x4E70;&#x4E0B;&#x6559;&#x7A0B;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x4E70;&#x4E86;&#x4E0D;&#x770B;&#xFF0C;&#x5373;&#x4F7F;&#x770B;&#x4E86;&#x7EC3;&#x4E86;&#x4E5F;&#x6CA1;&#x5565;&#x7528;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x8FC7;&#x6765;&#x4EBA;&#x56DE;&#x5934;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x5B8C;&#x5168;&#x662F;&#x5F2F;&#x8DEF;&#xFF0C;&#x8FD9;&#x4E9B;<strong>&#x901F;&#x8BB0;&#x65B9;&#x6CD5;&#x5927;&#x591A;&#x662F;&#x8868;&#x6F14;&#x6027;&#x8D28;&#x7684;&#xFF0C;&#x6839;&#x672C;&#x6CA1;&#x6CD5;&#x56FA;&#x5316;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;</strong>&#x3002;&#x8BF7;&#x4F60;&#x56DE;&#x5FC6;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x8BA4;&#x8BC6; <code>commit</code> &#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#xFF1F;&#x662F;&#x56E0;&#x4E3A;&#x901A;&#x8FC7;&#x4EC0;&#x4E48;&#x5176;&#x4ED6;&#x5355;&#x8BCD;&#x8054;&#x60F3;&#x51FA;&#x6765;&#x7684;&#x5417;&#xFF1F;&#x662F;&#x56E0;&#x4E3A;&#x901A;&#x8FC7;&#x67D0;&#x4E2A;&#x56FE;&#x7247;&#x5173;&#x8054;&#x60F3;&#x8D77;&#x6765;&#x7684;&#x5417;&#xFF1F;&#x5E76;&#x4E0D;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x7528; git &#x63D0;&#x4EA4;&#x65F6;&#xFF0C;&#x4F60;&#x51E0;&#x4E4E;&#x5929;&#x5929;&#x90FD;&#x9047;&#x5230;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x540C;&#x4E8B;&#x5929;&#x5929;&#x4EA4;&#x6D41;&#x7528;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x6B63;&#x662F;&#x4E00;&#x904D;&#x904D;&#x7684;&#x5728;&#x4F60;&#x9762;&#x524D;&#x51FA;&#x73B0;&#x3001;&#x542C;&#x5230;&#x624D;&#x8BA9;&#x4F60;&#x975E;&#x5E38;&#x719F;&#x7EC3;&#x7684;&#x638C;&#x63E1;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x8BA4;&#x8BC6; <code>commit</code> &#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x90A3;&#x4E48;&#x8BF4;&#x8BF4;&#x4F60;&#x662F;&#x600E;&#x4E48;&#x8BB0;&#x4F4F;&#x4F60;&#x7684;&#x90A3;&#x4E48;&#x957F;&#x7684;&#x8EAB;&#x4EFD;&#x8BC1;&#x53F7;&#x7801;&#x7684;&#xFF1F;&#x662F;&#x901A;&#x8FC7;&#x5BF9;&#x6570;&#x5B57;&#x56FE;&#x50CF;&#x5316;&#x3001;&#x6545;&#x4E8B;&#x5316;&#x7F16;&#x6392;&#x7684;&#xFF1F;&#x8FD8;&#x662F;&#x5927;&#x91CF;&#x91CD;&#x590D;&#x89C1;&#x5230;&#x548C;&#x7528;&#x5230;&#xFF1F;</p>
<p><strong>&#x4F60;&#x8D8A;&#x65E9;&#x660E;&#x767D;&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x6CA1;&#x6709;&#x6280;&#x5DE7;&#xFF0C;&#x5C31;&#x4F1A;&#x8D70;&#x8D8A;&#x5C11;&#x7684;&#x5F2F;&#x8DEF;&#x3001;&#x82B1;&#x8D8A;&#x5C11;&#x7684;&#x51A4;&#x6789;&#x94B1;&#x3002;</strong>&#x2014;&#x2014;&#x8FD9;&#x662F;&#x6211;&#x8D70;&#x8FC7; 13 &#x5E74;&#x7684;&#x5F2F;&#x8DEF;&#x8FD1;&#x671F;&#x5F97;&#x51FA;&#x7684;&#x7ED3;&#x8BBA;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x91CD;&#x590D;&#x8BAD;&#x7EC3;&#x5F97;&#x5230;&#x7684;&#x80FD;&#x529B;&#x8FD8;&#x4F1A;&#x66F4;&#x6301;&#x4E45;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x7684; QQ &#x53F7;&#xFF0C;&#x5373;&#x4FBF;&#x8FC7;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#x6CA1;&#x7528;&#x5E94;&#x8BE5;&#x8FD8;&#x53EF;&#x4EE5;&#x719F;&#x7EC3;&#x7684;&#x80CC;&#x51FA;&#x6765;&#x5427;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528; Anki &#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5177;&#x4F53;&#x4ECB;&#x7ECD;&#x8BE6;&#x89C1; QA &#x7AE0;&#x8282;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 我的训练方法">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ListeningandSpeaking.html" class="navigation navigation-next " aria-label="Next page: 发音和听力训练方法">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"扩充语料库的训练方法","level":"1.4.1","depth":2,"next":{"title":"发音和听力训练方法","level":"1.4.2","depth":2,"path":"training/ListeningandSpeaking.md","ref":"./training/ListeningandSpeaking.md","articles":[]},"previous":{"title":"我的训练方法","level":"1.4","depth":1,"path":"training/README.md","ref":"./training/README.md","articles":[{"title":"扩充语料库的训练方法","level":"1.4.1","depth":2,"path":"training/KnowledgeBase.md","ref":"./training/KnowledgeBase.md","articles":[]},{"title":"发音和听力训练方法","level":"1.4.2","depth":2,"path":"training/ListeningandSpeaking.md","ref":"./training/ListeningandSpeaking.md","articles":[]},{"title":"英语思维训练","level":"1.4.3","depth":2,"path":"training/Thinking.md","ref":"./training/Thinking.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["editlink","baidu-tongji","book-summary-scroll-position-saver","disqus","github","splitter"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"a-programmers-guide-to-english"},"github":{"url":"https://github.com/yujiangshui/A-Programmers-Guide-to-English"},"editlink":{"label":"Edit This Page","multilingual":false,"base":"https://github.com/yujiangshui/A-Programmers-Guide-to-English/edit/master"},"baidu-tongji":{"url":"https://hm.baidu.com/hm.js","token":"d06ab4cb74251c2a6ad3d47a7d9c2864"},"book-summary-scroll-position-saver":{},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"A Programmer's Guide to English","gitbook":"*"},"file":{"path":"training/KnowledgeBase.md","mtime":"2019-02-21T08:38:27.092Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-23T06:57:16.715Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-baidu-tongji/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-book-summary-scroll-position-saver/book-summary-scroll-position-saver.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

