
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>发音和听力训练方法 · A Programmer's Guide to English</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Thinking.html" />
    
    
    <link rel="prev" href="KnowledgeBase.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    关于本指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../essence/">
            
                <a href="../essence/">
            
                    
                    语言学习的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../make-a-program/">
            
                <a href="../make-a-program/">
            
                    
                    如何构建一个识别英语的程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="./">
            
                <a href="./">
            
                    
                    我的训练方法
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="KnowledgeBase.html">
            
                <a href="KnowledgeBase.html">
            
                    
                    扩充语料库的训练方法
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.2" data-path="ListeningandSpeaking.html">
            
                <a href="ListeningandSpeaking.html">
            
                    
                    发音和听力训练方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="Thinking.html">
            
                <a href="Thinking.html">
            
                    
                    英语思维训练
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../qa/">
            
                <a href="../qa/">
            
                    
                    常见问题 QA
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../qa/WhyPTE.html">
            
                <a href="../qa/WhyPTE.html">
            
                    
                    为什么我选择 PTE 考试
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../resources/">
            
                <a href="../resources/">
            
                    
                    资料、工具推荐和扩展阅读
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >发音和听力训练方法</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x53D1;&#x97F3;&#x548C;&#x542C;&#x529B;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;">&#x53D1;&#x97F3;&#x548C;&#x542C;&#x529B;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;</h1>
<p>&#x53D1;&#x97F3;&#x548C;&#x542C;&#x529B;&#x662F;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x7684;&#xFF0C;&#x90FD;&#x662F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8BED;&#x6599;&#x5E93;&#x7684;&#x58F0;&#x97F3;&#x7D20;&#x6750;&#x3002;<strong>&#x6240;&#x4EE5;&#x7EC3;&#x53D1;&#x97F3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x80FD;&#x53D1;&#x51FA;&#x67D0;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x4E5F;&#x80FD;&#x8BA9;&#x4F60;&#x542C;&#x529B;&#x80FD;&#x5206;&#x8FA8;&#x51FA;&#x6765;&#xFF1B;&#x53CD;&#x4E4B;&#xFF0C;&#x5148;&#x80FD;&#x5206;&#x8FA8;&#x51FA;&#x67D0;&#x79CD;&#x58F0;&#x97F3;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x6A21;&#x4EFF;&#x53D1;&#x51FA;&#x6765;&#x3002;</strong></p>
<h2 id="&#x97F3;&#x6807;&#x8981;&#x5237;&#x5230;&#x719F;&#x7EC3;&#x3001;&#x51C6;&#x786E;&#x4E3A;&#x6B62;">&#x97F3;&#x6807;&#x8981;&#x5237;&#x5230;&#x719F;&#x7EC3;&#x3001;&#x51C6;&#x786E;&#x4E3A;&#x6B62;</h2>
<p><strong>&#x3010;&#x97F3;&#x6807;&#x662F;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x7684;&#x6700;&#x5C0F;&#x8BC6;&#x522B;&#x5355;&#x4F4D;&#xFF0C;&#x7528;&#x4E8E;&#x5EFA;&#x7ACB;&#x6700;&#x57FA;&#x7840;&#x7684;&#x8BED;&#x97F3;&#x8BED;&#x6599;&#x5E93;&#x3011;</strong></p>
<p>&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x8E29;&#x4E86;&#x5751;&#x3002;&#x5728;&#x6211;&#x5B66;&#x4F1A;&#x6253;&#x5B57;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x4E0D;&#x4F1A;&#x62FC;&#x97F3;&#xFF0C;&#x4F46;&#x4E5F;&#x6B63;&#x5E38;&#x638C;&#x63E1;&#x4E2D;&#x6587;&#x53D1;&#x97F3;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x4E0A;&#x82F1;&#x8BED;&#x8BFE;&#x65F6;&#x4E0D;&#x61C2;&#x97F3;&#x6807;&#x5C31;&#x7B97;&#x4E86;&#x89C9;&#x5F97;&#x8DDF;&#x4E2D;&#x6587;&#x4E00;&#x6837;&#x80AF;&#x5B9A;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x8FD9;&#x8D70;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x5F2F;&#x8DEF;&#x3002;</p>
<p><a href="https://www.bilibili.com/video/av29899416/" target="_blank">&#x90ED;&#x6770;&#x745E;&#x7684;&#x300A;&#x7F8E;&#x56FD;&#x4EBA;&#x5B66;&#x82F1;&#x8BED;&#x7ADF;&#x7136;&#x4E0D;&#x5B66;&#x97F3;&#x6807;&#xFF01;&#x4E3A;&#x5565;&#x4E2D;&#x56FD;&#x4EBA;&#x8981;&#x5B66;&#xFF1F;&#x300B;</a> &#x5F88;&#x597D;&#x7684;&#x89E3;&#x91CA;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x7B80;&#x5355;&#x7684;&#x8BF4; Native Speaker &#x751F;&#x6D3B;&#x5728;&#x8FD9;&#x4E2A;&#x8BED;&#x8A00;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x6A21;&#x4EFF;&#x522B;&#x4EBA;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x4E5F;&#x4E0D;&#x65AD;&#x7684;&#x88AB;&#x7EA0;&#x6B63;&#x8FD9;&#x4E2A;&#x58F0;&#x97F3;&#xFF0C;&#x53C8;&#x6709;&#x5927;&#x91CF;&#x7684;&#x8F93;&#x5165;&#x81EA;&#x7136;&#x4F1A;&#x5F88;&#x51C6;&#x3002;&#x4F46;&#x5BF9;&#x4E8E;&#x4E2D;&#x56FD;&#x4EBA;&#x6765;&#x8BF4;&#x663E;&#x7136;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x6A21;&#x4EFF;&#x7684;&#x8FD9;&#x4E2A;&#x4EBA;&#x7684;&#x53D1;&#x97F3;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x9519;&#x7684;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4EBA;&#x7ED9;&#x4F60;&#x7EA0;&#x6B63;&#xFF0C;&#x751A;&#x81F3;&#x4F60;&#x7684;&#x9519;&#x8BEF;&#x53D1;&#x97F3;&#x4F1A;&#x8BEF;&#x5BFC;&#x5176;&#x4ED6;&#x4EBA;&#x3002;</p>
<p>&#x5373;&#x4FBF;&#x662F;&#x5728;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x65F6;&#x5E38;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x6BD4;&#x5982; <code>Button</code> &#x8FD9;&#x4E2A;&#x9AD8;&#x9891;&#x7B80;&#x5355;&#x7684;&#x8BCD;&#x6C47;&#xFF0C;&#x4E00;&#x76F4;&#x5FF5; &#x201C;&#x5DF4;&#x7279;&#x55EF;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x540C;&#x4E8B;&#x5FF5; &#x201C;&#x6CE2;&#x7279;&#x55EF;&#x201D; &#x597D;&#x5947;&#x602A;&#xFF0C;&#x641C;&#x4E86;&#x4E0B;&#x53D1;&#x97F3;&#x4E0D;&#x77E5;&#x9053;&#x641C;&#x4E86;&#x54EA;&#x56FD;&#x53E3;&#x97F3;&#xFF0C;&#x58F0;&#x97F3;&#x542C;&#x8D77;&#x6765;&#x7684;&#x786E;&#x50CF;&#x662F; &#x201C;&#x6CE2;&#x7279;&#x55EF;&#x201D;&#xFF0C;&#x4E4B;&#x540E;&#x6211;&#x4E5F;&#x4E00;&#x76F4;&#x5FF5; &#x201C;&#x6CE2;&#x7279;&#x6069;&#x201D;&#x3002;&#x76F4;&#x5230;&#x6211;&#x5B66;&#x4F1A;&#x4E86;&#x97F3;&#x6807;&#x624D;&#x80FD;&#x5341;&#x5206;&#x786E;&#x5B9A;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x771F;&#x6B63;&#x53D1;&#x97F3;&#x5C31;&#x662F;&#x7C7B;&#x4F3C; &#x201C;&#x5DF4;&#x7279;&#x55EF;&#x201D;&#x3002;&#x4E3E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x60F3;&#x8BF4;&#xFF0C;<strong>&#x53EA;&#x6709;&#x97F3;&#x6807;&#x624D;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#x6700;&#x7CBE;&#x786E;&#x7684;&#x53D1;&#x97F3;</strong>&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x53E3;&#x97F3;&#x4EE5;&#x53CA;&#x53D1;&#x97F3;&#x8005;&#x6C34;&#x5E73;&#x7B49;&#x7B49;&#x56E0;&#x7D20;&#xFF0C;&#x4F60;&#x4E0D;&#x786E;&#x5B9A;&#x542C;&#x5230;&#x7684;&#x53D1;&#x97F3;&#x662F;&#x7EDD;&#x5BF9;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x770B;&#x5230;&#x97F3;&#x6807;&#x4F60;&#x624D;&#x80FD;&#x786E;&#x5B9A;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x5728;&#x963F;&#x91CC;&#x5DE5;&#x4F5C;&#x65F6;&#x7528;&#x5230;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x53EB; Fusion &#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;&#xFF0C;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x6211;&#x5728;&#x963F;&#x91CC;&#x542C;&#x5230;&#x4E86;&#x81F3;&#x5C11;&#x5341;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x53D1;&#x97F3;&#xFF0C;&#x5370;&#x8C61;&#x4E2D;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x662F;&#x5BF9;&#x7684;&#x3002;&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x91CC;&#x6709;&#x4E2A;&#x6BD4;&#x8F83; &#x201C;&#x96BE;&#x53D1;&#x201D; &#x7684;&#x97F3; <code>&#x292;</code>&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x96BE;&#x53D1;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x6C49;&#x8BED;&#x4E2D;&#x6CA1;&#x6709;&#x8FD9;&#x79CD;&#x58F0;&#x97F3;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x6765;&#x6CA1;&#x7EC3;&#x8FC7;&#x53D1;&#x51FA;&#x8FD9;&#x79CD;&#x58F0;&#x97F3;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x7ECF;&#x8FC7;&#x8BAD;&#x7EC3;&#xFF0C;&#x53E3;&#x8154;&#x808C;&#x8089;&#x548C;&#x6C14;&#x606F;&#x5F88;&#x96BE;&#x53D1;&#x51FA;&#x8FD9;&#x4E2A;&#x58F0;&#x97F3;&#x5BFC;&#x81F4;&#x5355;&#x8BCD;&#x53D1;&#x9519;&#x97F3;&#x3002;&#x53EF;&#x4EE5;<a href="https://forvo.com/word/fusion/#en" target="_blank">&#x5728; forvo &#x4E0A;&#x9762;&#x542C;&#x542C;&#x591A;&#x4F4D;&#x8001;&#x5916;&#x5F55;&#x7684;&#x53D1;&#x97F3;</a>&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0B;&#x9762;&#x4ECD;&#x7136;&#x6709;&#x4E24;&#x4E2A;&#x5947;&#x602A;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x77E5;&#x9053;&#x97F3;&#x6807;&#x6A21;&#x4EFF;&#x8FD9;&#x4FE9;&#x58F0;&#x97F3;&#x90A3;&#x5C31;&#x975E;&#x5E38;&#x60B2;&#x5267;&#x4E86;&#x3002;&#x5F53;&#x7136;&#x6700;&#x51C6;&#x786E;&#x7684;&#x8FD8;&#x662F; <a href="https://dictionary.cambridge.org/dictionary/english/fusion" target="_blank">Cambridge Dictionary</a> &#x4E0A;&#x9762;&#x7684;&#x53D1;&#x97F3;&#xFF0C;&#x6743;&#x5A01;&#x3001;&#x4E13;&#x4E1A;&#x4E14;&#x51C6;&#x786E;&#x3002;&#x6240;&#x4EE5;<strong>&#x8BAD;&#x7EC3;&#x97F3;&#x6807;&#x6700;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8865;&#x5145;&#x4F60;&#x4E4B;&#x524D;&#x53D1;&#x4E0D;&#x51FA;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x8FA8;&#x97F3;&#x3002;</strong></p>
<p>&#x5177;&#x4F53;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x5148;&#x6309;&#x7167;&#x7F51;&#x4E0A;&#x63A8;&#x8350;&#x7528;&#x4E86;&#x8D56;&#x4E16;&#x96C4;&#x7684;&#x300A;&#x53D1;&#x97F3;&#x4ECE;&#x5934;&#x5B66;&#x300B;&#xFF0C;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x8DDF;&#x7740;&#x6559;&#x7A0B;&#x5237;&#x8FC7;&#x4E09;&#x904D;&#xFF0C;&#x539F;&#x4EE5;&#x4E3A;&#x6CA1;&#x95EE;&#x9898;&#x4E86;&#x7ED3;&#x679C;&#x53D1;&#x73B0;&#x8FD8;&#x662F;&#x4E0D;&#x884C;&#xFF0C;&#x800C;&#x4E14;&#x56FD;&#x9645;&#x97F3;&#x6807;&#xFF08;IPA&#xFF09;&#x6709;&#x82F1;&#x5F0F;&#x7684; DJ &#x548C;&#x7F8E;&#x5F0F;&#x7684; KK &#x4E24;&#x79CD;&#x5199;&#x6CD5;&#x3002;&#x800C;&#x8FD9;&#x672C;&#x4E66;&#x4E3B;&#x8981;&#x662F;&#x7F8E;&#x5F0F;&#xFF0C;&#x7F51;&#x4E0A;&#x7ECF;&#x5E38;&#x641C;&#x51FA;&#x82F1;&#x5F0F;&#x97F3;&#x6807;&#xFF0C;&#x6240;&#x4EE5;&#x65F6;&#x5E38;&#x61F5;&#x903C;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x63A8;&#x8350;&#x76F4;&#x63A5;&#x5728; Youtube &#x4E0A;&#x627E; IPA &#x89C6;&#x9891;&#x6765;&#x5237;&#xFF0C;&#x6BD4;&#x5982; <a href="https://www.youtube.com/watch?v=o8KppNXfx2k" target="_blank">International Phonetic Alphabet (IPA) | English Pronunciation</a> &#x8FD9;&#x4E2A;&#x662F;&#x6211;&#x89C1;&#x8FC7;&#x6700;&#x597D;&#x7684; IPA &#x53D1;&#x97F3;&#x6559;&#x7A0B;&#xFF0C;&#x9644;&#x5E26;&#x4E86;&#x8D56;&#x4E16;&#x96C4;&#x4E66;&#x91CC;&#x6CA1;&#x6709;&#x7684;&#x57FA;&#x7840;&#x89C4;&#x5219;&#x548C;&#x82F1;&#x7F8E;&#x5BF9;&#x6BD4;&#x3002;&#x4F46;&#x4ECD;&#x7136;&#x6709;&#x90E8;&#x5206;&#x5355;&#x8BCD;&#x7684;&#x7F8E;&#x5F0F;&#x53D1;&#x97F3;&#x4E0D;&#x591F;&#x51C6;&#x786E;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x8981;&#x63A8;&#x8350;&#x4E00;&#x4E2A; <a href="https://www.bilibili.com/video/av33138814/" target="_blank">48&#x4E2A;&#x97F3;&#x6807;&#x7684;&#x6807;&#x51C6;&#x7F8E;&#x5F0F;&#x53D1;&#x97F3;</a> &#x914D;&#x5408;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E2A;&#x7684;&#x597D;&#x5904;&#x662F;&#x6709;&#x5634;&#x5F62;&#x53EF;&#x4EE5;&#x6A21;&#x4EFF;&#xFF0C;<strong>&#x53D1;&#x97F3;&#x7684;&#x5173;&#x952E;&#x5C31;&#x662F;&#x5634;&#x5F62;&#x3001;&#x820C;&#x5934;&#x4F4D;&#x7F6E;&#x3001;&#x6C14;&#x606F;&#x76F8;&#x4E92;&#x914D;&#x5408;&#x4EA7;&#x751F;&#x58F0;&#x97F3;</strong>&#xFF0C;&#x6709;&#x4E9B;&#x58F0;&#x97F3;&#x65E0;&#x6CD5;&#x53D1;&#x5230;&#x4F4D;&#x7684;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x5634;&#x5F62;&#x3001;&#x820C;&#x5934;&#x7B49;&#x4E0D;&#x5230;&#x4F4D;&#x3002;&#x4F8B;&#x5982; three &#x7684;&#x54AC;&#x820C;&#x97F3; &#x3B8;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x820C;&#x5C16;&#x6CA1;&#x653E;&#x5230;&#x7259;&#x4E0A;&#x5410;&#x6C14;&#xFF0C;&#x5C31;&#x662F;&#x53D1;&#x4E0D;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x97F3;&#x6807;&#x6CA1;&#x6709;&#x7EA0;&#x97F3;&#x5DE5;&#x5177;&#xFF0C;&#x6240;&#x4EE5;&#x97F3;&#x6807;&#x672C;&#x8EAB;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x5927;&#x7CBE;&#x529B;&#x53BB;&#x62FC;&#x547D;&#x7EC3;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x5927;&#x6982;&#x7387;&#x8BFB;&#x7684;&#x4E0D;&#x51C6;&#x3002;&#x91CD;&#x70B9;&#x5728;&#x4E0B;&#x9762; Google &#x7EA0;&#x97F3;&#x90E8;&#x5206;&#xFF0C;&#x7531;&#x4E8E;&#x97F3;&#x8282;&#x51FA;&#x9519;&#x5C31;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x8BC6;&#x522B;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x7EA0;&#x97F3;&#x65F6;&#x53D1;&#x73B0;&#x8BC6;&#x522B;&#x4E0D;&#x51FA;&#x6765;&#x7684;&#x5355;&#x8BCD;&#xFF0C;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x97F3;&#x6807;&#x6765;&#x7EC3;&#xFF0C;&#x53EF;&#x4EE5;&#x53CD;&#x5411;&#x7EA0;&#x6B63;&#x4F60;&#x7684;&#x97F3;&#x6807;&#x53D1;&#x97F3;&#x3002;</p>
<h2 id="&#x901A;&#x8FC7;-google-&#x7FFB;&#x8BD1;&#x8BC6;&#x522B;&#x7EA0;&#x97F3;">&#x901A;&#x8FC7; Google &#x7FFB;&#x8BD1;&#x8BC6;&#x522B;&#x7EA0;&#x97F3;</h2>
<p><strong>&#x3010;&#x6B63;&#x786E;&#x7684;&#x53D1;&#x97F3;&#x662F;&#x6B63;&#x5E38;&#x3001;&#x51C6;&#x786E;&#x4EA4;&#x6D41;&#x7684;&#x524D;&#x63D0;&#xFF0C;&#x8BED;&#x6599;&#x5E93;&#x91CC;&#x7684;&#x7D20;&#x6750;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x6B63;&#x786E;&#xFF0C;&#x7EA0;&#x97F3;&#x662F;&#x79EF;&#x7D2F;&#x6B63;&#x786E;&#x8BED;&#x6599;&#x4E2D;&#x975E;&#x5E38;&#x5173;&#x952E;&#x7684;&#x4E00;&#x6B65;&#x3011;</strong></p>
<p>&#x5F53;&#x6211;&#x89C9;&#x5F97;&#x51C6;&#x5907;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B21; PTE &#x6A21;&#x8003;&#xFF0C;&#x7ED3;&#x679C;&#x8D85;&#x51FA;&#x6211;&#x7684;&#x60F3;&#x8C61;&#x3002;&#x53D1;&#x97F3;&#x548C;&#x53E3;&#x8BED;&#x6D41;&#x5229;&#x5EA6;&#x5C45;&#x7136;&#x662F; 0 &#x5206;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211; PTE &#x6D4B;&#x8BC4;&#x7A0B;&#x5E8F;&#x8BA4;&#x4E3A;&#x6211;&#x8BF4;&#x7684;&#x4E0D;&#x662F;&#x82F1;&#x8BED;&#xFF0C;&#x6709;&#x8D85;&#x8FC7;&#x4E00;&#x534A;&#x7684;&#x8BED;&#x97F3;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x5BF9;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x5230;&#x5E95;&#x8BF4;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x5728;&#x6DD8;&#x5B9D;&#x4E0A;&#x627E;&#x5230;&#x4E86; 1v1 &#x7684;&#x7EA0;&#x97F3;&#x8BFE;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x6709;&#x5927;&#x91CF;&#x5F88;&#x57FA;&#x7840;&#x7684;&#x5355;&#x8BCD;&#x90FD;&#x8BFB;&#x9519;&#x4E86;&#x3002;&#x6BD4;&#x5982; <code>school</code> &#x76F4;&#x63A5;&#x8BFB; <code>&#x56DB;&#x987E;</code> &#xFF0C;&#x6F0F;&#x4E86; <code>l</code> &#x7684;&#x97F3;&#xFF0C;&#x5B9E;&#x9645;&#x53D1;&#x97F3;&#x7C7B;&#x4F3C; <code>&#x56DB;&#x987E;&#x5965;</code>&#xFF1B;&#x540C;&#x6837;&#x7684; <code>idea</code> &#x8BFB;&#x6210;&#x4E86; <code>&#x7231;&#x7B2C;&#x4E5F;&#x997F;</code>&#xFF0C;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x5377;&#x820C;&#x97F3;&#x3002;</p>
<p>&#x4EBA;&#x8089;&#x7EA0;&#x97F3;&#x663E;&#x7136;&#x4E0D;&#x9002;&#x5408;&#x5927;&#x91CF;&#x8BAD;&#x7EC3;&#xFF0C;&#x4E00;&#x662F;&#x8D35;&#xFF0C;&#x4E8C;&#x662F;&#x53CD;&#x9988;&#x6162;&#x4E0D;&#x80FD;&#x5B9E;&#x65F6;&#x53CD;&#x9988;&#xFF0C;&#x4E09;&#x662F;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x8FD8;&#x662F;&#x53D1;&#x73B0;&#x4E0D;&#x4E86;&#x3002;&#x7531;&#x4E8E; PTE &#x662F;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#xFF0C;&#x673A;&#x5668;&#x6253;&#x5206;&#x3002;&#x6211;&#x5F88;&#x5FEB;&#x5C31;&#x60F3;&#x5230;&#x4E86;&#x7528; Siri &#x6765;&#x8BC6;&#x522B;&#x6211;&#x8BF4;&#x7684;&#x4E1C;&#x897F;&#x51C6;&#x4E0D;&#x51C6;&#xFF0C;&#x4F46;&#x5176;&#x5B9E; Siri &#x662F;&#x504F;&#x65E5;&#x5E38;&#x5316;&#x7684;&#x53E3;&#x8BED;&#x6A21;&#x578B;&#xFF0C;&#x9762;&#x5BF9;&#x590D;&#x6742;&#x5355;&#x8BCD;&#x7B49;&#x4F1A;&#x5F3A;&#x884C;&#x8F6C;&#x6362;&#x6210;&#x65E5;&#x5E38;&#x5BF9;&#x8BDD;&#x5E76;&#x4E0D;&#x5408;&#x9002;&#x3002;Google &#x7FFB;&#x8BD1;&#x4FBF;&#x6210;&#x4E86;&#x6700;&#x4F73;&#x9009;&#x62E9;&#x3002;</p>
<p><strong>Google &#x7FFB;&#x8BD1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x6280;&#x672F;&#x548C;&#x8BAD;&#x7EC3;&#x7D20;&#x6750;&#x6765;&#x505A;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x5F15;&#x64CE;</strong>&#xFF0C;&#x7531;&#x4E8E;&#x662F;&#x7FFB;&#x8BD1;&#xFF0C;&#x4F1A;&#x5C3D;&#x53EF;&#x80FD;&#x539F;&#x6C41;&#x539F;&#x5473;&#x7684;&#x89E3;&#x6790;&#x3002;&#x5982;&#x679C;&#x8D28;&#x7591;&#x5B83;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BFB;&#x4E00;&#x6BB5;&#x4E2D;&#x6587;&#x8BA9;&#x5B83;&#x8BC6;&#x522B;&#xFF0C;&#x6216;&#x8005;&#x64AD;&#x653E;&#x4E00;&#x6BB5;&#x6E05;&#x6670;&#x7684;&#x82F1;&#x6587;&#x8BED;&#x97F3;&#x8BD5;&#x8BD5;&#x770B;&#x3002;</p>
<p>&#x5728;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x53D1;&#x97F3;&#x95EE;&#x9898;&#x5F88;&#x4E25;&#x91CD;&#x65F6;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x4E86;&#x8270;&#x96BE;&#x7684;&#x7EA0;&#x97F3;&#x8FC7;&#x7A0B;&#x3002;<strong>&#x65B9;&#x6CD5;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x627E;&#x4E2A;&#x5E26;&#x8033;&#x9EA6;&#x7684;&#x8033;&#x673A;&#x6216;&#x8005;&#x9EA6;&#x514B;&#x98CE;&#xFF08;&#x52A1;&#x5FC5;&#x8981;&#x7528;&#x5916;&#x7F6E;&#x58F0;&#x97F3;&#x8F93;&#x5165;&#x8BBE;&#x5907;&#xFF0C;&#x5426;&#x5219;&#x8BC6;&#x522B;&#x53EF;&#x80FD;&#x4E0D;&#x51C6;&#xFF09;&#xFF0C;&#x6253;&#x5F00; <a href="https://translate.google.as/" target="_blank">https://translate.google.as/</a>&#xFF08;&#x4E4B;&#x6240;&#x4EE5;&#x6253;&#x5F00; .as &#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x57DF;&#x540D;&#x4E0B;&#x9762;&#x4F1A;&#x9ED8;&#x8BA4;&#x542F;&#x7528;&#x7F8E;&#x5F0F;&#x53D1;&#x97F3;&#x3001;&#x8BC6;&#x522B;&#x5F15;&#x64CE;&#xFF09;<a href="../assets/google-translate.jpg" target="_blank">&#x5E76;&#x70B9;&#x51FB;&#x4E0B;&#x9762;&#x9EA6;&#x514B;&#x98CE; Icon &#x5F00;&#x59CB;&#x8BF4;</a>&#xFF0C;&#x67E5;&#x770B;&#x662F;&#x5426;&#x8BC6;&#x522B;&#x3002;</strong></p>
<p>&#x53EF;&#x4EE5;&#x8BF4;&#x5355;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#x4E00;&#x4E2A;&#x53E5;&#x5B50;&#x3002;&#x6211;&#x5148;&#x4ECE;&#x53E5;&#x5B50;&#x5F00;&#x59CB;&#xFF0C;&#x8BF4;&#x4E00;&#x53E5;&#x8BDD;&#x770B;&#x770B;&#x662F;&#x5426;&#x8BC6;&#x522B;&#xFF0C;&#x627E;&#x5230;&#x8BC6;&#x522B;&#x9519;&#x7684;&#x5355;&#x8BCD;&#x8FDB;&#x884C;&#x5355;&#x72EC;&#x8BAD;&#x7EC3;&#xFF0C;&#x4E4B;&#x540E;&#x518D;&#x56DE;&#x5934;&#x8BFB;&#x53E5;&#x5B50;&#x3002;&#x4E3A;&#x4E86;&#x8282;&#x7EA6;&#x65F6;&#x95F4;&#xFF0C;&#x4E00;&#x4E2A;&#x53E5;&#x5B50; 80% &#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x5C31;&#x7B97;&#x53EF;&#x4EE5;&#x8FC7;&#x4E86;&#x3002;<strong>&#x5176;&#x5B9E;&#x82F1;&#x8BED;&#x5B66;&#x4E60;&#x662F;&#x87BA;&#x65CB;&#x5F0F;&#x4E0A;&#x5347;&#xFF0C;&#x5F53;&#x4F60;&#x8BFB;&#x5230; 80%&#xFF0C;&#x4F60;&#x518D;&#x6B7B;&#x78D5;&#x4E5F;&#x5F88;&#x96BE;&#x63D0;&#x5347;&#xFF0C;&#x4F46;&#x662F;&#x8BAD;&#x7EC3;&#x5176;&#x4ED6;&#x7684;&#x5185;&#x5BB9;&#x8FC7;&#x6BB5;&#x65F6;&#x95F4;&#x56DE;&#x6765;&#x770B;&#xFF0C;&#x5F88;&#x8F7B;&#x677E;&#x5C31;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x5230; 80% &#x4EE5;&#x4E0A;&#x3002;&#x8FD9;&#x4E2A;&#x8DDF;&#x770B;&#x6280;&#x672F;&#x4E66;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x5F53;&#x4F60;&#x5361;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x4E0D;&#x8981;&#x505C;&#x7EE7;&#x7EED;&#x4E0B;&#x53BB;&#xFF0C;&#x540E;&#x9762;&#x56DE;&#x5934;&#x4E8C;&#x5237;&#x3001;&#x4E09;&#x5237;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x83AB;&#x540D;&#x5176;&#x5999;&#x7684;&#x5C31;&#x61C2;&#x4E86;&#x3002;</strong></p>
<p>&#x521A;&#x5F00;&#x59CB;&#x7279;&#x522B;&#x8270;&#x96BE;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x8FDE; <code>these</code> &#x8FD9;&#x79CD;&#x6700;&#x5E38;&#x89C1;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5355;&#x8BCD;&#x6211;&#x90FD;&#x8BFB;&#x9519;&#x4E86;&#x8BC6;&#x522B;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x672C;&#x8D28;&#x95EE;&#x9898;&#x9996;&#x5148;&#x662F; <code>&#xF0;</code> &#x548C; <code>z</code> &#x8FD9;&#x4FE9;&#x97F3;&#x6807;&#x672C;&#x8EAB;&#x53D1;&#x97F3;&#x4E0D;&#x51C6;&#xFF0C;&#x5176;&#x6B21;&#x662F;&#x8FD9;&#x4FE9;&#x8FDE;&#x8D77;&#x6765;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#x4E2D;&#x5FEB;&#x901F;&#x8BFB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x820C;&#x5934;&#x808C;&#x8089;&#x8F6C;&#x4E0D;&#x8FC7;&#x6765;&#x3002;&#x6240;&#x4EE5;&#x7EA0;&#x97F3;&#x7B2C;&#x4E00;&#x5929;&#x4E0A;&#x5348;&#x7EC3;&#x4E86;&#x4E00;&#x4E2A;&#x534A;&#x5C0F;&#x65F6;&#x7684; <code>these</code> &#x76F4;&#x5230;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x51FA;&#x6765;&#x3002;&#x5F53;&#x65F6;&#x633A;&#x7EDD;&#x671B;&#x7684;&#xFF0C;&#x611F;&#x89C9;&#x8FD9;&#x79CD;&#x7EA0;&#x97F3;&#x65B9;&#x5F0F;&#x5F97;&#x7EA0;&#x5230;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x3002;&#x5176;&#x5B9E;&#x540E;&#x9762;&#x8D8A;&#x6765;&#x8D8A;&#x5FEB;&#xFF0C;&#x56E0;&#x4E3A;&#x8868;&#x9762;&#x4E0A;&#x4F60;&#x53EA;&#x7EA0;&#x97F3;&#x4E86; <code>these</code> &#x8FD9;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x5176;&#x5B9E;&#x4F60;&#x628A;&#x6240;&#x6709;&#x5E26; <code>&#xF0;</code> &#x548C; <code>z</code> &#x7684;&#x5355;&#x8BCD;&#x90FD;&#x7EC3;&#x8FC7;&#x4E86;&#x3002;</p>
<p>&#x7EA0;&#x97F3;&#x7ECF;&#x9A8C;&#x603B;&#x7ED3;&#xFF1A;</p>
<ul>
<li><strong>&#x53D1;&#x97F3;&#x8BAD;&#x7EC3;&#x65F6;&#x52A1;&#x5FC5;&#x8981;&#x6709;&#x7EA0;&#x97F3;&#x3002;</strong> &#x6700;&#x597D;&#x662F;&#x4EBA;&#xFF0C;&#x6700;&#x5DEE;&#x662F; Google &#x7FFB;&#x8BD1;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x7EA0;&#x97F3;&#x4E4B;&#x524D;&#xFF0C;<strong>&#x5F88;&#x591A;&#x53D1;&#x97F3;&#x53D1;&#x9519;&#x4E86;&#x81EA;&#x5DF1;&#x662F;&#x5BDF;&#x89C9;&#x4E0D;&#x5230;&#x7684;</strong>&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x81EA;&#x5DF1;&#x97F3;&#x6807;&#x5F88;&#x719F;&#x6089;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x9519;&#x3002;<strong>&#x5982;&#x679C;&#x51FA;&#x9519;&#x6CA1;&#x4EBA;&#x7EA0;&#x6B63;&#x81EA;&#x4EE5;&#x4E3A;&#x6B63;&#x786E;&#x7EE7;&#x7EED;&#x8BAD;&#x7EC3;&#xFF0C;&#x8FD8;&#x4E0D;&#x5982;&#x4E0D;&#x7EC3;&#xFF0C;&#x540E;&#x671F;&#x66F4;&#x96BE;&#x7EA0;&#x97F3;&#x3002;</strong></li>
<li><strong>&#x5927;&#x91CF;&#x8BAD;&#x7EC3;&#x3002;</strong> &#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x660E;&#x663E;&#x611F;&#x89C9;&#x5230;&#xFF0C;&#x5355;&#x4E2A;&#x97F3;&#x6807;&#x8BFB;&#x51C6;&#x8BFB;&#x5BF9;&#xFF0C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x7684;&#x5355;&#x8BCD;&#x5C31;&#x53EF;&#x4EE5;&#x8BFB;&#x5BF9;&#xFF0C;&#x540C;&#x6837;&#x5355;&#x4E2A;&#x5355;&#x8BCD;&#x53EF;&#x4EE5;&#x53D1;&#x97F3;&#x5F88;&#x51C6;&#xFF0C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5728;&#x8BFB;&#x4E00;&#x4E2A;&#x53E5;&#x5B50;&#x7684;&#x65F6;&#x5019;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x53EF;&#x4EE5;&#x8BFB;&#x7684;&#x51C6;&#x3002;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#xFF0C;&#x5927;&#x91CF;&#x8BAD;&#x7EC3;&#x624D;&#x80FD;&#x771F;&#x6B63;<strong>&#x65E0;&#x610F;&#x8BC6;&#x8BFB;&#x51FA;&#x6765;</strong>&#x3002;</li>
</ul>
<h2 id="&#x901A;&#x8FC7;-youtube-&#x5B66;&#x4E60;">&#x901A;&#x8FC7; Youtube &#x5B66;&#x4E60;</h2>
<p><strong>&#x3010;Youtube &#x7684;&#x6D77;&#x91CF;&#x9AD8;&#x8D28;&#x91CF;&#x5B66;&#x4E60;&#x8D44;&#x6E90;&#xFF0C;&#x662F;&#x5EFA;&#x7ACB;&#x8BED;&#x6599;&#x5E93;&#x7684;&#x975E;&#x5E38;&#x597D;&#x7684;&#x7D20;&#x6750;&#x3011;</strong></p>
<p>Youtube &#x7B80;&#x76F4;&#x662F;&#x5B66;&#x4E60;&#x5229;&#x5668;&#x3002;&#x4E0A;&#x9762;&#x6709;&#x65E0;&#x6570;&#x7684;&#x82F1;&#x8BED;&#x8BB2;&#x5E08;&#x5F55;&#x5236;&#x89C6;&#x9891;&#x6559;&#x5916;&#x56FD;&#x4EBA;&#x5B66;&#x82F1;&#x8BED;&#xFF0C;&#x540C;&#x65F6;&#x89C6;&#x9891;&#x672C;&#x8EAB;&#x7528;&#x7684;&#x662F;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x6BD4;&#x8F83;&#x6162;&#x901F;&#x7684;&#x82F1;&#x8BED;&#xFF0C;&#x53EF;&#x4EE5;&#x987A;&#x4FBF;&#x7EC3;&#x4E60;&#x542C;&#x529B;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x8FDE;&#x8BFB; <code>H</code> &#x7701;&#x7565;&#x7684;&#x6559;&#x7A0B; <a href="https://www.youtube.com/watch?v=QuOw_KnFk3Y" target="_blank">How to Link: words that begin with H - American English Pronunciation</a>&#xFF0C;&#x5173;&#x4E8E;&#x82F1;&#x8BED;&#x91CD;&#x97F3;&#x7684;&#x6559;&#x7A0B; <a href="https://www.youtube.com/watch?v=efNSXTGkAsE" target="_blank">Word Stress in English | How to Pronounce...</a>&#xFF0C;<code>-ed</code> &#x7ED3;&#x5C3E;&#x7684;&#x53D1;&#x97F3;&#x89C4;&#x5219; <a href="https://www.youtube.com/watch?v=YWuS7rfZlDQ" target="_blank">How to say -ed endings in English</a>&#x3001;<code>s</code> &#x7ED3;&#x5C3E;&#x7684;&#x53D1;&#x97F3;&#x89C4;&#x5219; <a href="https://www.youtube.com/watch?v=BU6FoC9Rzyg" target="_blank">How to pronounce words ending in S</a> &#x548C; <code>ex</code> &#x524D;&#x7F00;&#x7684;&#x53D1;&#x97F3;&#x89C4;&#x5219; <a href="https://www.youtube.com/watch?v=ef5zvdQwRLw" target="_blank">3 ways to pronounce the EX sound in English</a>&#x3002;&#x592A;&#x591A;&#x592A;&#x591A;&#x4F18;&#x8D28;&#x6559;&#x7A0B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x82F1;&#x6587;&#x5173;&#x952E;&#x8BCD;&#x641C;&#x7D22;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x4E13;&#x9879;&#x6280;&#x5DE7;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5355;&#x8BCD;&#x53D1;&#x97F3;&#x5BF9;&#x6BD4;&#x89C6;&#x9891;&#x3002;&#x5F53;&#x6211;&#x53D1;&#x97F3; Google &#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4F1A;&#x641C;&#x4E0B; <code>xxx pronunciation</code> &#x5173;&#x952E;&#x8BCD;&#x3002;&#x6BD4;&#x5982;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#x7684; <code>value</code> &#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x8BFB;&#x4F5C;&#x7C7B;&#x4F3C; <code>&#x6B6A;&#x6E9C;</code>&#xFF0C;&#x5176;&#x5B9E;&#x770B;&#x5B8C; <a href="https://www.youtube.com/watch?v=h_rDJynxR3M" target="_blank">How to Pronounce Value, Valuation, Evaluation</a> &#x624D;&#x53D1;&#x73B0;&#x7F8E;&#x5F0F;&#x8BFB;&#x6CD5;&#x662F;&#x7C7B;&#x4F3C; <code>&#x6B6A;&#x5965; &#x6CB9;</code> &#x4E24;&#x4E2A;&#x97F3;&#x8282;&#xFF0C;&#x7EA0;&#x6B63;&#x4E4B;&#x540E;&#x8BC6;&#x522B;&#x7387;&#x5C31;&#x662F; 100% &#x4E86;&#x3002;&#x8FD8;&#x6709; <code>million</code>&#x3001;<code>billion</code> &#x8FD9;&#x4E9B;&#x5355;&#x8BCD;&#xFF0C;&#x4E5F;&#x4E00;&#x76F4;&#x6CA1;&#x6CD5;&#x8BC6;&#x522B;&#xFF0C;&#x770B;&#x5B8C; <a href="https://www.youtube.com/watch?v=IiodO8x_Ai0" target="_blank">How to pronounce MILLION, BILLION, TRILLION-American English Pronunciation</a> &#x5C31;&#x5BB9;&#x6613;&#x53D1;&#x4E00;&#x4E9B;&#x3002;&#x8FD8;&#x6709;&#x6570;&#x4E0D;&#x5C3D;&#x7684;&#x7C7B;&#x4F3C;&#x97F3;&#x5355;&#x8BCD;&#x5BF9;&#x6BD4;&#xFF0C;&#x6BD4;&#x5982;&#x6700;&#x8FD1;&#x770B;&#x7684; <a href="https://www.youtube.com/watch?v=zJWA-6BLyi4" target="_blank">How to say ONE and RUN - American English Pronunciation Lesson</a>&#xFF0C;&#x770B;&#x5B8C;&#x5BF9;&#x90E8;&#x5206;&#x97F3;&#x6807;&#x7684;&#x5206;&#x8FA8;&#x80FD;&#x529B;&#x4F1A;&#x63D0;&#x5347;&#x3002;</p>
<p>&#x6B64;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5F88;&#x6709;&#x610F;&#x601D;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x6BD4;&#x5982;&#x82F1;&#x8BED;&#x7684;&#x6D17;&#x8111;&#x7ED5;&#x53E3;&#x4EE4; <a href="https://www.youtube.com/watch?v=02LmAAuwqUI" target="_blank">Betty Botter Bought Some Butter - Nursery Rhymes
</a>&#x3002;<strong>&#x603B;&#x4E4B;&#xFF0C;&#x8981;&#x5584;&#x7528; Youtube &#x6765;&#x5BFB;&#x627E;&#x5B66;&#x4E60;&#x8D44;&#x6599;&#xFF0C;&#x4E2A;&#x4EBA;&#x6BD4;&#x8F83;&#x63A8;&#x8350;&#x7684;&#x5C06;&#x653E;&#x5728;&#x4E0B;&#x9762;&#x8D44;&#x6599;&#x63A8;&#x8350;&#x90E8;&#x5206;&#x3002;</strong></p>
<h2 id="&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;">&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;</h2>
<p><strong>&#x3010;&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;&#x5C06;&#x6269;&#x5C55;&#x4F60;&#x7684;&#x8BED;&#x6599;&#x5E93;&#xFF0C;&#x5E76;&#x6253;&#x78E8;&#x4F60;&#x7684;&#x53D1;&#x58F0;&#x808C;&#x8089;&#x63D0;&#x5347;&#x4F60;&#x7684;&#x53E3;&#x8BED;&#x8868;&#x8FBE;&#x5668;&#x80FD;&#x529B;&#x3011;</strong></p>
<p>&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;&#x5C31;&#x662F;&#x50CF;&#x5F71;&#x5B50;&#x4E00;&#x6837;&#x8DDF;&#x8BFB;&#x4E00;&#x6BB5;&#x542C;&#x529B;&#x3002;&#x505A;&#x6CD5;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;<strong>&#x64AD;&#x653E;&#x4E00;&#x6BB5;&#x82F1;&#x8BED;&#x542C;&#x529B;&#xFF0C;&#x9519;&#x5F00;&#x51E0;&#x79D2;&#x6216;&#x8005;&#x540C;&#x65F6;&#x7167;&#x7740;&#x6587;&#x672C;&#x3001;&#x6A21;&#x4EFF;&#x58F0;&#x97F3;&#x8FDB;&#x884C;&#x8DDF;&#x8BFB;&#x3002;</strong></p>
<p>&#x5206;&#x6790;&#x53EF;&#x5F97;&#xFF1A;</p>
<ul>
<li>&#x8FB9;&#x542C;&#x8FB9;&#x770B;&#xFF0C;&#x4F1A;&#x6269;&#x5145;&#x8BED;&#x6599;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x5F55;&#x5165;&#x58F0;&#x97F3;&#x5E76;&#x8DDF;&#x5355;&#x8BCD;&#x8FDB;&#x884C;&#x6302;&#x94A9;&#x3002;</li>
<li>&#x6A21;&#x4EFF;&#x8DDF;&#x8BFB;&#xFF0C;&#x4F1A;&#x63D0;&#x5347;&#x91CD;&#x97F3;&#x548C;&#x8BED;&#x8C03;&#x53D8;&#x5316;&#xFF0C;&#x540C;&#x65F6;&#x953B;&#x70BC;&#x53E3;&#x8154;&#x808C;&#x8089;&#x7B49;&#x3002;</li>
<li>&#x5BF9;&#x7167;&#x6587;&#x672C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x65E5;&#x5E38;&#x82F1;&#x8BED;&#x4E2D;&#x5BF9;&#x5E38;&#x89C1;&#x5355;&#x8BCD;&#x7684;&#x8FDE;&#x8BFB;&#x7B49;&#x7EC6;&#x8282;&#xFF0C;&#x901A;&#x8FC7;&#x53D1;&#x58F0;&#x53EF;&#x4EE5;&#x953B;&#x70BC;&#x76F8;&#x5173;&#x6280;&#x5DE7;&#x3002;</li>
</ul>
<p>&#x6240;&#x4EE5;<strong>&#x5927;&#x91CF;&#x91CD;&#x590D;&#x8BAD;&#x7EC3;&#x662F;&#x6709;&#x6548;&#x7684;&#x5173;&#x952E;</strong>&#x3002;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4E13;&#x4E1A;&#x5E7F;&#x64AD;&#x7D20;&#x6750;&#x4F8B;&#x5982; &#x79D1;&#x5B66; 60s &#x6216;&#x8005; &#x7ECF;&#x6D4E;&#x5B66;&#x4EBA; &#x8FD9;&#x6837;&#x7684;&#x64AD;&#x5BA2;&#x6765;&#x8BAD;&#x7EC3;&#xFF0C;&#x51E0;&#x53E5;&#x8BDD;&#x5927;&#x6982;&#x65F6;&#x957F;&#x63A7;&#x5236;&#x5728; 40s &#x5DE6;&#x53F3;&#x3002;&#x8001;&#x5E08;&#x7ED9;&#x51FA;&#x7684;&#x8981;&#x6C42;&#x662F;&#x8DDF;&#x8BFB;<strong>&#x81F3;&#x5C11; 50 &#x904D;</strong>&#xFF0C;&#x76F4;&#x5230;&#x53EF;&#x4EE5;&#x6D41;&#x7545;&#x4E00;&#x81F4;&#x7684;&#x8DDF;&#x8BFB;&#xFF0C;&#x6700;&#x597D;&#x4E0D;&#x770B;&#x6587;&#x672C;&#x8FDB;&#x884C;&#x8DDF;&#x8BFB;&#x3002;&#x7136;&#x540E;<strong>&#x8981;&#x5F55;&#x4E0B;&#x97F3;&#x9891;&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#xFF0C;&#x627E;&#x81EA;&#x5DF1;&#x8BFB;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x5730;&#x65B9;</strong>&#x3002;</p>
<p>&#x5B9E;&#x8DF5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x6700;&#x4E3A;&#x75DB;&#x82E6;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8001;&#x5916;&#x8BF4;&#x8BDD;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x5634;&#x5F88;&#x7B28;&#x8001;&#x662F;&#x6253;&#x7ED3;&#x3002;&#x6CA1;&#x9519;&#xFF0C;&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;&#x5C31;&#x662F;&#x8981;&#x8BAD;&#x7EC3;&#x4F7F;&#x5176;&#x4E0D;&#x6253;&#x7ED3;&#x3002;<strong>&#x53D1;&#x97F3;&#x7684;&#x672C;&#x8D28;&#x8FD8;&#x662F;&#x808C;&#x8089;&#x3001;&#x6C14;&#x606F;&#x548C;&#x58F0;&#x5E26;&#x7684;&#x63A7;&#x5236;</strong>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x65E0;&#x89C6;&#x5355;&#x8BCD;&#x65E0;&#x89C6;&#x610F;&#x601D;&#xFF0C;&#x5C31;&#x50CF;&#x5531;&#x6B4C;&#x4E00;&#x6837;&#x6A21;&#x4EFF;&#x3002;&#x524D;&#x671F;&#x53EF;&#x4EE5;&#x4E00;&#x53E5;&#x4E00;&#x53E5;&#x8DDF;&#x8BFB;&#xFF0C;&#x7136;&#x540E;&#x4E32;&#x8D77;&#x6765;&#x5237;&#x904D;&#x6570;&#xFF0C;&#x901A;&#x5E38;&#x5230;&#x4E86; 30 &#x904D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#x53EF;&#x4EE5;&#x57FA;&#x672C;&#x8DDF;&#x4E0A;&#x8282;&#x594F;&#x3002;50 &#x904D;&#x7684;&#x65F6;&#x5019;&#x57FA;&#x672C;&#x80FD;&#x8BFB;&#x7684;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x63A8;&#x8350;&#x7684;&#x8D44;&#x6E90;&#x548C;&#x5DE5;&#x5177;&#x8BF7;&#x89C1;&#x4E0B;&#x65B9;&#x8D44;&#x6599;&#x63A8;&#x8350;&#x90E8;&#x5206;&#x3002;</p>
<h2 id="&#x7CBE;&#x542C;&#x548C;&#x6CDB;&#x542C;">&#x7CBE;&#x542C;&#x548C;&#x6CDB;&#x542C;</h2>
<p><strong>&#x3010;&#x7CBE;&#x542C;&#x548C;&#x6CDB;&#x542C;&#x662F;&#x6269;&#x5C55;&#x542C;&#x529B;&#x8BED;&#x6599;&#x5E93;&#x7684;&#x91CD;&#x8981;&#x65B9;&#x6CD5;&#x3011;</strong></p>
<p><strong>&#x7CBE;&#x542C;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#xFF1A;</strong></p>
<ol>
<li>&#x64AD;&#x653E;&#x4E00;&#x4E2A;&#x53E5;&#x5B50;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x9ED8;&#x5199;&#x4E0B;&#x6765;</li>
<li>&#x518D;&#x91CD;&#x590D;&#x542C;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#xFF0C;&#x4E0D;&#x65AD;&#x8865;&#x5145;&#x548C;&#x5B8C;&#x5584;&#x4F60;&#x7684;&#x53E5;&#x5B50;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x518D;&#x4E5F;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x5B8C;&#x5584;</li>
<li>&#x5BF9;&#x7167;&#x7B54;&#x6848;&#xFF0C;&#x67E5;&#x770B;&#x539F;&#x53E5;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;</li>
<li><strong>&#x5206;&#x6790;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x6709;&#x5199;&#x51FA;&#x539F;&#x53E5;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x6700;&#x91CD;&#x8981;</strong>&#x3002;&#x95EE;&#x4E0B;&#x81EA;&#x5DF1;&#xFF1A;<ul>
<li>&#x662F;&#x9047;&#x5230;&#x4E86;&#x751F;&#x8BCD;&#xFF1F;</li>
<li>&#x662F;&#x5355;&#x8BCD;&#x62FC;&#x9519;&#x4E86;&#xFF1F;</li>
<li>&#x6F0F;&#x4E86;&#x6216;&#x8005;&#x52A0;&#x4E86; -s&#x3001;-ed &#x540E;&#x7F00;&#xFF1F;&#x6F0F;&#x4E86;&#x6216;&#x8005;&#x542C;&#x9519;&#x4E86; a&#x3001;the&#xFF1F;</li>
</ul>
</li>
<li>&#x518D;&#x542C;&#x4E00;&#x904D;&#xFF0C;&#x9ED8;&#x5199;&#x4E0B;&#x6765;&#xFF0C;&#x6700;&#x597D;&#x518D;&#x8DDF;&#x8BFB;&#x51E0;&#x904D;</li>
</ol>
<p>&#x4ECE;&#x8FD9;&#x4E2A;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#x4E0D;&#x96BE;&#x770B;&#x51FA;&#xFF0C;&#x7CBE;&#x542C;&#x662F;&#x6269;&#x5C55;&#x97F3;&#x9891;&#x8BED;&#x6599;&#x5E93;&#x975E;&#x5E38;&#x5173;&#x952E;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x65E2;&#x8865;&#x5145;&#x4E86;&#x8BED;&#x6599;&#x5E93;&#x7684;&#x7D20;&#x6750;&#xFF0C;&#x4E5F;&#x8BAD;&#x7EC3;&#x4E86;&#x5BF9;&#x58F0;&#x97F3;&#x7684;&#x654F;&#x611F;&#x5EA6;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x5206;&#x8FA8;&#x8FDE;&#x8BFB;&#x7EC6;&#x8282;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x7EA0;&#x6B63;&#x4E86;&#x4F60;&#x7684;&#x8BED;&#x6599;&#x5E93;&#x7D20;&#x6750;&#x3002;&#x56E0;&#x4E3A;&#x5F53;&#x4F60;&#x542C;&#x5199;&#x5B8C;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x901A;&#x5E38;&#x9519;&#x8BEF;&#x4F1A;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#xFF1A;</p>
<ol>
<li>&#x5355;&#x8BCD;&#x4E0D;&#x8BA4;&#x8BC6; -&gt; &#x6309;&#x7167;&#x4E0A;&#x9762;&#x5B66;&#x4E60;&#x5355;&#x8BCD;&#x7684;&#x65B9;&#x5F0F;&#x5B66;&#x4E60; -&gt; <strong>&#x6269;&#x5C55;&#x65B0;&#x7684;&#x5355;&#x8BCD;&#x8BED;&#x6599;&#x5E93;</strong></li>
<li>&#x542C;&#x9519;&#x4E86;&#x5355;&#x8BCD;&#xFF0C;&#x6216;&#x8005;&#x8BA4;&#x8BC6;&#x7684;&#x5355;&#x8BCD;&#x6CA1;&#x542C;&#x51FA;&#x6765; -&gt; &#x5F53;&#x524D;&#x5355;&#x8BCD;&#x7684;&#x53D1;&#x97F3;&#x867D;&#x7136;&#x77E5;&#x9053;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x7F3A;&#x5C11;&#x591A;&#x6837;&#x5316;&#x7684;&#x53E3;&#x97F3;&#x7D20;&#x6750;&#x6216;&#x8005;&#x4F60;&#x4E4B;&#x524D;&#x5BF9;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x53D1;&#x97F3;&#x5C31;&#x662F;&#x9519;&#x7684; -&gt; <strong>&#x5B8C;&#x5584;&#x3001;&#x7EA0;&#x6B63;&#x97F3;&#x9891;&#x8BED;&#x6599;&#x5E93;</strong></li>
<li>&#x6F0F;&#x4E86;&#x6216;&#x8005;&#x52A0;&#x4E86; <code>-ed</code>&#x3001;<code>-s</code>&#xFF0C;&#x4EE5;&#x53CA; <code>a</code>&#x3001;<code>an</code>&#x3001;<code>the</code> &#x7B49; -&gt; &#x5BF9;&#x8FD9;&#x4E9B;&#x5355;&#x8BCD;&#x5728;&#x53E5;&#x5B50;&#x91CC;&#x7684;&#x53D1;&#x97F3;&#x89C4;&#x5219;&#x4E0D;&#x719F;&#xFF0C;&#x7531;&#x4E8E;&#x901A;&#x5E38;&#x97F3;&#x6807;&#x53EA;&#x4F1A;&#x6807;&#x6CE8;&#x5355;&#x8BCD;&#x672C;&#x8EAB;&#x800C;&#x4E0D;&#x4F1A;&#x6807;&#x8BB0;&#x5355;&#x8BCD;&#x53D8;&#x5F62;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x4E13;&#x9879;&#x53BB;&#x8BAD;&#x7EC3; -&gt; <strong>&#x63D0;&#x5347;&#x5BF9;&#x58F0;&#x97F3;&#x7EC6;&#x8282;&#x7684;&#x8FA8;&#x522B;</strong></li>
<li>&#x53D1;&#x97F3;&#x89C4;&#x5219;&#x4E0D;&#x719F;&#x6089;&#x3001;&#x8FDE;&#x8BFB;&#x5931;&#x7206;&#x7B49;&#x542C;&#x9519;&#xFF0C;&#x91CD;&#x8BFB;&#x5F31;&#x8BFB;&#x89C4;&#x5219;&#x4E0D;&#x719F;&#x6089;&#xFF0C;&#x4F8B;&#x5982; <code>group is</code> &#x542C;&#x6210; <code>grapy</code>&#x3001;<code>I&apos;ve been there</code> &#x4E2D; <code>have</code> &#x6F0F;&#x542C; -&gt; &#x65E5;&#x5E38;&#x53E3;&#x8BED;&#x4E3A;&#x4E86;&#x7701;&#x529B;&#x548C;&#x7A81;&#x51FA;&#x91CD;&#x70B9;&#x4F1A;&#x6709;&#x8FDE;&#x8BFB;&#x548C;&#x91CD;&#x8BFB;&#x7B49;&#xFF0C;&#x5C24;&#x5176;&#x662F; <code>H</code> &#x5F00;&#x5934;&#x7684;&#x5355;&#x8BCD;&#x901A;&#x5E38;&#x542C;&#x4E0D;&#x5230; <code>H</code>&#xFF0C;&#x5E38;&#x89C1; <code>is</code> &#x7B49;&#x90FD;&#x4F1A;&#x7565;&#x8BFB;&#xFF0C;<code>was</code> &#x7B49;&#x4F1A;&#x53D8;&#x58F0;&#x8DDF;&#x97F3;&#x6807;&#x4E0D;&#x540C; -&gt; <strong>&#x5B66;&#x4E60;&#x7279;&#x6B8A;&#x89C4;&#x5219;&#xFF0C;&#x63D0;&#x5347;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x8BC6;&#x522B;&#x5668;&#x80FD;&#x529B;</strong></li>
</ol>
<p>&#x5173;&#x4E8E;&#x7B2C; 4 &#x70B9;&#xFF0C;&#x63A8;&#x8350;&#x89C6;&#x9891; <a href="https://www.youtube.com/watch?v=MzhjD-XrYjg" target="_blank">How to Pronounce Contractions: American English Pronunciation</a> &#x770B;&#x5B8C;&#x4F60;&#x5C31;&#x77E5;&#x9053;&#x8001;&#x5916;&#x53D1;&#x97F3;&#x6709;&#x591A;&#x61D2;&#xFF0C;&#x4E0D;&#x5173;&#x952E;&#x7684;&#x5355;&#x8BCD;&#x80FD;&#x7701;&#x5C31;&#x7701;&#xFF0C;&#x5168;&#x9760;&#x4F60;&#x81EA;&#x5DF1;&#x8111;&#x8865;&#x3002;</p>
<p>&#x7531;&#x6B64;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x7CBE;&#x542C;&#x662F;&#x8BAD;&#x7EC3;&#x542C;&#x529B;&#x6700;&#x5173;&#x952E;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528; Excel &#x6765;&#x8BB0;&#x5F55;&#x81EA;&#x5DF1;&#x7EC3;&#x8FC7;&#x7684;&#x53E5;&#x5B50;&#x5E76;&#x505A;&#x6807;&#x8BB0;&#x7528;&#x4E8E;&#x56DE;&#x987E;&#xFF0C;&#x53EF;&#x4EE5;<a href="../assets/jingting.jpg">&#x70B9;&#x51FB;&#x8FD9;&#x91CC;&#x770B;&#x4E0B;&#x6211;&#x7684;&#x7B14;&#x8BB0;</a>&#x3002;</p>
<p><strong>&#x6CDB;&#x542C;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#xFF1A;</strong></p>
<ol>
<li>&#x968F;&#x4FBF;&#x627E;&#x4E00;&#x4EFD;&#x542C;&#x529B;&#x6750;&#x6599;&#x3002;</li>
<li>&#x542C;&#xFF0C;&#x5E76;&#x5C3D;&#x53EF;&#x80FD;&#x60F3;&#x4F60;&#x542C;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x3001;&#x5B83;&#x8BF4;&#x4E86;&#x4EC0;&#x4E48;&#x3002;</li>
</ol>
<p>&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x5728;&#x8D70;&#x8DEF;&#x3001;&#x5065;&#x8EAB;&#x3001;&#x5403;&#x996D;&#x7684;&#x65F6;&#x5019;&#x968F;&#x4FBF;&#x64AD;&#x70B9;&#x6750;&#x6599;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x81EA;&#x5DF1;&#x611F;&#x5174;&#x8DA3;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x4E0D;&#x9650;&#x5236;&#x3002;&#x5176;&#x5B9E;&#x770B;&#x7F8E;&#x5267;&#x5982;&#x679C;&#x4E0D;&#x770B;&#x5B57;&#x5E55;&#x4E5F;&#x57FA;&#x672C;&#x76F8;&#x5F53;&#x4E8E;&#x6CDB;&#x542C;&#x3002;&#x8FD9;&#x79CD;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5F53;&#x7136;&#x6548;&#x679C;&#x4E5F;&#x5341;&#x5206;&#x6709;&#x9650;&#xFF0C;<strong>&#x5B83;&#x4EC5;&#x53EF;&#x4EE5;&#x6269;&#x5145;&#x97F3;&#x9891;&#x8BED;&#x6599;&#x5E93;</strong>&#x3002;</p>
<p>&#x5728;&#x5907;&#x8003;&#x524D;&#x534A;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#xFF0C;&#x6BCF;&#x5929;&#x4E0B;&#x5348;&#x4E09;&#x70B9;&#x6211;&#x4F1A;&#x56FA;&#x5B9A;&#x8DD1;&#x6B65;&#x534A;&#x5C0F;&#x65F6;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x4F1A;&#x64AD;&#x653E;&#x542C;&#x529B;&#x8FDB;&#x884C;&#x6CDB;&#x542C;&#x3002;&#x80FD;&#x542C;&#x51FA;&#x4E00;&#x4E9B;&#x5355;&#x8BCD;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x591A;&#x5355;&#x8BCD;&#x542C;&#x4E0D;&#x61C2;&#x3002;&#x5F53;&#x7B2C;&#x4E8C;&#x5929;&#x5B66;&#x4E60;&#x4E86;&#x67D0;&#x4E9B;&#x65B0;&#x5355;&#x8BCD;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x6CDB;&#x542C;&#x540C;&#x4E00;&#x4E2A;&#x542C;&#x529B;&#x6750;&#x6599;&#x7684;&#x65F6;&#x5019;&#xFF0C;<strong>&#x611F;&#x89C9;&#x5C31;&#x50CF;&#x89E3;&#x9501;&#x8FD9;&#x5757;&#x58F0;&#x97F3;&#x4E71;&#x7801;&#x4E00;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x542C;&#x51FA;&#x521A;&#x5B66;&#x7684;&#x8FD9;&#x4E2A;&#x65B0;&#x5355;&#x8BCD;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x6CDB;&#x542C;&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#x5C06;&#x591A;&#x79CD;&#x53E3;&#x97F3;&#x4E0B;&#x7684;&#x8BED;&#x97F3;&#x7269;&#x6599;&#x5173;&#x8054;&#x4F60;&#x7684;&#x5355;&#x8BCD;&#x7269;&#x6599;&#xFF0C;&#x63D0;&#x9AD8;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x58F0;&#x97F3;&#x654F;&#x611F;&#x5EA6;&#x3002;</strong> &#x4EC5;&#x6B64;&#x800C;&#x5DF2;&#xFF0C;&#x4E0D;&#x8981;&#x671F;&#x671B;&#x6709;&#x66F4;&#x5927;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;<strong>&#x542C;&#x529B;&#x8BAD;&#x7EC3;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8FD8;&#x662F;&#x53BB;&#x627E;&#x5230;&#x4F60;&#x542C;&#x4E0D;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x5E76;&#x5C06;&#x5176;&#x7EC3;&#x5230;&#x80FD;&#x542C;&#x51FA;&#x6765;</strong>&#xFF0C;&#x7CBE;&#x542C;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x7CBE;&#x529B;&#xFF0C;&#x6CDB;&#x542C;&#x4E5F;&#x53EF;&#x4EE5;&#x90E8;&#x5206;&#x8F85;&#x52A9;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="KnowledgeBase.html" class="navigation navigation-prev " aria-label="Previous page: 扩充语料库的训练方法">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Thinking.html" class="navigation navigation-next " aria-label="Next page: 英语思维训练">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"发音和听力训练方法","level":"1.4.2","depth":2,"next":{"title":"英语思维训练","level":"1.4.3","depth":2,"path":"training/Thinking.md","ref":"./training/Thinking.md","articles":[]},"previous":{"title":"扩充语料库的训练方法","level":"1.4.1","depth":2,"path":"training/KnowledgeBase.md","ref":"./training/KnowledgeBase.md","articles":[]},"dir":"ltr"},"config":{"plugins":["editlink","baidu-tongji","book-summary-scroll-position-saver","disqus","github","splitter"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"a-programmers-guide-to-english"},"github":{"url":"https://github.com/yujiangshui/A-Programmers-Guide-to-English"},"editlink":{"label":"Edit This Page","multilingual":false,"base":"https://github.com/yujiangshui/A-Programmers-Guide-to-English/edit/master"},"baidu-tongji":{"url":"https://hm.baidu.com/hm.js","token":"d06ab4cb74251c2a6ad3d47a7d9c2864"},"book-summary-scroll-position-saver":{},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"A Programmer's Guide to English","gitbook":"*"},"file":{"path":"training/ListeningandSpeaking.md","mtime":"2019-01-17T15:45:55.018Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-19T06:53:10.067Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-baidu-tongji/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-book-summary-scroll-position-saver/book-summary-scroll-position-saver.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

