
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>资料、工具推荐和扩展阅读 · A Programmer's Guide to English</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../qa/WhyPTE.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    关于本指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../essence/">
            
                <a href="../essence/">
            
                    
                    语言学习的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../make-a-program/">
            
                <a href="../make-a-program/">
            
                    
                    如何构建一个识别英语的程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../training/">
            
                <a href="../training/">
            
                    
                    我的训练方法
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../training/KnowledgeBase.html">
            
                <a href="../training/KnowledgeBase.html">
            
                    
                    扩充语料库的训练方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../training/ListeningandSpeaking.html">
            
                <a href="../training/ListeningandSpeaking.html">
            
                    
                    发音和听力训练方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../training/Thinking.html">
            
                <a href="../training/Thinking.html">
            
                    
                    英语思维训练
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../qa/">
            
                <a href="../qa/">
            
                    
                    常见问题 QA
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../qa/WhyPTE.html">
            
                <a href="../qa/WhyPTE.html">
            
                    
                    为什么我选择 PTE 考试
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="./">
            
                <a href="./">
            
                    
                    资料、工具推荐和扩展阅读
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >资料、工具推荐和扩展阅读</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8D44;&#x6599;&#x3001;&#x5DE5;&#x5177;&#x63A8;&#x8350;&#x548C;&#x6269;&#x5C55;&#x9605;&#x8BFB;">&#x8D44;&#x6599;&#x3001;&#x5DE5;&#x5177;&#x63A8;&#x8350;&#x548C;&#x6269;&#x5C55;&#x9605;&#x8BFB;</h1>
<h2 id="&#x5355;&#x8BCD;&#x91CF;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;">&#x5355;&#x8BCD;&#x91CF;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;</h2>
<ul>
<li>&#x9996;&#x63A8; <a href="http://testyourvocab.com/" target="_blank">http://testyourvocab.com/</a></li>
<li>&#x5176;&#x6B21;&#x6B27;&#x8DEF;&#x8BCD;&#x5178;&#x624B;&#x673A;&#x7248;&#x4E2D;&#x4E5F;&#x6709;&#x6D4B;&#x8BD5;&#x7A0B;&#x5E8F;&#xFF0C;&#x6D4B;&#x8BD5;&#x65B9;&#x5F0F;&#x5F88;&#x5408;&#x7406;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;</li>
</ul>
<h2 id="&#x5584;&#x7528;-google">&#x5584;&#x7528; Google</h2>
<p>&#x524D;&#x9762;&#x5927;&#x7BC7;&#x5E45;&#x63D0;&#x5230;&#x4E86; Google &#x7684;&#x5173;&#x952E;&#x8BCD;&#x63A8;&#x8350;&#x3001;&#x56FE;&#x7247;&#x4EE5;&#x53CA;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#xFF0C;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x7684;&#x3002;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x7528;&#x82F1;&#x6587;&#x5173;&#x952E;&#x8BCD;&#x53BB;&#x641C;&#x7D22;&#xFF0C;&#x5E76;&#x6CE8;&#x610F;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x6211;&#x7684; Mac &#x7684; PDF Preview &#x5728;&#x62D6;&#x52A8;&#x9F20;&#x6807;&#x9009;&#x4E2D;&#x6587;&#x672C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6CA1;&#x6709;&#x80CC;&#x666F;&#x989C;&#x8272;&#xFF0C;&#x5BFC;&#x81F4;&#x770B;&#x4E0D;&#x51FA;&#x9009;&#x4E2D;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x6587;&#x672C;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x5C31;&#x5806;&#x780C;&#x5173;&#x952E;&#x8BCD; <code>macbook preview pdf text selection background color</code> &#x8BD5;&#x56FE;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;Google &#x641C;&#x7D22;&#x7ED9;&#x6211;&#x63A8;&#x4E86; <a href="https://apple.stackexchange.com/questions/342964/missing-text-highlighting-color-when-selecting-it-in-preview" target="_blank">Missing text highlighting Color when selecting it in Preview</a> &#x8FD9;&#x4E2A;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#xFF0C;&#x6210;&#x529F;&#x89E3;&#x51B3;&#x4E86;&#x6211;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x540E;&#x9762;&#x8FD9;&#x53E5;&#x5BF9;&#x6BD4;&#x524D;&#x9762;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x5B66;&#x5230;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x9996;&#x5148;&#x662F; <code>missing</code> &#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x5176;&#x6B21;&#x8FD9;&#x79CD;&#x80CC;&#x666F;&#x989C;&#x8272;&#x4E0D;&#x662F; <code>background color</code> &#x800C;&#x662F; <code>highlighting color</code>&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53E5;&#x5F0F;&#x7ED3;&#x6784;&#x4E5F;&#x975E;&#x5E38;&#x5DE5;&#x6574;&#xFF0C;&#x7B80;&#x6D01;&#x53C8;&#x51C6;&#x786E;&#x3002;</p>
<h3 id="&#x5199;&#x4F5C;&#x8F85;&#x52A9;&#x5DE5;&#x5177;">&#x5199;&#x4F5C;&#x8F85;&#x52A9;&#x5DE5;&#x5177;</h3>
<p>&#x5199;&#x4F5C;&#x6700;&#x5934;&#x75BC;&#x7684;&#x5C31;&#x662F;&#x5BB3;&#x6015;&#x8BED;&#x6CD5;&#x3001;&#x8BED;&#x4E49;&#x6709;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8BED;&#x6CD5;&#x65B9;&#x9762;&#x6211;&#x63A8;&#x8350; <a href="https://www.grammarly.com/" target="_blank">Grammarly</a> &#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x5728;&#x82F1;&#x8BED;&#x56FD;&#x5BB6;&#x4E5F;&#x5341;&#x5206;&#x6D41;&#x884C;&#xFF0C;&#x5B89;&#x88C5;<a href="https://chrome.google.com/webstore/detail/grammarly-for-chrome/kbfnbcaeplbcioakkpcpgfkobkghlhen" target="_blank">&#x5B83;&#x7684; Chrome &#x63D2;&#x4EF6;</a>&#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x7F51;&#x9875;&#x6587;&#x672C;&#x6846;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x5426;&#x6709;&#x8BED;&#x6CD5;&#x95EE;&#x9898;&#x3002;&#x8D2D;&#x4E70;&#x4E86;&#x4ED8;&#x8D39;&#x4F1A;&#x5458;&#xFF0C;&#x4F1A;&#x5BF9;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x66F4;&#x6DF1;&#x5EA6;&#x4F18;&#x5316;&#xFF0C;&#x4F1A;&#x901A;&#x8FC7;&#x6D77;&#x91CF;&#x5185;&#x5BB9;&#x5E93;&#x5BF9;&#x4F60;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#xFF0C;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x6539;&#x8FDB;&#xFF08;&#x6BD4;&#x5982;&#x540C;&#x4E49;&#x8BCD;&#x66FF;&#x6362;&#x3001;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#x7B49;&#xFF09;&#xFF0C;&#x5F53;&#x7136;&#x57FA;&#x7840;&#x8BED;&#x6CD5;&#x76D1;&#x6D4B;&#x529F;&#x80FD;&#x514D;&#x8D39;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x8BED;&#x4E49;&#x65B9;&#x9762;&#x6211;&#x63A8;&#x8350; <a href="https://translate.google.as/" target="_blank">Google Translate</a>&#xFF0C;&#x7528;&#x5B83;&#x5C06;&#x4F60;&#x5199;&#x7684;&#x82F1;&#x6587;&#x7FFB;&#x8BD1;&#x6210;&#x4E2D;&#x6587;&#xFF0C;&#x6765;&#x770B;&#x770B;&#x610F;&#x601D;&#x662F;&#x5426;&#x8DDF;&#x81EA;&#x5DF1;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x8FD9;&#x4FE9;&#x53EF;&#x4EE5;&#x914D;&#x5408;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF1A;</p>
<p><img src="../assets/grammarly-google.jpg" alt=""></p>
<p><strong>&#x7FA4;&#x53CB;&#x4E5F;&#x8D21;&#x732E;&#x4E86;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x6A2A;&#x5411;&#x5BF9;&#x6BD4;&#x591A;&#x4E2A;&#x7FFB;&#x8BD1;&#x5E73;&#x53F0;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF1A; <a href="http://translation.education/paratrans/index.php" target="_blank">http://translation.education/paratrans/index.php</a> &#x3002;</strong></p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x673A;&#x5668;&#x6BD5;&#x7ADF;&#x673A;&#x5668;&#xFF0C;&#x80AF;&#x5B9A;&#x4F1A;&#x5B58;&#x5728;&#x8BEF;&#x5DEE;&#xFF0C;&#x4F7F;&#x7528;&#x65F6;&#x4E5F;&#x6CE8;&#x610F;&#x7504;&#x522B;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;&#x4E0D;&#x8FC7;&#x4EBA;&#x4E5F;&#x6709;&#x8BEF;&#x89E3;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<h2 id="youtube-&#x4F18;&#x79C0;&#x8001;&#x5E08;">Youtube &#x4F18;&#x79C0;&#x8001;&#x5E08;</h2>
<ul>
<li><a href="https://www.youtube.com/channel/UCvn_XCl_mgQmt3sD753zdJA" target="_blank">Rachel&apos;s English</a> &#x7F8E;&#x8BED;&#x53D1;&#x97F3;&#xFF0C;&#x5F88;&#x4F18;&#x79C0;&#x7684;&#x8001;&#x5E08;&#x3002;</li>
<li><a href="https://www.youtube.com/user/engvidenglish" target="_blank">engVid</a> &#x7EFC;&#x5408;&#x6027;&#x7684;&#x514D;&#x8D39;&#x82F1;&#x8BED;&#x5B66;&#x4E60;&#x7F51;&#x7AD9;&#xFF0C;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#xFF0C;&#x5F88;&#x591A;&#x8001;&#x5E08;&#x5F88;&#x591A;&#x89C6;&#x9891;&#xFF0C;&#x5B98;&#x65B9;&#x7F51;&#x7AD9; <a href="https://www.engvid.com/" target="_blank">https://www.engvid.com/</a> &#x3002;&#x6211;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x4E0B;&#x9762;&#x4E09;&#x4E2A;&#x8001;&#x5E08;&#xFF0C;&#x5404;&#x6709;&#x98CE;&#x683C;&#xFF1A;<ul>
<li><a href="https://www.youtube.com/user/JamesESL" target="_blank">JamesESL</a> &#x81EA;&#x5E26; Rap&#x3002;</li>
<li><a href="https://www.youtube.com/user/EnglishLessons4U" target="_blank">Ronnie</a> &#x80A2;&#x4F53;&#x52A8;&#x4F5C;&#x5F88;&#x4E30;&#x5BCC;&#x3002;</li>
<li><a href="https://www.youtube.com/user/EnglishTeacherEmma" target="_blank">Emma</a> </li>
</ul>
</li>
<li><a href="https://www.youtube.com/channel/UCXqIlSRBuqbq41hfl7cwGWw" target="_blank">Tarle Speech &amp; Language Services</a> &#x5F88;&#x591A;&#x5355;&#x8BCD;&#x53D1;&#x97F3;&#x5BF9;&#x6BD4;&#x89C6;&#x9891;&#x3002;</li>
<li><a href="https://www.youtube.com/channel/UCL5E5b5Ig88hVA8paYNcYLg" target="_blank">SPEAK ENGLISH with SOZO-X</a> &#x7684;&#x4E5F;&#x4E0D;&#x9519;&#xFF0C;&#x53D1;&#x97F3;&#x6CE8;&#x91CD;&#x53E3;&#x578B;&#xFF0C;&#x6700;&#x540E;&#x6709;&#x5C0F; quiz&#x3002;</li>
</ul>
<h2 id="&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;&#x7D20;&#x6750;&#x548C;&#x8F6F;&#x4EF6;">&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;&#x7D20;&#x6750;&#x548C;&#x8F6F;&#x4EF6;</h2>
<p>&#x5BFB;&#x627E;&#x8BAD;&#x7EC3;&#x7D20;&#x6750;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x96BE;&#x5EA6;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x73B0;&#x5728;&#x6C34;&#x5E73;&#x662F; 1&#xFF0C;&#x8981;&#x627E;&#x7684;&#x7D20;&#x6750;&#x96BE;&#x5EA6;&#x5E94;&#x8BE5;&#x4ECB;&#x4E8E; 1.2 - 1.5 &#x4E4B;&#x95F4;&#x6700;&#x6709;&#x6548;&#x679C;&#x3002;&#x592A;&#x7B80;&#x5355;&#x548C;&#x592A;&#x96BE;&#x90FD;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x7684;&#x8D44;&#x6599;&#x3002;</p>
<p>&#x5B66;&#x672F;&#x7C7B;&#x6211;&#x7528;&#x8FC7;&#x4E24;&#x4E2A;&#x7D20;&#x6750;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;<strong>&#x8001;&#x6258;93</strong>&#xFF0C;&#x4E0D;&#x7B97;&#x592A;&#x96BE;&#xFF0C;&#x6258;&#x798F;&#x8003;&#x8BD5;&#x8BAD;&#x7EC3;&#x7D20;&#x6750;&#xFF0C;&#x6BCF;&#x7BC7;&#x6709;&#x4E2A;&#x4E3B;&#x9898;&#xFF0C;&#x7531;&#x4E13;&#x4E1A;&#x64AD;&#x97F3;&#x8BFB;&#xFF0C;&#x5185;&#x5BB9;&#x6BD4;&#x8F83;&#x8001;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x662F;<strong>&#x79D1;&#x5B66; 60s</strong>&#xFF0C;&#x57FA;&#x672C;&#x5728;&#x4E00;&#x4E24;&#x5206;&#x949F;&#x5185;&#x8BB2;&#x8FF0;&#x4E00;&#x4E2A;&#x79D1;&#x5B66;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6709;&#x81EA;&#x8FF0;&#x4E5F;&#x6709;&#x5BF9;&#x8BDD;&#xFF0C;&#x96BE;&#x5EA6;&#x504F;&#x9AD8;&#xFF0C;&#x4E00;&#x662F;&#x5FEB;&#xFF0C;&#x4E8C;&#x662F;&#x6709;&#x4E9B;&#x79D1;&#x5B66;&#x76F8;&#x5173;&#x5355;&#x8BCD;&#x4E0D;&#x4F1A;&#xFF0C;&#x7ECF;&#x5E38;&#x66F4;&#x65B0;&#x3002;</p>
<p>&#x6B64;&#x5916;&#x4E5F;&#x6709;&#x63A8;&#x8350; <strong>BBC &#x5E7F;&#x64AD;</strong>&#x3001;<strong>VOA &#x6162;&#x901F;&#x82F1;&#x8BED;</strong>&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x7528;&#x7684;&#x6BD4;&#x8F83;&#x5C11;&#x3002;&#x8FD8;&#x6709;&#x63A8;&#x8350;<strong>&#x7ECF;&#x6D4E;&#x5B66;&#x4EBA;</strong>&#xFF0C;&#x6211;&#x6709;&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;&#x8FC7;&#xFF0C;&#x504F;&#x82F1;&#x5F0F;&#xFF0C;&#x6709;&#x7684;&#x4E3B;&#x64AD;&#x8BED;&#x901F;&#x98DE;&#x5FEB;&#xFF0C;&#x611F;&#x89C9;&#x633A;&#x96BE;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x9009;&#x62E9;&#x7F8E;&#x5F0F;&#x53D1;&#x97F3;&#xFF0C;&#x653E;&#x5F03;&#x3002;</p>
<p>&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;&#x548C;&#x542C;&#x529B;&#x8F6F;&#x4EF6;&#x9996;&#x63A8;<a href="http://dict.eudic.net/ting/" target="_blank">&#x300A;&#x6BCF;&#x65E5;&#x82F1;&#x8BED;&#x542C;&#x529B;&#x300B;</a>&#xFF0C;&#x8DDF;&#x6B27;&#x8DEF;&#x8BCD;&#x5178;&#x540C;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x4E0A;&#x9762;&#x8D44;&#x6599;&#x5168;&#x90FD;&#x6709;&#xFF0C;&#x5355;&#x53E5;&#x91CD;&#x653E;&#x4EE5;&#x53CA;&#x8DDF;&#x8BFB;&#x5F55;&#x97F3;&#x8BC6;&#x522B;&#x6253;&#x5206;&#x529F;&#x80FD;&#x90FD;&#x6709;&#xFF0C;&#x6700;&#x5173;&#x952E;&#x7684;&#x662F;&#x652F;&#x6301; Mac&#x3002;&#x5176;&#x6B21; <a href="http://www.aboboo.com/g/#/" target="_blank">Aboboo</a> &#x4E5F;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5BFC;&#x5165;&#x97F3;&#x9891;&#x5E2E;&#x4F60;&#x5207;&#x5272;&#x8FDB;&#x884C;&#x590D;&#x8BFB;&#xFF0C;&#x65B9;&#x4FBF;&#x5F71;&#x5B50;&#x8DDF;&#x8BFB;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x652F;&#x6301; Windows &#x5E73;&#x53F0;&#x3002;</p>
<h2 id="&#x82F1;&#x8BED;&#x6D41;&#x5229;&#x8BF4;-&#x61C2;&#x4F60;&#x82F1;&#x8BED;">&#x82F1;&#x8BED;&#x6D41;&#x5229;&#x8BF4; &#x61C2;&#x4F60;&#x82F1;&#x8BED;</h2>
<p>&#x82F1;&#x8BED;&#x6D41;&#x5229;&#x8BF4; App &#x7684;&#x300A;&#x61C2;&#x4F60;&#x82F1;&#x8BED;&#x300B;&#x8BFE;&#x7A0B;&#x8FD8;&#x53EF;&#x4EE5;&#xFF0C;&#x5B83;&#x7684;&#x8BAD;&#x7EC3;&#x6A21;&#x5F0F;&#x975E;&#x5E38;&#x6709;&#x6548;&#x3002;&#x9996;&#x5148;&#x7ED9;&#x4F60;&#x573A;&#x666F;&#x56FE;&#x7247;&#xFF0C;&#x64AD;&#x653E;&#x97F3;&#x9891;&#x8BA9;&#x4F60;&#x8DDF;&#x8BFB;&#xFF0C;&#x4E4B;&#x540E;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x9898;&#x95EE;&#x4F60;&#x521A;&#x542C;&#x5230;&#x7684;&#x5185;&#x5BB9;&#x5E76;&#x4E14;&#x8BA9;&#x4F60;&#x8DDF;&#x7740;&#x8BFB;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x8BC6;&#x522B;&#x6253;&#x5206;&#x534F;&#x52A9;&#x7EA0;&#x97F3;&#x3002;</p>
<p>&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x6CA1;&#x6709;&#x6587;&#x672C;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x4E13;&#x6CE8;&#x6A21;&#x4EFF;&#x58F0;&#x97F3;&#x3001;&#x89E3;&#x6790;&#x58F0;&#x97F3;&#x3002;&#x6709;&#x65F6;&#x5019;&#x5982;&#x679C;&#x542C;&#x7684;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6587;&#x672C;&#xFF0C;&#x4F1A;&#x66F4;&#x5BB9;&#x6613;&#x590D;&#x8FF0;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x4F1A;&#x964D;&#x4F4E;&#x542C;&#x529B;&#x8BC6;&#x522B;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p><strong>&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x5B8C;&#x7F8E;&#x7684;</strong> &#xFF0C;&#x751F;&#x8BCD;&#x5F80;&#x5F80;&#x4F1A;&#x5361;&#x4F4F;&#x4F60;&#x7684;&#x8DDF;&#x8BFB;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x663E;&#x793A;&#x6587;&#x672C;&#x9760;&#x542C;&#x548C;&#x8BFB;&#x5F88;&#x96BE;&#x5B66;&#x5230;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x3002;&#x5176;&#x6B21; <strong>&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x5F15;&#x64CE;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x51C6;</strong> &#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6F0F;&#x8BCD;&#x52A0;&#x8BCD;&#x4E5F;&#x4F1A;&#x6807;&#x8BB0;&#x4F60;&#x8BFB;&#x5BF9;&#x4E86;&#xFF0C;&#x800C;&#x4E14; <strong>&#x5728;&#x8DDF;&#x8BFB;&#x8FC7;&#x7A0B;&#x7531;&#x4E8E;&#x4E0D;&#x663E;&#x793A;&#x6587;&#x672C;&#xFF0C;&#x4E0D;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x5177;&#x4F53;&#x54EA;&#x4E2A;&#x5355;&#x8BCD;&#x3001;&#x54EA;&#x4E2A;&#x5730;&#x65B9;&#x9519;&#x4E86;</strong> &#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x5BFC;&#x81F4;&#x4F60;&#x8DDF;&#x8BFB;&#x65F6;&#xFF0C;&#x4E00;&#x76F4;&#x8BFB;&#x9519;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x53EA;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x8BFB;&#x7684;&#x8FD8;&#x884C;&#x3002;</p>
<p>&#x6B64;&#x5916;&#x61C2;&#x4F60;&#x82F1;&#x8BED;&#x5E76;&#x975E;&#x514D;&#x8D39;&#x8BFE;&#x7A0B;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4ED8;&#x8D39;&#x8D2D;&#x4E70;&#xFF0C;&#x4F7F;&#x7528;&#x6548;&#x679C;&#x4E5F;&#x56E0;&#x4EBA;&#x800C;&#x5F02;&#xFF0C;<a href="https://github.com/yujiangshui/A-Programmers-Guide-to-English/issues/8" target="_blank">&#x8BE6;&#x60C5;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x8FD9;&#x4E2A; Issue</a> &#xFF0C;&#x672C;&#x4EBA;&#x4EA6;&#x65E0;&#x5229;&#x76CA;&#x76F8;&#x5173;&#xFF0C;&#x8BF7;&#x81EA;&#x884C;&#x4F53;&#x9A8C;&#x3001;&#x5224;&#x65AD;&#x662F;&#x5426;&#x8D2D;&#x4E70;&#x3002;</p>
<h3 id="&#x5B9E;&#x7528;-chrome-&#x63D2;&#x4EF6;">&#x5B9E;&#x7528; Chrome &#x63D2;&#x4EF6;</h3>
<p>&#x6211;&#x66FE;&#x5B89;&#x88C5;&#x8FC7;&#x975E;&#x5E38;&#x591A;&#x82F1;&#x8BED;&#x76F8;&#x5173;&#x63D2;&#x4EF6;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x552F;&#x4E00;&#x4FDD;&#x7559;&#x81F3;&#x4ECA;&#x5E38;&#x7528;&#x7684;&#x63D2;&#x4EF6;&#xFF1A;</p>
<ul>
<li><a href="https://chrome.google.com/webstore/detail/cambridge-dictionary/kjmjndmenaoihimmojhdabgfjefonmja" target="_blank">Cambridge Dictionary</a>&#xFF1A;&#x5BF9;&#x51C6;&#x5355;&#x8BCD;&#x53F3;&#x51FB;&#x5C31;&#x6253;&#x5F00; Cambridge Dictionary &#x770B;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x8BCD;&#x4E49;&#xFF0C;&#x7528;&#x4EE5;&#x91CD;&#x5EA6;&#x67E5;&#x8BE2;</li>
<li><a href="https://chrome.google.com/webstore/detail/google-dictionary-by-goog/mgijmajocgfcbeboacabfgobmjgjcoja" target="_blank">Google Dictionary (by Google)</a>&#xFF1A;&#x53CC;&#x51FB;&#x5373;&#x53EF;&#x5F39;&#x51FA;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x5F39;&#x7A97;&#xFF0C;&#x9644;&#x5E26;&#x4E00;&#x4E2A;&#x82F1;&#x6587;&#x53D1;&#x97F3;&#x548C;&#x7B80;&#x77ED;&#x7684;&#x82F1;&#x6587;&#x91CA;&#x4E49;&#xFF0C;&#x7528;&#x4EE5;&#x8F7B;&#x5EA6;&#x67E5;&#x8BE2;</li>
<li><a href="https://chrome.google.com/webstore/detail/grammarly-for-chrome/kbfnbcaeplbcioakkpcpgfkobkghlhen" target="_blank">Grammarly</a>&#xFF1A;&#x8BED;&#x6CD5;&#x68C0;&#x6D4B;&#x3002;</li>
</ul>
<h2 id="&#x5176;&#x4ED6;&#x4F18;&#x79C0;&#x82F1;&#x8BED;&#x6559;&#x7A0B;">&#x5176;&#x4ED6;&#x4F18;&#x79C0;&#x82F1;&#x8BED;&#x6559;&#x7A0B;</h2>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4EFD; 2004 &#x7684;&#x8D44;&#x6599;&#xFF0C;&#x53F0;&#x6E7E;&#x4E00;&#x5927;&#x5B66;&#x82F1;&#x8BED;&#x8001;&#x5E08;&#x505A;&#x7684;&#x7F51;&#x7AD9; <a href="http://chifenchen.tripod.com/" target="_blank">http://chifenchen.tripod.com/</a> &#x867D;&#x7136;&#x5F88;&#x8001;&#x571F;&#xFF0C;&#x4F46;&#x662F;&#x77E5;&#x8BC6;&#x4E0D;&#x8FC7;&#x65F6;&#xFF0C;&#x6BD4;&#x8F83;&#x7CFB;&#x7EDF;&#x3001;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#x7684;&#x4ECB;&#x7ECD;&#x4E86;&#x53D1;&#x97F3;&#x7684;&#x51E0;&#x4E2A;&#x70B9;&#xFF0C;&#x800C;&#x4E14;&#x53D1;&#x97F3;&#x975E;&#x5E38;&#x51C6;&#x3002;</p>
<h2 id="&#x4F18;&#x79C0;&#x7684;&#x7ECF;&#x9A8C;&#x6280;&#x5DE7;&#x6269;&#x5C55;&#x9605;&#x8BFB;">&#x4F18;&#x79C0;&#x7684;&#x7ECF;&#x9A8C;&#x6280;&#x5DE7;&#x6269;&#x5C55;&#x9605;&#x8BFB;</h2>
<ul>
<li><a href="https://www.zhihu.com/question/30781969/answer/49608070" target="_blank">&#x5982;&#x4F55;&#x6709;&#x6548;&#x79EF;&#x7D2F;&#x4E3B;&#x52A8;&#x8BCD;&#x6C47;&#xFF1F;</a> &#x5EFA;&#x7ACB;&#x8868;&#x8FBE;&#x7D20;&#x6750;&#x5E93;&#xFF0C;&#x65B9;&#x4FBF;&#x63D0;&#x5347;&#x7406;&#x89E3;&#x5668;&#x80FD;&#x529B;&#x3002;</li>
<li><a href="https://www.zhihu.com/question/62360046/answer/441160584" target="_blank">&#x82F1;&#x8BED;&#x597D;&#x7684;&#x4EBA;&#x662F;&#x600E;&#x6837;&#x80CC;&#x5355;&#x8BCD;&#x7684;&#xFF1F;</a> &#x5F3A;&#x8C03;&#x8F93;&#x5165;&#x82F1;&#x6587;&#x5B66;&#x4E60;&#x5355;&#x8BCD;&#xFF0C;&#x5728;&#x8BED;&#x5883;&#x4E2D;&#x8865;&#x5145;&#x8BED;&#x6599;&#x5E93;&#xFF0C;&#x63D0;&#x5347;&#x82F1;&#x6587;&#x601D;&#x7EF4;&#x3002;</li>
<li><a href="https://zhuanlan.zhihu.com/p/47823614" target="_blank">&#x56FD;&#x5185;&#x82F1;&#x8BED;&#x57F9;&#x8BAD;&#x673A;&#x6784;&#x6367;&#x4E0A;&#x5929;&#x7684;&#x300C;&#x81EA;&#x7136;&#x62FC;&#x8BFB;&#x6CD5;&#x300D;&#xFF0C;&#x771F;&#x7684;&#x90A3;&#x4E48;&#x795E;&#x5947;&#x5417;&#xFF1F;</a> &#x5F3A;&#x8C03;&#x97F3;&#x6807;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;</li>
<li><a href="https://www.zhihu.com/question/20097263/answer/550557989" target="_blank">&#x600E;&#x4E48;&#x7EC3;&#x597D;&#x82F1;&#x8BED;&#x53E3;&#x8BED;&#xFF1F;</a> &#x4E00;&#x4F4D;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x505A;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x5F3A;&#x8C03;&#x8F93;&#x5165;&#x82F1;&#x8BED;&#x5B66;&#x4E60;&#xFF0C;&#x4EE5;&#x53CA;&#x8BAD;&#x7EC3;&#x5230;&#x65E0;&#x610F;&#x8BC6;&#x8F93;&#x51FA;&#x3002;</li>
<li><a href="https://zhuanlan.zhihu.com/p/51137151" target="_blank">&#x7EA0;&#x6B63;/&#x7EC3;&#x4E60;&#x82F1;&#x8BED;&#x53D1;&#x97F3;&#x7684;&#x597D;&#x6750;&#x6599;</a> &#x4E00;&#x4EFD;&#x7EA0;&#x6B63;&#x53D1;&#x97F3;&#x7684;&#x7ECF;&#x5178;&#x6750;&#x6599;&#xFF0C;&#x6B63;&#x6587;&#x5C31;&#x662F;&#x5F88;&#x677E;&#x6563;&#x5730;&#x628A;&#x4E00;&#x7CFB;&#x5217;&#x5F62;&#x4F3C;&#x97F3;&#x4E0D;&#x4F3C;&#x3001;&#x97F3;&#x4F3C;&#x5F62;&#x4E0D;&#x4F3C;&#x7684;&#x5355;&#x8BCD;&#x4E32;&#x8D77;&#x6765;&#xFF0C;&#x8BA9;&#x4F60;&#x4ED4;&#x7EC6;&#x4F53;&#x4F1A;&#x5176;&#x4E2D;&#x7684;&#x5DEE;&#x522B;&#x3002;&#x7EC3;&#x597D;&#x53EF;&#x4EE5;&#x78E8;&#x5634;&#x76AE;&#x5B50;&#x540C;&#x65F6;&#x5BF9;&#x97F3;&#x6807;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x66F4;&#x5BB9;&#x6613;&#x5206;&#x8FA8;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../qa/WhyPTE.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 为什么我选择 PTE 考试">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"资料、工具推荐和扩展阅读","level":"1.6","depth":1,"previous":{"title":"为什么我选择 PTE 考试","level":"1.5.1","depth":2,"path":"qa/WhyPTE.md","ref":"./qa/WhyPTE.md","articles":[]},"dir":"ltr"},"config":{"plugins":["editlink","baidu-tongji","book-summary-scroll-position-saver","disqus","github","splitter"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"a-programmers-guide-to-english"},"github":{"url":"https://github.com/yujiangshui/A-Programmers-Guide-to-English"},"editlink":{"label":"Edit This Page","multilingual":false,"base":"https://github.com/yujiangshui/A-Programmers-Guide-to-English/edit/master"},"baidu-tongji":{"url":"https://hm.baidu.com/hm.js","token":"d06ab4cb74251c2a6ad3d47a7d9c2864"},"book-summary-scroll-position-saver":{},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"A Programmer's Guide to English","gitbook":"*"},"file":{"path":"resources/README.md","mtime":"2019-01-19T06:52:30.670Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-19T06:53:10.067Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-baidu-tongji/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-book-summary-scroll-position-saver/book-summary-scroll-position-saver.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

